{"name": "dinning", "trans": [{"dict": "TOEIC", "values": ["din1 nounPlural dins, Plural DINs dɪndɪnA loud, unpleasant, and prolonged noise. the fans made an awful din Example sentencesExamples I just didn't want to add my voice to the din of noise that has filled the public square regarding this tragic woman's fate. If you listen closely enough, you should be able to make out the angry words above the din: a cacophony of female voices raised to the rafters with one common message for their menfolk. I would have liked to converse with her a little further about the food sources, but the ear-deafening din meant that barking our orders to her was about all we could do. Animals added their noises to the din, poultry screeching and draft animals lowing as they were displayed and examined. Every England fan had a whooping, whistling counterpart so we shouted louder until the din was indescribable. ‘Go away, I'm busy’ he yelled above the din of the sewing machine. In an instant, it was clear that the ward was an intolerably noisy place, flooded with a near-continuous din of screams, laughter, and loud vocalizations. ‘Hello darling,’ said Lewis on the other end above a loud din in the background. ‘I want to come back when it's a bit quieter,’ I shouted over the din of amplified music, throbbing diesel generators and rattling joy rides. The people were inside and the radio was turned up loud to drown out the din of the men yelling and laughing as they drank coffee and beer. In the background I read that towards the end of its life as a chapel in the convict period, free settlers got very cross with the fact that the convicts were making an awful din from under their pews. The next moment his loud shout rose over the din of battle, and swinging his hat over his head for a banner to those who pressed after, he spurred against the flying enemy. A couple of days of silence make the din seem so much louder. Finding it difficult to handle them at home, many owners go in search of kennels where they are safely housed from the din and noise. The merry din of talk, laughter, music, and clattering dinnerware spills outside. It has something to do with the book reviewing climate and the endless din buzzing around readers and publishers alike. While attending the lectures, the din of clashes outside the campus was audible. People shout to be heard over the din, loud mufflerless trucks rumble by on the street, dogs bark, a mysterious polytonal chittering in the background sounds like a great horde of rats. Although its cries were becoming increasingly desperate as the din of barking and shouting intensified, the thought of trying to help never entered my mind. The plant is noisy, and she and her co-workers pass the time by shouting over the din, catching up on gossip and talking about food and cosmetics. Synonymsuproar, racket, loud noise, confused noise, commotion, cacophony, babel, hubbub, tumult, fracas, clangour, crash, clatter, clashshouting, yelling, screaming, caterwauling, babble, babbling, clamour, outcrybrouhaha, fuss, disturbance, adopandemonium, bedlam, chaos, confusionScottish &amp;amp Northern English stramashinformal hullabaloo, rumpus, ructionBritish informal rowrare vociferation, ululation, charivariverbdinned, dins, dinning dɪndɪn1din something intowith object Make (someone) learn or remember an idea by constant repetitio", "n. a runner-up, he dinned into them, was a loser Example sentencesExamples The arguments for genetically modified organisms that have been dinned into us for 15 years are based on an almost sublime misreading of the world's food problems. We, meanwhile, struggle to din some culture into our own young people whose aspirations have been hijacked by the consumerism of big corporations. It is dinned into him that the wife must always be subordinate to the husband. Day after day he had to din it into her that persistent work, and not ability alone, was essential for success. It was dinned into us that wasting water was sinful. With the memory of all the talk against the man that had been dinned into her ears, I looked at her narrowly. A local teacher dinned into us some other principles of the game. I have noticed that a high proportion of men do not trouble to wash their hands after using public toilets - possibly partly due to hand-washing not having been dinned into them during childhood and partly due to a macho outlook. Neither does the narrative din it into the viewer. Only when the message that Labour isn't all that clever, after all, is dinned into the voters can National risk changing the subject to its own intentions. So far, they have not been dinned into us in pubs but the time is nigh. None of us even thought of looking strangely at him, dinning third-year Circuit Theory into our heads. I would not even ask him for charity, or have it dinned into his ears that it is his duty to help the poor. I'm beginning to see that I'm really a clever woman in my own line, and not the ‘uneducated’ woman that I've had dinned into me. Synonymsinstil, drive, drum, hammer, drill, implant, ingrain, inculcateteach over and over again, indoctrinate, brainwash2no object Make a loud, unpleasant, and prolonged noise. the sound dinned irritatingly into Marian's head Example sentencesExamples He opened the door and the noise dinned into the office. An amplified quacking noise dinned from the speakers, and the image of an imprinting experiment, with a duckling following a moving wooden decoy around in circles appeared on the scree", "n. Synonymsblare, blast, clang, clatter, crash, clamourOriginOld English dyne, dynn (noun), dynian (verb), of Germanic origin; related to Old High German tuni (noun) and Old Norse dynr (noun), dynja 'come rumbling down'.Rhymesagin, akin, begin, Berlin, bin, Boleyn, Bryn, chin, chin-chin, Corinne, fin, Finn, Flynn, gaijin, Glyn, grin, Gwyn, herein, Ho Chi Minh, in, inn, Jin, jinn, kin, Kweilin, linn, Lynn, mandolin, mandoline, Min, no-win, pin, Pinyin, quin, shin, sin, skin, spin, therein, thin, Tientsin, tin, Tonkin, Turin, twin, underpin, Vietminh, violin, wherein, whin, whipper-in, win, within, Wynne, yin DIN2nounPlural dins, Plural DINs dɪndɪnAny of a series of technical standards originating in Germany and used internationally, especially to designate electrical connections, film speeds, and paper sizes.as modifier a DIN socketOriginEarly 20th century: acronym from Deutsche Industrie-Norm 'German Industrial Standard' (as laid down by the Deutsches Institut für Normung 'German Institute for Standards').nou", "n.1 nou", "n.2din1 noundɪndinA loud, unpleasant, and prolonged noise. the fans made an awful din Example sentencesExamples The people were inside and the radio was turned up loud to drown out the din of the men yelling and laughing as they drank coffee and beer. The merry din of talk, laughter, music, and clattering dinnerware spills outside. If you listen closely enough, you should be able to make out the angry words above the din: a cacophony of female voices raised to the rafters with one common message for their menfolk. ‘Go away, I'm busy’ he yelled above the din of the sewing machine. The next moment his loud shout rose over the din of battle, and swinging his hat over his head for a banner to those who pressed after, he spurred against the flying enemy. Animals added their noises to the din, poultry screeching and draft animals lowing as they were displayed and examined. I just didn't want to add my voice to the din of noise that has filled the public square regarding this tragic woman's fate. It has something to do with the book reviewing climate and the endless din buzzing around readers and publishers alike. People shout to be heard over the din, loud mufflerless trucks rumble by on the street, dogs bark, a mysterious polytonal chittering in the background sounds like a great horde of rats. Every England fan had a whooping, whistling counterpart so we shouted louder until the din was indescribable. In an instant, it was clear that the ward was an intolerably noisy place, flooded with a near-continuous din of screams, laughter, and loud vocalizations. I would have liked to converse with her a little further about the food sources, but the ear-deafening din meant that barking our orders to her was about all we could do. The plant is noisy, and she and her co-workers pass the time by shouting over the din, catching up on gossip and talking about food and cosmetics. While attending the lectures, the din of clashes outside the campus was audible. ‘Hello darling,’ said Lewis on the other end above a loud din in the background. Finding it difficult to handle them at home, many owners go in search of kennels where they are safely housed from the din and noise. A couple of days of silence make the din seem so much louder. In the background I read that towards the end of its life as a chapel in the convict period, free settlers got very cross with the fact that the convicts were making an awful din from under their pews. ‘I want to come back when it's a bit quieter,’ I shouted over the din of amplified music, throbbing diesel generators and rattling joy rides. Although its cries were becoming increasingly desperate as the din of barking and shouting intensified, the thought of trying to help never entered my mind. Synonymsuproar, racket, loud noise, confused noise, commotion, cacophony, babel, hubbub, tumult, fracas, clangour, crash, clatter, clashverbdɪndin1din something intowith object Make (someone) learn or remember something by constant repetitio", "n. the doctrine that has been dinned into all our heads Example sentencesExamples Day after day he had to din it into her that persistent work, and not ability alone, was essential for success. I would not even ask him for charity, or have it dinned into his ears that it is his duty to help the poor. Only when the message that Labour isn't all that clever, after all, is dinned into the voters can National risk changing the subject to its own intentions. So far, they have not been dinned into us in pubs but the time is nigh. I have noticed that a high proportion of men do not trouble to wash their hands after using public toilets - possibly partly due to hand-washing not having been dinned into them during childhood and partly due to a macho outlook. Neither does the narrative din it into the viewer. I'm beginning to see that I'm really a clever woman in my own line, and not the ‘uneducated’ woman that I've had dinned into me. None of us even thought of looking strangely at him, dinning third-year Circuit Theory into our heads. It is dinned into him that the wife must always be subordinate to the husband. A local teacher dinned into us some other principles of the game. The arguments for genetically modified organisms that have been dinned into us for 15 years are based on an almost sublime misreading of the world's food problems. With the memory of all the talk against the man that had been dinned into her ears, I looked at her narrowly. We, meanwhile, struggle to din some culture into our own young people whose aspirations have been hijacked by the consumerism of big corporations. It was dinned into us that wasting water was sinful. Synonymsinstil, drive, drum, hammer, drill, implant, ingrain, inculcate2no object Make a loud, unpleasant, and prolonged noise. the sound dinning in my ears was the telephone ringing Example sentencesExamples An amplified quacking noise dinned from the speakers, and the image of an imprinting experiment, with a duckling following a moving wooden decoy around in circles appeared on the scree", "n. He opened the door and the noise dinned into the office. Synonymsblare, blast, clang, clatter, crash, clamourOriginOld English dyne, dynn (noun), dynian (verb), of Germanic origin; related to Old High German tuni (noun) and Old Norse dynr (noun), dynja ‘come rumbling down’. DIN2noundindɪnAny of a series of technical standards originating in Germany and used internationally, especially to designate electrical connections, film speeds, and paper sizes.as modifier a DIN socketOriginEarly 20th century: acronym from Deutsche Industrie-Norm ‘German Industrial Standard’ (as laid down by the Deutsches Institut für Normung ‘German Institute for Standards’).nou", "n.1 nou", "n.2"]}], "usphone": "", "ukphone": ""}