{"name": "eat out", "trans": [{"dict": "Oxford5000", "values": ["eat outSee eat1eat1 verbeaten, ate iːt[with object]1Put (food) into the mouth and chew and swallow it. he was eating a hot dog eat up all your peasno object she watched her son as he ate Example sentencesExamples The nurses brought him food, but he had refused to eat it because it included cheese. When eating solid food, patients may have difficulty chewing and initiating swallows. In nature we see animals eating their prey alive. The tradition includes eating corned beef and cabbage and drinking it up at the local pub. I forgot to wipe my mouth after eating the chocolate cake my mom baked. In Africa, the fruits are eaten raw, or cooked in a soup, or fried in oil. They even had the gall to chew open the fishfood container and eat the food! The early humans butchered the elephant at the kill site and ate the meat raw, the archaeologists add. He ", "also talks about how his wife was accused of shoplifting in a major supermarket when her young son was spotted eating a grape from the trolley before the bag had been weighed. Other people watched the dancing, talked, bought stuff and ate food. Now, it is considered more refined to eat with a spoon and fork. She quickly ate the burger and swallowed some of the fries whole. With each bite, I regained strength, and I backed to the trunk of a tree to finish eating my food. He had finished eating the cookies, but the pack remained in his hand. I think over the five days we were there, our son ate five cheese steak sandwiches. Mary smiled at him before eating her cereal, chewing happily. At all times, foods must be eaten slowly, chewed thoroughly or puréed, and consumed in small portions. Finally I finish eating my Chinese food and stood up from the table. Remember, in the wild, dogs eat fresh meat they have killed themselves. I finished eating my cereal and put it in the sink when I heard Kay coming down the stairs. Synonymsconsume, devour, ingest, partake of, gobble (up/down), gulp (down), bolt (down), wolf (down), cram down, finish (off)swallow, chew, munch, chomp, champinformal guzzle, nosh, put away, pack away, tuck into, tuck away, scoff (down), demolish, dispose of, make short work of, polish off, shovel down, get stuck into, stuff one's face with, stuff down, pig out on, sink, get outside of, get one's laughing gear roundBritish informal gollop, shiftNorth American informal scarf (down/up), snarf (down/up), inhalerare ingurgitate1.1 Have (a meal) we ate dinner in a noisy cafe Example sentencesExamples I am only slightly ashamed to announce that I have taken to eating my meals at home at my desk while using my computer. Furthermore, employees made use of the courtyard for their lunch breaks, eating their meals and enjoying the view of a fountai", "n. Students who have eaten in the village cafeterias quickly learn to appreciate off-campus food. I shrugged nonchalantly and our breakfast was eaten in silence. But when it's snowing outside and you're eating the last meal of the year, a treat like this is deserved. Then we ate at a small restaurant on a side street with no tourists. Vince usually didn't eat lunch or dinner at the same time that she did, which didn't really bother her. We ate breakfast lunch and dinner with our many relatives, all of whom were delighted to see my mother. Michelle didn't tell Shane, but she hated eating in the cramped cafeteria. By eating a meal with them, Jesus associated himself with them. There's a special security team that has been coordinated that will watch his every move, even when he eats his last meal. People are so addicted that they eat lunch and dinner in front of the monitor. There's lots more to choose from if you can't make it by on a Saturday, or you want to eat lunch or dinner. We would find little use for most of this as we mainly ate breakfast and evening meals at restaurants and the guiding service supplied packed lunches every midday. She was grinning wickedly at the three, and they bit their lips simultaneously with regret for not eating that morning's meal. Then we sat on the water pipes which ran wide and warm along the wall outside the dinner hall and ate our lunch. She ate breakfast and dinner at the Amish Door Restaurant every day. We sat at the dinner table later, eating the meal that Jane had prepared. Meals are eaten with a large spoon or chop sticks. There were several questions and quick answers, but most of the meal was eaten in silence. Synonymshave a meal, partake of food, take food, consume food, feedbreakfast, lunch, dine, have breakfast, have lunch, have dinner, have supperfeast, banquetinformal snack, graze, noshdated sup, break bread1.2eat outno object Have a meal in a restaurant. there were plenty of places to eat out in the city centre Example sentencesExamples In the kitchen, Kathy began cooking meals instead of eating out so she could keep an eye on calories, fat grams and portion sizes. They want to take in some live music in local pubs and eat out in local restaurants. Waterhouse explains that since we eat out so often, restaurant meals are no longer the special treat they once were. Even when I was playing, I enjoyed going to fine restaurants and eating out. No meals are provided but eating out in this area is not all that expensive with a typical evening meal costing £10. Anyway, Parisians and New Yorkers eat out nearly every meal and are grateful for the comfort and blessed relative calm of a home-cooked meal. Others thought the solution to changing food choices was to have someone else prepare all the food for them or to eat out in restaurants. Combine this with take-away meals or eating out and you have the perfect recipe for a chore-free week. It's great to stay in the best hotels, eat out in the best restaurants in Scotland and find new places, but it's hard work. Getting paid to eat out at expensive restaurants is a tough job but someone has to do it. If eating out in a restaurant have a low calorie starter or dessert. Eating at Glastonbury isn't, of course, like eating out in stylish restaurants. ‘We ate out at restaurants or I cooked huge, high-fat meals every night,’ she recalls. When you do eat out, choose a restaurant that offers a healthy menu and head off hunger pangs with a small snack (like a few nuts or a piece of fruit) before you arrive. Today was mundane at work; however I ended up eating out for two meals out of three. Those of us who eat out enjoy marvelous restaurants. I would be happy walking by the river, or sitting at home snuggled on the couch - Scarlet always wanted to go places, see shows, eat out at posh restaurants. My other big money weakness is eating out in restaurants with my mates. Most of us buy more low fat foods and since many of us still want to eat out, restaurants are increasing their ‘healthy’ selections. At present we don't have a fridge, so have been eating out at different restaurants every night, which is nice, but makes me feel like I'm on holiday.1.3eat inno object Have a meal at home rather than in a restaurant. Example sentencesExamples The accommodation is self-catering, so eating in is the way forward. We can do what ordinary Venetians do: eat in or out, invite friends, and not feel forced to sit on cafe terraces to fill in time between meals. The café sells a variety of food including kebabs and baltis and customers can either eat in or take meals away.1.4US vulgar slangPerform fellatio or cunnilingus on (someone).noun iːteatsinformal Light food or snacks. these make great party eats Example sentencesExamples He introduced me to the streets around the hotel and importantly the cheap eats. Make a mental note of the cheap eats along this stretch of road. Open for three months now, it's a place for light vegetarian eats. All this variety is organized into chapters like late-night eats, takeouts, breakfast joints and an array of ethnic sections. Tracy and Lu are the perfect traveling companions… not only do they know where the best eats in town are; they are up at the crack of dawn, ready to explore the city with gusto. Nice crowd for brunch at the Union Cafe - we opted for cheaper eats at the Oriental fast food place in the food court. Tickets cost 10 and include drinks and light eats. An added attraction is a food court offering quick eats representing the best of the East and the West. Some members of the corps could be at the venue for anything up to four hours, and with no other outlet for eats or drinks at that level. Divided into sections that cover small eats, drinks, soups, rice dishes, side dishes and sweets, the recipes are clear and concise. Refuel with good Slovenian eats like sausages and pastas, and spend your nights in family-run pensions and a medieval castle. Hola's ", "also got a nice short menu of tropical and tropical-inspired light eats, perfect breakfast and lunch fare. Yes, that's right, the tables are turned in Germany and the person who is one year older is required to put up eats and drinks for her or his workmates. So making healthy eats more easily available is ", "also important. Synonymsnourishment, sustenance, nutriment, subsistence, fare, bread, daily breadfood, sustenance, nourishment, nutriment, farePhraseseat someone alive1informal (of insects) bite someone many times. we were eaten alive by mosquitoes Example sentencesExamples I was sitting lazily in a lawn chair by the river down the hill from my aunt's house and the mosquitoes were eating me alive. I tell him I am a bit worried about mosquitoes after they nearly ate me alive last time I came here in the summer. How can I drop a hint to the others that the mosquitoes are eating me alive when they, even the women, are all far more covered than I am? At night, crammed as many as 14 to a room, they say the mosquitoes eat them alive. I finally had to quit because the flies were eating me alive. Last time, in June we were eaten alive by a particularly nasty species of biting fly that drew blood. PPS - Population of my room - me, one cockroach, one gecko and one pesky mozzie that is eating me alive. It's a wonder he wasn't eaten alive by the midges! He was tempted to take off his shirt, but knew that the wicked little insects would eat him alive. When I started this, Patty wrote us and said bugs were eating them alive and they had no bathroom facilities except for putting two pieces of wood over a cardboard box and that's what they used as a toilet.1.1Exploit someone's weakness and completely dominate them. the defence lawyers would eat him alive on a written comment like that Example sentencesExamples And he said, ‘We would have handled it the same way, but Republicans in Congress, especially, would have been eating us alive for doing that.’ I couldn't show any sign of weakness or they'd eat me alive. I just looked out on the prison compound from the solitary room, and I could tell, I couldn't run with these people at all, they'd eat me alive. If he doesn't change his tune the Democrats will eat him alive on this one. The Democrats are eating them alive for being go at it alone cowboys and here we go proving their point. I think there are times when he needs to retreat from media attention - because the same media that will give you exposure is the same media that will eat you alive later o", "n. ‘If a pro-war Labour MP came to our group he would be eaten alive, because we know who said what to whom and when, better than he does,’ said one member. Bargain hunters aren't a completely ruthless bunch, but if you look mean, they will eat you alive. Most felt Christie would be eaten alive by some of the bigger, more robust full-forwards. Up front Laois were eaten alive by a ravenous Westmeath defense.eat one's heart out1Suffer from excessive longing for someone or something unattainable. I could have stayed in London eating my heart out for you Example sentencesExamples He quickly shut his mouth before opening it again to speak, ‘Can I say that you look absolutely drop-dead gorgeous and that there's not a single guy there tonight who won't be eating his heart out?’ Choreography like that would have had Diaghilev eating his heart out. How long will you eat your heart out here in tears and torment? Jamie is eating his heart out for Amanda, the fashion-model wife who ditched him, and whom he still keeps pursuing until he warms to a blind date, Vicky, a philosophy student with whom he may start afresh. I've been eating my heart out for the last three weeks because he lost the San Diego. And now that I have my man back, she can eat her heart out. Let him eat his heart out for what he'd rejected. I made sure I looked amazing (he dumped me and broke my heart) so he should eat his heart out. Since he left, she's been sitting at home eating her heart out. Along comes Martha as a Texas heiress affianced to a prince but eating her heart out over a bus-driver back home. Synonymspine, long, ache, brood, mope, fret, sigh, sorrow, suffer, bleed, yearn, agonize, weep and wail, regret someone's absence, regret someone's loss1.1informal in imperativeUsed to indicate that one thinks someone will feel great jealousy or regret. eat your heart out, those who missed the trip Example sentencesExamples But April raised her arms high before her - Superman, eat your heart out, she thought - and flew - flew! Tiger eat your heart out at this display of totally average golf. Bridget Jones eat your heart out, Tracy has a diary that would make many grown men weep, not least because it involves a wedding in November. There are ", "also a few anthemic numbers thrown in for good measure, such as ‘Lullaby’ and ‘Good Woman’ (Destiny's Child eat your heart out!). There is a surprise victor at Wimbledon, Maria Sharapova, who as well as taking the plate ", "also wowed the crowds - Anna Kournikova eat your heart out. Well, Hugh, we may have been snubbed by the Patriot, but eat your heart out: we're in the New York Post's gossip column, Page Six. Performing home-grown songs laced with a healthy mix of rock standards - including a simply sublime version of Pink Cadillac - eat your heart out, Springsteen - this band set the stage alight. ‘Sherlock Homes, eat your heart out,’ he muttered, then made his way to the opening in the wall. The PM's car has a steel plate underside, panic buttons, an exploding windscreen, loudspeakers and even gun ports: 007, eat your heart out. Mary Shelley eat your heart out, here we have a fear of giving birth to monsters in all its glory.eat like a birdinformal Eat very little. Example sentencesExamples I'm a rather big girl, which means I don't exactly eat like a bird. She's been here for three months and she's fine… she eats like a horse… and she loves me. I can't stress enough that you don't have to starve yourself or eat like a bird to build a great body. Despite eating like a horse recently my weight has continued to plummet. Children wont starve themselves, and after a few days my daughter was eating like a horse. Originally, she had dieted all the way down to 137 pounds - without doing any exercise - but she found she had to eat like a bird to keep herself at that weight. Of course, let's not jump to any distorted conclusion about Sarah's chowing patterns; I imagine Freddie probably eats like a bird, don't you think? Jack is a great footballer and he eats like a horse. Sometimes you can't get him to eat a thing, and then at other times he eats like a horse! He wasn't into real sports, but was on the cross country and track teams, which pretty much explained why he was as skinny as stringed beans, even though he ate like a horse.eat like a horseinformal Eat a great deal.eat someone out of house and homeinformal Eat a lot of someone else's food. he would eat them out of house and home if he continued to run through biscuits at his present rate Example sentencesExamples This will help solve the problem of what to eat for lunch but will protect the employer from having workers eat him out of house and home, since the charge for food will both reduce consumption and ", "also provide income. ‘I ate them out of house and home so it's probably his wife's decision,’ he said. I followed closely, knowing that Mike might eat us out of house and home. She sits around complaining that we have no money and, to be perfectly honest, is eating me out of house and home. I bet you anything we'll eat you out of house and home. When I came home, Kyle and some of his friends I really didn't like were in the kitchen, eating us out of house and home as usual. They ate us out of house and home, we have no hamburgers left and we ran out of cheese and onion rolls, but we're famous for that. Some people say rude guests eat you out of house and home, but they never mention the hijacking of candles. Now then, is eating me out of house and home all that more entertaining than actually talking to me? Then there comes a time when the children grow into teenagers and you think that will eat you out of house and home, but there is light of the end of the tunnel!eat one's wordsRetract what one has said, especially in a humiliated way. they will eat their words when I win Example sentencesExamples The Indian captain ", "also came down heavily on the critics and said that all those who said that Team India was a myth would now be made to eat their words. We are content to prove our mettle gradually in our own way - so that biased persons eat their words when we emerge victorious. But the male regulars at the Met bar in Sale may have to eat their words after coming face to face with woman wielding the fastest cue in Britai", "n. I'm glad to report that they have been made to eat their words. You can eat your words now because they have defied you and all of the doubting media army. However, after he released all three hours of the director's cut, critics were forced to eat their words. Those who accused him of being a dogmatic socialist have been forced to eat their words. Those who talk tough are soon forced to eat their words. And now, you know, they saw it, and now they can eat their words. Her burning desire for achievement will ultimately lead her to success in the men's game and her current critics are going to eat their words.have someone eating out of one's handHave someone completely under one's control. the guys have the crowd eating out of their hand right away with a few jokes Example sentencesExamples Laidlaw had Jack eating out of his hand, especially when he offered him a wee trip round the Cote d' Azur in his yacht. Turning her charm switch on, Tracy had had him eating out of her hand in a week. Toni nodded her approval, ‘If you don't have Jamie eating out of your hand, believe me, you'll have every other guy there instead!’ He has everyone's respect because of his charisma and the young guys on the training pitch - he has us eating out of his hand. You won't be so reluctant to admit it when I have him eating out of your hand. Candlelight dinners will have me eating out of your hand. Paul laughed at the memory of Jason bragging about how he'd have Kirby eating out of his hand and begging to be forgive", "n. Synonymsbe in charge of, run, be in control of, manage, direct, administer, head, preside over, have authority over, supervise, superintend, oversee, guide, steerI'll eat my hatinformal Used to indicate that one thinks that something is extremely unlikely to happe", "n. if he comes back, I'll eat my hat Example sentencesExamples And if that doesn't spark some debate, I'll eat my hat. It's so secret I haven't a clue where or when it is but I'll tell you this: if I don't get there, I'll eat my hat. But if you like the samples, you'll love the original stuff, or I'll eat my hat. If London is still standing in the year 2020, I'll eat my hat. If places like Scarborough and Doncaster don't benefit from that I'll eat my hat. If computers come with CD drives 50 years from now, I'll eat my hat. If there's a child anywhere that'll like this I'll eat my hat. If you do all that, and still don't get an A, I'll eat my hat. If they can do it without relying on underlying axioms of homophobia and bigotry, then I'll eat my hat. If he's not snapped up by Hollywood I'll eat my hat.what's eating you (or him or her)?informal What is worrying or annoying you (or him or her)? OK, Mr Linley, what's eating you? Example sentencesExamples So the Almighty asked Adam: ‘So, what's eating you?’ ‘What's eating him?’ Faye asked. Seriously girl, what's eating you?Phrasal Verbseat something awayErode or destroy something gradually. the acid began to eat away at the edge of her tunic figurative the knowledge of his affair still ate away at her Example sentencesExamples In that time literally millions of bombs have rained down on the soft Holderness earth - and now they are all being exposed as the cliffs are eaten away by the sea. ‘I learned a long time ago that you can't let a big loss eat away at you,’ the coach said. It seems everywhere that two apples rub up against each other, the skin has been eaten away by a worm. He swallowed hard, preparing to admit something that had bothered him for the past seven years, eating away at his insides. The timbers have been eaten away by what Mr Fox calls ‘radioactive seepage’. The front porch had collapsed at one end where the supports had been eaten away by the fire and what looked like a bundle of rags had been wrapped around a post flanking the steps. Going into the room he expected to step on carpet but found that the carpet had been eaten away and in places there were only the bare floorboards underneath. The stone blocks had been eaten away by time and now were only a shadow of their former glory. He wants to eat away at some of the more annoying kinds of brakes that can be applied to a measure along its legislative journey. If I don't make the initial effort, nobody bothers with me and that sucks and it's eating away at me. Synonymserode, corrode, abrade, wear away, wear away at, wear down, wear through, gnaw away, gnaw away at, bite into, burn into, burn through, consume, dissolve, disintegrate, crumble, waste away, rot, decayeat into1Erode or destroy something gradually. these liquids can discolour the surface or even eat into the top layer of concrete Example sentencesExamples But it is still uncertain how much of the bigger tab companies will be able to pass through to consumers, and how sharply the costs will eat into profit margins. Lending will expand at a faster rate because the lower interest rates are eating into banks' revenues from government bonds. Of course, charges and inflation are both eating into the profit. That cuts to the heart of Hollywood's distribution system and eats into studio profits, even as it simultaneously creates new revenue opportunities. But to suspend the wires above the ceiling would cost £10,000 per bed, a cost which would eat into already stretched resources. Oil has jumped nearly 60 percent so far this year, stoking concerns that higher energy costs will eat into corporate profits and curb consumer spending. Bankers have previously warned that raising the reserve requirement would eat into bank profit margins and raise the cost of funds and hence increase the interest rate charged to borrowers. The fear was that higher interest rates will eat into corporate earnings, slash investment spending and lead to job losses. Transaction costs on small trades can eat into your profits. Much more hope was placed in diminishing the burdens on production which ate into profits.1.1Use up (profits, resources, or time) sales were hard hit by high interest rates eating into disposable income Example sentencesExamples Lending will expand at a faster rate because the lower interest rates are eating into banks' revenues from government bonds. The fear was that higher interest rates will eat into corporate earnings, slash investment spending and lead to job losses. But it is still uncertain how much of the bigger tab companies will be able to pass through to consumers, and how sharply the costs will eat into profit margins. That cuts to the heart of Hollywood's distribution system and eats into studio profits, even as it simultaneously creates new revenue opportunities. Of course, charges and inflation are both eating into the profit. Bankers have previously warned that raising the reserve requirement would eat into bank profit margins and raise the cost of funds and hence increase the interest rate charged to borrowers. But to suspend the wires above the ceiling would cost £10,000 per bed, a cost which would eat into already stretched resources. Oil has jumped nearly 60 percent so far this year, stoking concerns that higher energy costs will eat into corporate profits and curb consumer spending. Much more hope was placed in diminishing the burdens on production which ate into profits. Transaction costs on small trades can eat into your profits.eat someone upDominate the thoughts of someone completely. I'm eaten up with guilt Example sentencesExamples You want to be there the whole time, it just eats you up inside when you're not there. It's important that when you're not working you live a life, because it can eat you up inside and you just do job after job after job. I've been sober for ten years, had small children and know the guilt and how that can eat you up so hang in there. The guilt continued to grow and eat me up inside for all the innocent beings I had been part of killing for so long. That's not something I'm proud of, not something I'd not dearly love to change someday, not something that doesn't quietly eat me up. ‘If you take it too seriously it's going to eat you up,’ the Brisbane swimmer said. That would be too much of a luxury, besides, guilt would eat me up. Yet, finally her inner loneliness is eating her up, the feeling that she belongs nowhere, an outcast among the outcastes. I didn't want hate to eat me up - I didn't want to become a man-basher or hate a whole religion because of one monk. If I go through the rest of my life hating the people who killed my son and letting that eat me up and destroy me, that will happen to my children too. Synonymsabsorb, preoccupy, engrosseat something up1Use resources or time in very large quantities. an operating system that eats up 200Mb of disk space Example sentencesExamples The administrative resources of voluntary organizations are eaten up by site visits from auditors, sometimes different teams from the same department who have no knowledge of the other's visit. You're saying that anti-war voices can't get on cable TV, because so much air time is eaten up by administration officials? Bad inheritance planning can mean your legacy is eaten up by probate taxes, solicitor's fees and charges. But we moved in a budget year where we hadn't planned to move, so there were problems with the cost of moving and renovations, and any surplus was eaten up by the old space. Smith said much of his small budget is eaten up with weed control on the 140 hectares of wild space. I had intended to do some work on the book, sort out my buildings insurance and washing machine repair cover, but somehow the day has been eaten up with other things. All of the city's loose change for the next three years will be eaten up by the police. Also, because of the requirements of the shelters, a good portion of each day is eaten up when getting processed. The problem is that he fears his profits will be eaten up by the taxman unless his spending increases with his earning. Advance purchase is advised - otherwise, your savings will be eaten up.1.1Encroach on something. villagers fear that the countryside will be eaten up by concrete Example sentencesExamples In 1699, he asked Louvois to compensate a poor man with eight children whose land had been eaten up by the citadel of Pinerolo. He whispered it again - war is coming - and then slipped off like a shadow does when darkness eats it up. Now so much of it is eaten up by concrete, and the rest has become a slum. With more and more ground being eaten up by multi-storey buildings, green space is fast sinking in the city. Nearly all the reclaimed land made available by the construction of the Aswan Dam has been eaten up by insatiable urban sprawl. With many of the old roadside spaces eaten up by development, there was a move towards the towns.OriginOld English etan, of Germanic origin; related to Dutch eten and German essen, from an Indo-European root shared by Latin edere and Greek edei", "n.For such a fundamental concept, it is unsurprising that eat is an Old English word, with an ancient root shared by Latin edere ‘to eat’. This is the source not only of edible (late 16th century), but ", "also comestible (Late Middle English) ‘something edible’, edacious (early 19th century), a rare word for ‘greedy’, and obese (mid 17th century) from obedere ‘eat completely’. There are many phrases associated with eating. Eat, drink, and be merry, for tomorrow we die is a combination of two Biblical sayings, ‘A man hath no better thing under the sun, than to eat and to drink, and to be merry’ (Ecclesiastes) and ‘Let us eat and drink; for tomorrow we shall die’ (Isaiah). You are what you eat is a proverb that first appeared in English in the 1920s. It is a translation of the German phrase Der Mensch ist, was er isst, ‘Man is what he eats’, which was said by the philosopher Ludwig Feuerbach (1804–72). If you eat your heart out you suffer from excessive longing or grief. As eat your own heart the phrase was first used in Edmund Spenser's The Faerie Queene (1596): ‘He could not rest; but did his stout heart eat.’ See ", "also fretRhymesaccrete, autocomplete, beet, bittersweet, bleat, cheat, cleat, clubfeet, compete, compleat, complete, conceit, Crete, deceit, delete, deplete, discreet, discrete, effete, élite, entreat, escheat, estreat, excrete, feat, feet, fleet, gîte, greet, heat, leat, leet, Magritte, maltreat, marguerite, meat, meet, meet-and-greet, mesquite, mete, mistreat, neat, outcompete, peat, Pete, petite, pleat, receipt, replete, sangeet, seat, secrete, sheet, skeet, sleet, splay-feet, street, suite, sweet, teat, treat, tweet, wheat EAT2abbreviationTanzania (international vehicle registration).OriginFrom East Africa Tanzania (formerly Tanganyika).verb.1 phr. phr.", "v. abbr.1Definition of eat in US English: eat verbitēt[with object]1Put (food) into the mouth and chew and swallow it. he was eating a hot dog eat up all your peasno object she watched her son as he ate Example sentencesExamples Finally I finish eating my Chinese food and stood up from the table. He had finished eating the cookies, but the pack remained in his hand. The tradition includes eating corned beef and cabbage and drinking it up at the local pub. Mary smiled at him before eating her cereal, chewing happily. The early humans butchered the elephant at the kill site and ate the meat raw, the archaeologists add. I think over the five days we were there, our son ate five cheese steak sandwiches. He ", "also talks about how his wife was accused of shoplifting in a major supermarket when her young son was spotted eating a grape from the trolley before the bag had been weighed. The nurses brought him food, but he had refused to eat it because it included cheese. I finished eating my cereal and put it in the sink when I heard Kay coming down the stairs. They even had the gall to chew open the fishfood container and eat the food! In nature we see animals eating their prey alive. With each bite, I regained strength, and I backed to the trunk of a tree to finish eating my food. In Africa, the fruits are eaten raw, or cooked in a soup, or fried in oil. She quickly ate the burger and swallowed some of the fries whole. Other people watched the dancing, talked, bought stuff and ate food. At all times, foods must be eaten slowly, chewed thoroughly or puréed, and consumed in small portions. Remember, in the wild, dogs eat fresh meat they have killed themselves. Now, it is considered more refined to eat with a spoon and fork. I forgot to wipe my mouth after eating the chocolate cake my mom baked. When eating solid food, patients may have difficulty chewing and initiating swallows. Synonymsconsume, devour, ingest, partake of, gobble, gobble down, gobble up, gulp, gulp down, bolt, bolt down, wolf, wolf down, cram down, finish, finish offconsume, devour, ingest, partake of, gobble, gobble down, gobble up, gulp, gulp down, bolt, bolt down, wolf, wolf down, cram down, finish, finish off1.1 Have (a meal) we ate dinner in a noisy cafe Example sentencesExamples There's a special security team that has been coordinated that will watch his every move, even when he eats his last meal. Meals are eaten with a large spoon or chop sticks. There's lots more to choose from if you can't make it by on a Saturday, or you want to eat lunch or dinner. She ate breakfast and dinner at the Amish Door Restaurant every day. Vince usually didn't eat lunch or dinner at the same time that she did, which didn't really bother her. But when it's snowing outside and you're eating the last meal of the year, a treat like this is deserved. I shrugged nonchalantly and our breakfast was eaten in silence. Furthermore, employees made use of the courtyard for their lunch breaks, eating their meals and enjoying the view of a fountai", "n. Then we sat on the water pipes which ran wide and warm along the wall outside the dinner hall and ate our lunch. We would find little use for most of this as we mainly ate breakfast and evening meals at restaurants and the guiding service supplied packed lunches every midday. Students who have eaten in the village cafeterias quickly learn to appreciate off-campus food. We ate breakfast lunch and dinner with our many relatives, all of whom were delighted to see my mother. By eating a meal with them, Jesus associated himself with them. People are so addicted that they eat lunch and dinner in front of the monitor. Then we ate at a small restaurant on a side street with no tourists. Michelle didn't tell Shane, but she hated eating in the cramped cafeteria. She was grinning wickedly at the three, and they bit their lips simultaneously with regret for not eating that morning's meal. There were several questions and quick answers, but most of the meal was eaten in silence. We sat at the dinner table later, eating the meal that Jane had prepared. I am only slightly ashamed to announce that I have taken to eating my meals at home at my desk while using my computer. Synonymshave a meal, partake of food, take food, consume food, feed1.2eat outno object Have a meal in a restaurant. Example sentencesExamples If eating out in a restaurant have a low calorie starter or dessert. Others thought the solution to changing food choices was to have someone else prepare all the food for them or to eat out in restaurants. They want to take in some live music in local pubs and eat out in local restaurants. No meals are provided but eating out in this area is not all that expensive with a typical evening meal costing £10. Getting paid to eat out at expensive restaurants is a tough job but someone has to do it. In the kitchen, Kathy began cooking meals instead of eating out so she could keep an eye on calories, fat grams and portion sizes. Combine this with take-away meals or eating out and you have the perfect recipe for a chore-free week. Eating at Glastonbury isn't, of course, like eating out in stylish restaurants. Most of us buy more low fat foods and since many of us still want to eat out, restaurants are increasing their ‘healthy’ selections. I would be happy walking by the river, or sitting at home snuggled on the couch - Scarlet always wanted to go places, see shows, eat out at posh restaurants. Waterhouse explains that since we eat out so often, restaurant meals are no longer the special treat they once were. Those of us who eat out enjoy marvelous restaurants. My other big money weakness is eating out in restaurants with my mates. Anyway, Parisians and New Yorkers eat out nearly every meal and are grateful for the comfort and blessed relative calm of a home-cooked meal. Today was mundane at work; however I ended up eating out for two meals out of three. At present we don't have a fridge, so have been eating out at different restaurants every night, which is nice, but makes me feel like I'm on holiday. When you do eat out, choose a restaurant that offers a healthy menu and head off hunger pangs with a small snack (like a few nuts or a piece of fruit) before you arrive. It's great to stay in the best hotels, eat out in the best restaurants in Scotland and find new places, but it's hard work. Even when I was playing, I enjoyed going to fine restaurants and eating out. ‘We ate out at restaurants or I cooked huge, high-fat meals every night,’ she recalls.1.3eat inno object Have a meal at home rather than in a restaurant. Example sentencesExamples The café sells a variety of food including kebabs and baltis and customers can either eat in or take meals away. We can do what ordinary Venetians do: eat in or out, invite friends, and not feel forced to sit on cafe terraces to fill in time between meals. The accommodation is self-catering, so eating in is the way forward.1.4informalBother; annoy. she knew what was eating him Example sentencesExamples You feel so violated, that it eats you away slowly. What you need to do is get to the root of who you are and discover what's eating you. Whatever's eating him, he's losing his temper more and more, and the angrier he gets, the more incomprehensible he gets.1.5US vulgar slangPerform fellatio or cunnilingus on (someone).1.6eat outvulgar slangPerform cunnilingus or anilingus on (someone).1.7US informalAbsorb (financial loss or cost). Example sentencesExamples If we had to, we could probably eat the cost and still have a margi", "n. Damage one and you don't service it yourself, you send it back and eat the cost. Rather than eat the loss, he allegedly constructed an electronic shell game to offload the contracts on a innocent dupe. So those shareholders who invested for those last three weeks are just going to have to eat their losses? They agree that the first team screwed up; they'd eat the install cost if I paid for the multiplexer. If a hospital spent more than its allotted DRG, it now had to eat the cost. Most don't earn enough to pay it off, so the label eats that cost, making it up through earnings from hits. We would probably have to impose ourselves on Ethiopia and eat the added cost of flying around Egypt. So they're generally eating the currency loss caused by the greenback's decline. Cost savings are often hard to realize, and those that are usually get eaten by the merger costs. For health clubs with set membership fees, passage may force them to eat the cost. As it stands, it's the band that has to eat the costs by having CDs made which they're then giving away. Either the barber raises his prices, eats the higher costs, or lays off a worker, like the guy who sweeps up. Usually, the purchasers have to place the machines themselves or eat the cost. In other words, if you like that Q1 banner flying over your plant, you'll eat more cost. In any event, large companies are most likely to eat the costs of any potential licensing, say analysts. He borrowed against his boats to pay the claims, and Julian ate the other costs. I'm sure he had ripped off more than enough foreigners that day to eat his loss. Organic Teas, have decided to eat the cost of buying fair trade rather than raise prices. Sometimes you'll end up eating the cost of a job due to the ammunition expenses and amount of repair that is required to fix up your robot.nounitēteatsinformal Food or snacks. people would stop for soft drinks or eats Example sentencesExamples Nice crowd for brunch at the Union Cafe - we opted for cheaper eats at the Oriental fast food place in the food court. Yes, that's right, the tables are turned in Germany and the person who is one year older is required to put up eats and drinks for her or his workmates. Tracy and Lu are the perfect traveling companions… not only do they know where the best eats in town are; they are up at the crack of dawn, ready to explore the city with gusto. He introduced me to the streets around the hotel and importantly the cheap eats. So making healthy eats more easily available is ", "also important. Open for three months now, it's a place for light vegetarian eats. Hola's ", "also got a nice short menu of tropical and tropical-inspired light eats, perfect breakfast and lunch fare. Tickets cost 10 and include drinks and light eats. Refuel with good Slovenian eats like sausages and pastas, and spend your nights in family-run pensions and a medieval castle. All this variety is organized into chapters like late-night eats, takeouts, breakfast joints and an array of ethnic sections. Make a mental note of the cheap eats along this stretch of road. Some members of the corps could be at the venue for anything up to four hours, and with no other outlet for eats or drinks at that level. Divided into sections that cover small eats, drinks, soups, rice dishes, side dishes and sweets, the recipes are clear and concise. An added attraction is a food court offering quick eats representing the best of the East and the West. Synonymsnourishment, sustenance, nutriment, subsistence, fare, bread, daily breadfood, sustenance, nourishment, nutriment, farePhraseseat someone alive1informal (of insects) bite someone many times. we were eaten alive by mosquitoes Example sentencesExamples At night, crammed as many as 14 to a room, they say the mosquitoes eat them alive. It's a wonder he wasn't eaten alive by the midges! When I started this, Patty wrote us and said bugs were eating them alive and they had no bathroom facilities except for putting two pieces of wood over a cardboard box and that's what they used as a toilet. I finally had to quit because the flies were eating me alive. He was tempted to take off his shirt, but knew that the wicked little insects would eat him alive. How can I drop a hint to the others that the mosquitoes are eating me alive when they, even the women, are all far more covered than I am? PPS - Population of my room - me, one cockroach, one gecko and one pesky mozzie that is eating me alive. I tell him I am a bit worried about mosquitoes after they nearly ate me alive last time I came here in the summer. I was sitting lazily in a lawn chair by the river down the hill from my aunt's house and the mosquitoes were eating me alive. Last time, in June we were eaten alive by a particularly nasty species of biting fly that drew blood.1.1Exploit someone's weakness and completely dominate them. he expects manufacturers to be eaten alive by lawyers in liability suits Example sentencesExamples If he doesn't change his tune the Democrats will eat him alive on this one. Up front Laois were eaten alive by a ravenous Westmeath defense. Most felt Christie would be eaten alive by some of the bigger, more robust full-forwards. Bargain hunters aren't a completely ruthless bunch, but if you look mean, they will eat you alive. ‘If a pro-war Labour MP came to our group he would be eaten alive, because we know who said what to whom and when, better than he does,’ said one member. And he said, ‘We would have handled it the same way, but Republicans in Congress, especially, would have been eating us alive for doing that.’ I think there are times when he needs to retreat from media attention - because the same media that will give you exposure is the same media that will eat you alive later o", "n. I just looked out on the prison compound from the solitary room, and I could tell, I couldn't run with these people at all, they'd eat me alive. I couldn't show any sign of weakness or they'd eat me alive. The Democrats are eating them alive for being go at it alone cowboys and here we go proving their point.eat one's heart out1Suffer from excessive longing for someone or something unattainable. Example sentencesExamples Let him eat his heart out for what he'd rejected. I've been eating my heart out for the last three weeks because he lost the San Diego. Since he left, she's been sitting at home eating her heart out. Jamie is eating his heart out for Amanda, the fashion-model wife who ditched him, and whom he still keeps pursuing until he warms to a blind date, Vicky, a philosophy student with whom he may start afresh. I made sure I looked amazing (he dumped me and broke my heart) so he should eat his heart out. How long will you eat your heart out here in tears and torment? Along comes Martha as a Texas heiress affianced to a prince but eating her heart out over a bus-driver back home. He quickly shut his mouth before opening it again to speak, ‘Can I say that you look absolutely drop-dead gorgeous and that there's not a single guy there tonight who won't be eating his heart out?’ And now that I have my man back, she can eat her heart out. Choreography like that would have had Diaghilev eating his heart out. Synonymspine, long, ache, brood, mope, fret, sigh, sorrow, suffer, bleed, yearn, agonize, weep and wail, regret someone's absence, regret someone's loss1.1informal in imperativeUsed to encourage feelings of jealousy or regret. eat your heart out, I'm having a ball! Example sentencesExamples There are ", "also a few anthemic numbers thrown in for good measure, such as ‘Lullaby’ and ‘Good Woman’ (Destiny's Child eat your heart out!). Performing home-grown songs laced with a healthy mix of rock standards - including a simply sublime version of Pink Cadillac - eat your heart out, Springsteen - this band set the stage alight. The PM's car has a steel plate underside, panic buttons, an exploding windscreen, loudspeakers and even gun ports: 007, eat your heart out. Mary Shelley eat your heart out, here we have a fear of giving birth to monsters in all its glory. There is a surprise victor at Wimbledon, Maria Sharapova, who as well as taking the plate ", "also wowed the crowds - Anna Kournikova eat your heart out. Bridget Jones eat your heart out, Tracy has a diary that would make many grown men weep, not least because it involves a wedding in November. ‘Sherlock Homes, eat your heart out,’ he muttered, then made his way to the opening in the wall. Well, Hugh, we may have been snubbed by the Patriot, but eat your heart out: we're in the New York Post's gossip column, Page Six. But April raised her arms high before her - Superman, eat your heart out, she thought - and flew - flew! Tiger eat your heart out at this display of totally average golf.eat like a birdinformal Eat very little. Example sentencesExamples Of course, let's not jump to any distorted conclusion about Sarah's chowing patterns; I imagine Freddie probably eats like a bird, don't you think? I can't stress enough that you don't have to starve yourself or eat like a bird to build a great body. Despite eating like a horse recently my weight has continued to plummet. Children wont starve themselves, and after a few days my daughter was eating like a horse. He wasn't into real sports, but was on the cross country and track teams, which pretty much explained why he was as skinny as stringed beans, even though he ate like a horse. Sometimes you can't get him to eat a thing, and then at other times he eats like a horse! Jack is a great footballer and he eats like a horse. She's been here for three months and she's fine… she eats like a horse… and she loves me. I'm a rather big girl, which means I don't exactly eat like a bird. Originally, she had dieted all the way down to 137 pounds - without doing any exercise - but she found she had to eat like a bird to keep herself at that weight.eat like a horseinformal Eat a great deal.eat someone out of house and homeinformal Eat a lot of someone else's food. Example sentencesExamples When I came home, Kyle and some of his friends I really didn't like were in the kitchen, eating us out of house and home as usual. Some people say rude guests eat you out of house and home, but they never mention the hijacking of candles. Then there comes a time when the children grow into teenagers and you think that will eat you out of house and home, but there is light of the end of the tunnel! ‘I ate them out of house and home so it's probably his wife's decision,’ he said. Now then, is eating me out of house and home all that more entertaining than actually talking to me? They ate us out of house and home, we have no hamburgers left and we ran out of cheese and onion rolls, but we're famous for that. I bet you anything we'll eat you out of house and home. She sits around complaining that we have no money and, to be perfectly honest, is eating me out of house and home. I followed closely, knowing that Mike might eat us out of house and home. This will help solve the problem of what to eat for lunch but will protect the employer from having workers eat him out of house and home, since the charge for food will both reduce consumption and ", "also provide income.eat one's wordsRetract what one has said, especially in a humiliated way. they will eat their words when I win Example sentencesExamples I'm glad to report that they have been made to eat their words. Those who talk tough are soon forced to eat their words. Her burning desire for achievement will ultimately lead her to success in the men's game and her current critics are going to eat their words. We are content to prove our mettle gradually in our own way - so that biased persons eat their words when we emerge victorious. However, after he released all three hours of the director's cut, critics were forced to eat their words. And now, you know, they saw it, and now they can eat their words. But the male regulars at the Met bar in Sale may have to eat their words after coming face to face with woman wielding the fastest cue in Britai", "n. Those who accused him of being a dogmatic socialist have been forced to eat their words. The Indian captain ", "also came down heavily on the critics and said that all those who said that Team India was a myth would now be made to eat their words. You can eat your words now because they have defied you and all of the doubting media army.have someone eating out of one's handHave someone completely under one's control. Example sentencesExamples Paul laughed at the memory of Jason bragging about how he'd have Kirby eating out of his hand and begging to be forgive", "n. Turning her charm switch on, Tracy had had him eating out of her hand in a week. Laidlaw had Jack eating out of his hand, especially when he offered him a wee trip round the Cote d' Azur in his yacht. He has everyone's respect because of his charisma and the young guys on the training pitch - he has us eating out of his hand. You won't be so reluctant to admit it when I have him eating out of your hand. Candlelight dinners will have me eating out of your hand. Toni nodded her approval, ‘If you don't have Jamie eating out of your hand, believe me, you'll have every other guy there instead!’ Synonymsbe in charge of, run, be in control of, manage, direct, administer, head, preside over, have authority over, supervise, superintend, oversee, guide, steerI'll eat my hatinformal Used to indicate that one thinks the specified thing is extremely unlikely to happe", "n. if he comes back, I'll eat my hat Example sentencesExamples It's so secret I haven't a clue where or when it is but I'll tell you this: if I don't get there, I'll eat my hat. But if you like the samples, you'll love the original stuff, or I'll eat my hat. If he's not snapped up by Hollywood I'll eat my hat. If computers come with CD drives 50 years from now, I'll eat my hat. If there's a child anywhere that'll like this I'll eat my hat. If you do all that, and still don't get an A, I'll eat my hat. If London is still standing in the year 2020, I'll eat my hat. If they can do it without relying on underlying axioms of homophobia and bigotry, then I'll eat my hat. If places like Scarborough and Doncaster don't benefit from that I'll eat my hat. And if that doesn't spark some debate, I'll eat my hat.Phrasal Verbseat intoErode or destroy something gradually. these liquids can discolor the surface or even eat into the top layer of concrete Example sentencesExamples The fear was that higher interest rates will eat into corporate earnings, slash investment spending and lead to job losses. But it is still uncertain how much of the bigger tab companies will be able to pass through to consumers, and how sharply the costs will eat into profit margins. Much more hope was placed in diminishing the burdens on production which ate into profits. Of course, charges and inflation are both eating into the profit. Bankers have previously warned that raising the reserve requirement would eat into bank profit margins and raise the cost of funds and hence increase the interest rate charged to borrowers. Lending will expand at a faster rate because the lower interest rates are eating into banks' revenues from government bonds. That cuts to the heart of Hollywood's distribution system and eats into studio profits, even as it simultaneously creates new revenue opportunities. Oil has jumped nearly 60 percent so far this year, stoking concerns that higher energy costs will eat into corporate profits and curb consumer spending. But to suspend the wires above the ceiling would cost £10,000 per bed, a cost which would eat into already stretched resources. Transaction costs on small trades can eat into your profits.eat someone upDominate the thoughts of someone completely. I'm eaten up with guilt Example sentencesExamples You want to be there the whole time, it just eats you up inside when you're not there. That would be too much of a luxury, besides, guilt would eat me up. That's not something I'm proud of, not something I'd not dearly love to change someday, not something that doesn't quietly eat me up. I've been sober for ten years, had small children and know the guilt and how that can eat you up so hang in there. The guilt continued to grow and eat me up inside for all the innocent beings I had been part of killing for so long. Yet, finally her inner loneliness is eating her up, the feeling that she belongs nowhere, an outcast among the outcastes. It's important that when you're not working you live a life, because it can eat you up inside and you just do job after job after job. If I go through the rest of my life hating the people who killed my son and letting that eat me up and destroy me, that will happen to my children too. ‘If you take it too seriously it's going to eat you up,’ the Brisbane swimmer said. I didn't want hate to eat me up - I didn't want to become a man-basher or hate a whole religion because of one monk. Synonymsabsorb, preoccupy, engrosseat something up1Use resources or time in very large quantities. an operating system that eats up 200Mb of disk space Example sentencesExamples All of the city's loose change for the next three years will be eaten up by the police. The problem is that he fears his profits will be eaten up by the taxman unless his spending increases with his earning. Advance purchase is advised - otherwise, your savings will be eaten up. The administrative resources of voluntary organizations are eaten up by site visits from auditors, sometimes different teams from the same department who have no knowledge of the other's visit. Also, because of the requirements of the shelters, a good portion of each day is eaten up when getting processed. But we moved in a budget year where we hadn't planned to move, so there were problems with the cost of moving and renovations, and any surplus was eaten up by the old space. Bad inheritance planning can mean your legacy is eaten up by probate taxes, solicitor's fees and charges. You're saying that anti-war voices can't get on cable TV, because so much air time is eaten up by administration officials? Smith said much of his small budget is eaten up with weed control on the 140 hectares of wild space. I had intended to do some work on the book, sort out my buildings insurance and washing machine repair cover, but somehow the day has been eaten up with other things.1.1Encroach on something. this is the countryside that villagers fear will be eaten up by concrete Example sentencesExamples In 1699, he asked Louvois to compensate a poor man with eight children whose land had been eaten up by the citadel of Pinerolo. With more and more ground being eaten up by multi-storey buildings, green space is fast sinking in the city. Now so much of it is eaten up by concrete, and the rest has become a slum. With many of the old roadside spaces eaten up by development, there was a move towards the towns. He whispered it again - war is coming - and then slipped off like a shadow does when darkness eats it up. Nearly all the reclaimed land made available by the construction of the Aswan Dam has been eaten up by insatiable urban sprawl.eat away at (or eat something away)1Erode or destroy something gradually. the sun and wind eat away at the ice prevents bone from being eaten away Example sentencesExamples The timbers have been eaten away by what Mr Fox calls ‘radioactive seepage’. The stone blocks had been eaten away by time and now were only a shadow of their former glory. It seems everywhere that two apples rub up against each other, the skin has been eaten away by a worm. He wants to eat away at some of the more annoying kinds of brakes that can be applied to a measure along its legislative journey. Going into the room he expected to step on carpet but found that the carpet had been eaten away and in places there were only the bare floorboards underneath. In that time literally millions of bombs have rained down on the soft Holderness earth - and now they are all being exposed as the cliffs are eaten away by the sea. He swallowed hard, preparing to admit something that had bothered him for the past seven years, eating away at his insides. ‘I learned a long time ago that you can't let a big loss eat away at you,’ the coach said. If I don't make the initial effort, nobody bothers with me and that sucks and it's eating away at me. The front porch had collapsed at one end where the supports had been eaten away by the fire and what looked like a bundle of rags had been wrapped around a post flanking the steps.1.1Use up (profits, resources, or time), especially when they are intended for other purposes. inflation can eat away at the annuity's value over the years Example sentencesExamples Bad investments usually subject investors to gut-wrenching volatility, while often eating away at their capital. It eats away at self confidence which is a problem all of the girls my age are having. Each of those planes will eat away at BA's European market. Offering salespeople the right incentives to sell offshore deals eats away at lucrative margins. They are awarded in addition to monies granted for works on the ground so will not eat away at the £ 2.3m ring-fenced for capital improvements. There is some truth in the accusation that the offshore world eats away at government revenue. His wife takes in work as a seamstress and bakes to help support the family, as they eat away at their savings. This would be a real achievement, for nothing eats away at public confidence more than corruptio", "n. There's something eating away at the global economy, creatures chomping through trillions of dollars. Interest inflation, that is, is eating away at your returns every day. Synonymserode, corrode, abrade, wear away, wear away at, wear down, wear through, gnaw away, gnaw away at, bite into, burn into, burn through, consume, dissolve, disintegrate, crumble, waste away, rot, decayOriginOld English etan, of Germanic origin; related to Dutch eten and German essen, from an Indo-European root shared by Latin edere and Greek edei", "n.verb.1 phr. phr.", "v."]}, {"dict": "Oxford5000", "values": ["eat outSee eat1eat1 verbeaten, ate iːt[with object]1Put (food) into the mouth and chew and swallow it. he was eating a hot dog eat up all your peasno object she watched her son as he ate Example sentencesExamples The nurses brought him food, but he had refused to eat it because it included cheese. When eating solid food, patients may have difficulty chewing and initiating swallows. In nature we see animals eating their prey alive. The tradition includes eating corned beef and cabbage and drinking it up at the local pub. I forgot to wipe my mouth after eating the chocolate cake my mom baked. In Africa, the fruits are eaten raw, or cooked in a soup, or fried in oil. They even had the gall to chew open the fishfood container and eat the food! The early humans butchered the elephant at the kill site and ate the meat raw, the archaeologists add. He ", "also talks about how his wife was accused of shoplifting in a major supermarket when her young son was spotted eating a grape from the trolley before the bag had been weighed. Other people watched the dancing, talked, bought stuff and ate food. Now, it is considered more refined to eat with a spoon and fork. She quickly ate the burger and swallowed some of the fries whole. With each bite, I regained strength, and I backed to the trunk of a tree to finish eating my food. He had finished eating the cookies, but the pack remained in his hand. I think over the five days we were there, our son ate five cheese steak sandwiches. Mary smiled at him before eating her cereal, chewing happily. At all times, foods must be eaten slowly, chewed thoroughly or puréed, and consumed in small portions. Finally I finish eating my Chinese food and stood up from the table. Remember, in the wild, dogs eat fresh meat they have killed themselves. I finished eating my cereal and put it in the sink when I heard Kay coming down the stairs. Synonymsconsume, devour, ingest, partake of, gobble (up/down), gulp (down), bolt (down), wolf (down), cram down, finish (off)swallow, chew, munch, chomp, champinformal guzzle, nosh, put away, pack away, tuck into, tuck away, scoff (down), demolish, dispose of, make short work of, polish off, shovel down, get stuck into, stuff one's face with, stuff down, pig out on, sink, get outside of, get one's laughing gear roundBritish informal gollop, shiftNorth American informal scarf (down/up), snarf (down/up), inhalerare ingurgitate1.1 Have (a meal) we ate dinner in a noisy cafe Example sentencesExamples I am only slightly ashamed to announce that I have taken to eating my meals at home at my desk while using my computer. Furthermore, employees made use of the courtyard for their lunch breaks, eating their meals and enjoying the view of a fountai", "n. Students who have eaten in the village cafeterias quickly learn to appreciate off-campus food. I shrugged nonchalantly and our breakfast was eaten in silence. But when it's snowing outside and you're eating the last meal of the year, a treat like this is deserved. Then we ate at a small restaurant on a side street with no tourists. Vince usually didn't eat lunch or dinner at the same time that she did, which didn't really bother her. We ate breakfast lunch and dinner with our many relatives, all of whom were delighted to see my mother. Michelle didn't tell Shane, but she hated eating in the cramped cafeteria. By eating a meal with them, Jesus associated himself with them. There's a special security team that has been coordinated that will watch his every move, even when he eats his last meal. People are so addicted that they eat lunch and dinner in front of the monitor. There's lots more to choose from if you can't make it by on a Saturday, or you want to eat lunch or dinner. We would find little use for most of this as we mainly ate breakfast and evening meals at restaurants and the guiding service supplied packed lunches every midday. She was grinning wickedly at the three, and they bit their lips simultaneously with regret for not eating that morning's meal. Then we sat on the water pipes which ran wide and warm along the wall outside the dinner hall and ate our lunch. She ate breakfast and dinner at the Amish Door Restaurant every day. We sat at the dinner table later, eating the meal that Jane had prepared. Meals are eaten with a large spoon or chop sticks. There were several questions and quick answers, but most of the meal was eaten in silence. Synonymshave a meal, partake of food, take food, consume food, feedbreakfast, lunch, dine, have breakfast, have lunch, have dinner, have supperfeast, banquetinformal snack, graze, noshdated sup, break bread1.2eat outno object Have a meal in a restaurant. there were plenty of places to eat out in the city centre Example sentencesExamples In the kitchen, Kathy began cooking meals instead of eating out so she could keep an eye on calories, fat grams and portion sizes. They want to take in some live music in local pubs and eat out in local restaurants. Waterhouse explains that since we eat out so often, restaurant meals are no longer the special treat they once were. Even when I was playing, I enjoyed going to fine restaurants and eating out. No meals are provided but eating out in this area is not all that expensive with a typical evening meal costing £10. Anyway, Parisians and New Yorkers eat out nearly every meal and are grateful for the comfort and blessed relative calm of a home-cooked meal. Others thought the solution to changing food choices was to have someone else prepare all the food for them or to eat out in restaurants. Combine this with take-away meals or eating out and you have the perfect recipe for a chore-free week. It's great to stay in the best hotels, eat out in the best restaurants in Scotland and find new places, but it's hard work. Getting paid to eat out at expensive restaurants is a tough job but someone has to do it. If eating out in a restaurant have a low calorie starter or dessert. Eating at Glastonbury isn't, of course, like eating out in stylish restaurants. ‘We ate out at restaurants or I cooked huge, high-fat meals every night,’ she recalls. When you do eat out, choose a restaurant that offers a healthy menu and head off hunger pangs with a small snack (like a few nuts or a piece of fruit) before you arrive. Today was mundane at work; however I ended up eating out for two meals out of three. Those of us who eat out enjoy marvelous restaurants. I would be happy walking by the river, or sitting at home snuggled on the couch - Scarlet always wanted to go places, see shows, eat out at posh restaurants. My other big money weakness is eating out in restaurants with my mates. Most of us buy more low fat foods and since many of us still want to eat out, restaurants are increasing their ‘healthy’ selections. At present we don't have a fridge, so have been eating out at different restaurants every night, which is nice, but makes me feel like I'm on holiday.1.3eat inno object Have a meal at home rather than in a restaurant. Example sentencesExamples The accommodation is self-catering, so eating in is the way forward. We can do what ordinary Venetians do: eat in or out, invite friends, and not feel forced to sit on cafe terraces to fill in time between meals. The café sells a variety of food including kebabs and baltis and customers can either eat in or take meals away.1.4US vulgar slangPerform fellatio or cunnilingus on (someone).noun iːteatsinformal Light food or snacks. these make great party eats Example sentencesExamples He introduced me to the streets around the hotel and importantly the cheap eats. Make a mental note of the cheap eats along this stretch of road. Open for three months now, it's a place for light vegetarian eats. All this variety is organized into chapters like late-night eats, takeouts, breakfast joints and an array of ethnic sections. Tracy and Lu are the perfect traveling companions… not only do they know where the best eats in town are; they are up at the crack of dawn, ready to explore the city with gusto. Nice crowd for brunch at the Union Cafe - we opted for cheaper eats at the Oriental fast food place in the food court. Tickets cost 10 and include drinks and light eats. An added attraction is a food court offering quick eats representing the best of the East and the West. Some members of the corps could be at the venue for anything up to four hours, and with no other outlet for eats or drinks at that level. Divided into sections that cover small eats, drinks, soups, rice dishes, side dishes and sweets, the recipes are clear and concise. Refuel with good Slovenian eats like sausages and pastas, and spend your nights in family-run pensions and a medieval castle. Hola's ", "also got a nice short menu of tropical and tropical-inspired light eats, perfect breakfast and lunch fare. Yes, that's right, the tables are turned in Germany and the person who is one year older is required to put up eats and drinks for her or his workmates. So making healthy eats more easily available is ", "also important. Synonymsnourishment, sustenance, nutriment, subsistence, fare, bread, daily breadfood, sustenance, nourishment, nutriment, farePhraseseat someone alive1informal (of insects) bite someone many times. we were eaten alive by mosquitoes Example sentencesExamples I was sitting lazily in a lawn chair by the river down the hill from my aunt's house and the mosquitoes were eating me alive. I tell him I am a bit worried about mosquitoes after they nearly ate me alive last time I came here in the summer. How can I drop a hint to the others that the mosquitoes are eating me alive when they, even the women, are all far more covered than I am? At night, crammed as many as 14 to a room, they say the mosquitoes eat them alive. I finally had to quit because the flies were eating me alive. Last time, in June we were eaten alive by a particularly nasty species of biting fly that drew blood. PPS - Population of my room - me, one cockroach, one gecko and one pesky mozzie that is eating me alive. It's a wonder he wasn't eaten alive by the midges! He was tempted to take off his shirt, but knew that the wicked little insects would eat him alive. When I started this, Patty wrote us and said bugs were eating them alive and they had no bathroom facilities except for putting two pieces of wood over a cardboard box and that's what they used as a toilet.1.1Exploit someone's weakness and completely dominate them. the defence lawyers would eat him alive on a written comment like that Example sentencesExamples And he said, ‘We would have handled it the same way, but Republicans in Congress, especially, would have been eating us alive for doing that.’ I couldn't show any sign of weakness or they'd eat me alive. I just looked out on the prison compound from the solitary room, and I could tell, I couldn't run with these people at all, they'd eat me alive. If he doesn't change his tune the Democrats will eat him alive on this one. The Democrats are eating them alive for being go at it alone cowboys and here we go proving their point. I think there are times when he needs to retreat from media attention - because the same media that will give you exposure is the same media that will eat you alive later o", "n. ‘If a pro-war Labour MP came to our group he would be eaten alive, because we know who said what to whom and when, better than he does,’ said one member. Bargain hunters aren't a completely ruthless bunch, but if you look mean, they will eat you alive. Most felt Christie would be eaten alive by some of the bigger, more robust full-forwards. Up front Laois were eaten alive by a ravenous Westmeath defense.eat one's heart out1Suffer from excessive longing for someone or something unattainable. I could have stayed in London eating my heart out for you Example sentencesExamples He quickly shut his mouth before opening it again to speak, ‘Can I say that you look absolutely drop-dead gorgeous and that there's not a single guy there tonight who won't be eating his heart out?’ Choreography like that would have had Diaghilev eating his heart out. How long will you eat your heart out here in tears and torment? Jamie is eating his heart out for Amanda, the fashion-model wife who ditched him, and whom he still keeps pursuing until he warms to a blind date, Vicky, a philosophy student with whom he may start afresh. I've been eating my heart out for the last three weeks because he lost the San Diego. And now that I have my man back, she can eat her heart out. Let him eat his heart out for what he'd rejected. I made sure I looked amazing (he dumped me and broke my heart) so he should eat his heart out. Since he left, she's been sitting at home eating her heart out. Along comes Martha as a Texas heiress affianced to a prince but eating her heart out over a bus-driver back home. Synonymspine, long, ache, brood, mope, fret, sigh, sorrow, suffer, bleed, yearn, agonize, weep and wail, regret someone's absence, regret someone's loss1.1informal in imperativeUsed to indicate that one thinks someone will feel great jealousy or regret. eat your heart out, those who missed the trip Example sentencesExamples But April raised her arms high before her - Superman, eat your heart out, she thought - and flew - flew! Tiger eat your heart out at this display of totally average golf. Bridget Jones eat your heart out, Tracy has a diary that would make many grown men weep, not least because it involves a wedding in November. There are ", "also a few anthemic numbers thrown in for good measure, such as ‘Lullaby’ and ‘Good Woman’ (Destiny's Child eat your heart out!). There is a surprise victor at Wimbledon, Maria Sharapova, who as well as taking the plate ", "also wowed the crowds - Anna Kournikova eat your heart out. Well, Hugh, we may have been snubbed by the Patriot, but eat your heart out: we're in the New York Post's gossip column, Page Six. Performing home-grown songs laced with a healthy mix of rock standards - including a simply sublime version of Pink Cadillac - eat your heart out, Springsteen - this band set the stage alight. ‘Sherlock Homes, eat your heart out,’ he muttered, then made his way to the opening in the wall. The PM's car has a steel plate underside, panic buttons, an exploding windscreen, loudspeakers and even gun ports: 007, eat your heart out. Mary Shelley eat your heart out, here we have a fear of giving birth to monsters in all its glory.eat like a birdinformal Eat very little. Example sentencesExamples I'm a rather big girl, which means I don't exactly eat like a bird. She's been here for three months and she's fine… she eats like a horse… and she loves me. I can't stress enough that you don't have to starve yourself or eat like a bird to build a great body. Despite eating like a horse recently my weight has continued to plummet. Children wont starve themselves, and after a few days my daughter was eating like a horse. Originally, she had dieted all the way down to 137 pounds - without doing any exercise - but she found she had to eat like a bird to keep herself at that weight. Of course, let's not jump to any distorted conclusion about Sarah's chowing patterns; I imagine Freddie probably eats like a bird, don't you think? Jack is a great footballer and he eats like a horse. Sometimes you can't get him to eat a thing, and then at other times he eats like a horse! He wasn't into real sports, but was on the cross country and track teams, which pretty much explained why he was as skinny as stringed beans, even though he ate like a horse.eat like a horseinformal Eat a great deal.eat someone out of house and homeinformal Eat a lot of someone else's food. he would eat them out of house and home if he continued to run through biscuits at his present rate Example sentencesExamples This will help solve the problem of what to eat for lunch but will protect the employer from having workers eat him out of house and home, since the charge for food will both reduce consumption and ", "also provide income. ‘I ate them out of house and home so it's probably his wife's decision,’ he said. I followed closely, knowing that Mike might eat us out of house and home. She sits around complaining that we have no money and, to be perfectly honest, is eating me out of house and home. I bet you anything we'll eat you out of house and home. When I came home, Kyle and some of his friends I really didn't like were in the kitchen, eating us out of house and home as usual. They ate us out of house and home, we have no hamburgers left and we ran out of cheese and onion rolls, but we're famous for that. Some people say rude guests eat you out of house and home, but they never mention the hijacking of candles. Now then, is eating me out of house and home all that more entertaining than actually talking to me? Then there comes a time when the children grow into teenagers and you think that will eat you out of house and home, but there is light of the end of the tunnel!eat one's wordsRetract what one has said, especially in a humiliated way. they will eat their words when I win Example sentencesExamples The Indian captain ", "also came down heavily on the critics and said that all those who said that Team India was a myth would now be made to eat their words. We are content to prove our mettle gradually in our own way - so that biased persons eat their words when we emerge victorious. But the male regulars at the Met bar in Sale may have to eat their words after coming face to face with woman wielding the fastest cue in Britai", "n. I'm glad to report that they have been made to eat their words. You can eat your words now because they have defied you and all of the doubting media army. However, after he released all three hours of the director's cut, critics were forced to eat their words. Those who accused him of being a dogmatic socialist have been forced to eat their words. Those who talk tough are soon forced to eat their words. And now, you know, they saw it, and now they can eat their words. Her burning desire for achievement will ultimately lead her to success in the men's game and her current critics are going to eat their words.have someone eating out of one's handHave someone completely under one's control. the guys have the crowd eating out of their hand right away with a few jokes Example sentencesExamples Laidlaw had Jack eating out of his hand, especially when he offered him a wee trip round the Cote d' Azur in his yacht. Turning her charm switch on, Tracy had had him eating out of her hand in a week. Toni nodded her approval, ‘If you don't have Jamie eating out of your hand, believe me, you'll have every other guy there instead!’ He has everyone's respect because of his charisma and the young guys on the training pitch - he has us eating out of his hand. You won't be so reluctant to admit it when I have him eating out of your hand. Candlelight dinners will have me eating out of your hand. Paul laughed at the memory of Jason bragging about how he'd have Kirby eating out of his hand and begging to be forgive", "n. Synonymsbe in charge of, run, be in control of, manage, direct, administer, head, preside over, have authority over, supervise, superintend, oversee, guide, steerI'll eat my hatinformal Used to indicate that one thinks that something is extremely unlikely to happe", "n. if he comes back, I'll eat my hat Example sentencesExamples And if that doesn't spark some debate, I'll eat my hat. It's so secret I haven't a clue where or when it is but I'll tell you this: if I don't get there, I'll eat my hat. But if you like the samples, you'll love the original stuff, or I'll eat my hat. If London is still standing in the year 2020, I'll eat my hat. If places like Scarborough and Doncaster don't benefit from that I'll eat my hat. If computers come with CD drives 50 years from now, I'll eat my hat. If there's a child anywhere that'll like this I'll eat my hat. If you do all that, and still don't get an A, I'll eat my hat. If they can do it without relying on underlying axioms of homophobia and bigotry, then I'll eat my hat. If he's not snapped up by Hollywood I'll eat my hat.what's eating you (or him or her)?informal What is worrying or annoying you (or him or her)? OK, Mr Linley, what's eating you? Example sentencesExamples So the Almighty asked Adam: ‘So, what's eating you?’ ‘What's eating him?’ Faye asked. Seriously girl, what's eating you?Phrasal Verbseat something awayErode or destroy something gradually. the acid began to eat away at the edge of her tunic figurative the knowledge of his affair still ate away at her Example sentencesExamples In that time literally millions of bombs have rained down on the soft Holderness earth - and now they are all being exposed as the cliffs are eaten away by the sea. ‘I learned a long time ago that you can't let a big loss eat away at you,’ the coach said. It seems everywhere that two apples rub up against each other, the skin has been eaten away by a worm. He swallowed hard, preparing to admit something that had bothered him for the past seven years, eating away at his insides. The timbers have been eaten away by what Mr Fox calls ‘radioactive seepage’. The front porch had collapsed at one end where the supports had been eaten away by the fire and what looked like a bundle of rags had been wrapped around a post flanking the steps. Going into the room he expected to step on carpet but found that the carpet had been eaten away and in places there were only the bare floorboards underneath. The stone blocks had been eaten away by time and now were only a shadow of their former glory. He wants to eat away at some of the more annoying kinds of brakes that can be applied to a measure along its legislative journey. If I don't make the initial effort, nobody bothers with me and that sucks and it's eating away at me. Synonymserode, corrode, abrade, wear away, wear away at, wear down, wear through, gnaw away, gnaw away at, bite into, burn into, burn through, consume, dissolve, disintegrate, crumble, waste away, rot, decayeat into1Erode or destroy something gradually. these liquids can discolour the surface or even eat into the top layer of concrete Example sentencesExamples But it is still uncertain how much of the bigger tab companies will be able to pass through to consumers, and how sharply the costs will eat into profit margins. Lending will expand at a faster rate because the lower interest rates are eating into banks' revenues from government bonds. Of course, charges and inflation are both eating into the profit. That cuts to the heart of Hollywood's distribution system and eats into studio profits, even as it simultaneously creates new revenue opportunities. But to suspend the wires above the ceiling would cost £10,000 per bed, a cost which would eat into already stretched resources. Oil has jumped nearly 60 percent so far this year, stoking concerns that higher energy costs will eat into corporate profits and curb consumer spending. Bankers have previously warned that raising the reserve requirement would eat into bank profit margins and raise the cost of funds and hence increase the interest rate charged to borrowers. The fear was that higher interest rates will eat into corporate earnings, slash investment spending and lead to job losses. Transaction costs on small trades can eat into your profits. Much more hope was placed in diminishing the burdens on production which ate into profits.1.1Use up (profits, resources, or time) sales were hard hit by high interest rates eating into disposable income Example sentencesExamples Lending will expand at a faster rate because the lower interest rates are eating into banks' revenues from government bonds. The fear was that higher interest rates will eat into corporate earnings, slash investment spending and lead to job losses. But it is still uncertain how much of the bigger tab companies will be able to pass through to consumers, and how sharply the costs will eat into profit margins. That cuts to the heart of Hollywood's distribution system and eats into studio profits, even as it simultaneously creates new revenue opportunities. Of course, charges and inflation are both eating into the profit. Bankers have previously warned that raising the reserve requirement would eat into bank profit margins and raise the cost of funds and hence increase the interest rate charged to borrowers. But to suspend the wires above the ceiling would cost £10,000 per bed, a cost which would eat into already stretched resources. Oil has jumped nearly 60 percent so far this year, stoking concerns that higher energy costs will eat into corporate profits and curb consumer spending. Much more hope was placed in diminishing the burdens on production which ate into profits. Transaction costs on small trades can eat into your profits.eat someone upDominate the thoughts of someone completely. I'm eaten up with guilt Example sentencesExamples You want to be there the whole time, it just eats you up inside when you're not there. It's important that when you're not working you live a life, because it can eat you up inside and you just do job after job after job. I've been sober for ten years, had small children and know the guilt and how that can eat you up so hang in there. The guilt continued to grow and eat me up inside for all the innocent beings I had been part of killing for so long. That's not something I'm proud of, not something I'd not dearly love to change someday, not something that doesn't quietly eat me up. ‘If you take it too seriously it's going to eat you up,’ the Brisbane swimmer said. That would be too much of a luxury, besides, guilt would eat me up. Yet, finally her inner loneliness is eating her up, the feeling that she belongs nowhere, an outcast among the outcastes. I didn't want hate to eat me up - I didn't want to become a man-basher or hate a whole religion because of one monk. If I go through the rest of my life hating the people who killed my son and letting that eat me up and destroy me, that will happen to my children too. Synonymsabsorb, preoccupy, engrosseat something up1Use resources or time in very large quantities. an operating system that eats up 200Mb of disk space Example sentencesExamples The administrative resources of voluntary organizations are eaten up by site visits from auditors, sometimes different teams from the same department who have no knowledge of the other's visit. You're saying that anti-war voices can't get on cable TV, because so much air time is eaten up by administration officials? Bad inheritance planning can mean your legacy is eaten up by probate taxes, solicitor's fees and charges. But we moved in a budget year where we hadn't planned to move, so there were problems with the cost of moving and renovations, and any surplus was eaten up by the old space. Smith said much of his small budget is eaten up with weed control on the 140 hectares of wild space. I had intended to do some work on the book, sort out my buildings insurance and washing machine repair cover, but somehow the day has been eaten up with other things. All of the city's loose change for the next three years will be eaten up by the police. Also, because of the requirements of the shelters, a good portion of each day is eaten up when getting processed. The problem is that he fears his profits will be eaten up by the taxman unless his spending increases with his earning. Advance purchase is advised - otherwise, your savings will be eaten up.1.1Encroach on something. villagers fear that the countryside will be eaten up by concrete Example sentencesExamples In 1699, he asked Louvois to compensate a poor man with eight children whose land had been eaten up by the citadel of Pinerolo. He whispered it again - war is coming - and then slipped off like a shadow does when darkness eats it up. Now so much of it is eaten up by concrete, and the rest has become a slum. With more and more ground being eaten up by multi-storey buildings, green space is fast sinking in the city. Nearly all the reclaimed land made available by the construction of the Aswan Dam has been eaten up by insatiable urban sprawl. With many of the old roadside spaces eaten up by development, there was a move towards the towns.OriginOld English etan, of Germanic origin; related to Dutch eten and German essen, from an Indo-European root shared by Latin edere and Greek edei", "n.For such a fundamental concept, it is unsurprising that eat is an Old English word, with an ancient root shared by Latin edere ‘to eat’. This is the source not only of edible (late 16th century), but ", "also comestible (Late Middle English) ‘something edible’, edacious (early 19th century), a rare word for ‘greedy’, and obese (mid 17th century) from obedere ‘eat completely’. There are many phrases associated with eating. Eat, drink, and be merry, for tomorrow we die is a combination of two Biblical sayings, ‘A man hath no better thing under the sun, than to eat and to drink, and to be merry’ (Ecclesiastes) and ‘Let us eat and drink; for tomorrow we shall die’ (Isaiah). You are what you eat is a proverb that first appeared in English in the 1920s. It is a translation of the German phrase Der Mensch ist, was er isst, ‘Man is what he eats’, which was said by the philosopher Ludwig Feuerbach (1804–72). If you eat your heart out you suffer from excessive longing or grief. As eat your own heart the phrase was first used in Edmund Spenser's The Faerie Queene (1596): ‘He could not rest; but did his stout heart eat.’ See ", "also fretRhymesaccrete, autocomplete, beet, bittersweet, bleat, cheat, cleat, clubfeet, compete, compleat, complete, conceit, Crete, deceit, delete, deplete, discreet, discrete, effete, élite, entreat, escheat, estreat, excrete, feat, feet, fleet, gîte, greet, heat, leat, leet, Magritte, maltreat, marguerite, meat, meet, meet-and-greet, mesquite, mete, mistreat, neat, outcompete, peat, Pete, petite, pleat, receipt, replete, sangeet, seat, secrete, sheet, skeet, sleet, splay-feet, street, suite, sweet, teat, treat, tweet, wheat EAT2abbreviationTanzania (international vehicle registration).OriginFrom East Africa Tanzania (formerly Tanganyika).verb.1 phr. phr.", "v. abbr.1Definition of eat in US English: eat verbitēt[with object]1Put (food) into the mouth and chew and swallow it. he was eating a hot dog eat up all your peasno object she watched her son as he ate Example sentencesExamples Finally I finish eating my Chinese food and stood up from the table. He had finished eating the cookies, but the pack remained in his hand. The tradition includes eating corned beef and cabbage and drinking it up at the local pub. Mary smiled at him before eating her cereal, chewing happily. The early humans butchered the elephant at the kill site and ate the meat raw, the archaeologists add. I think over the five days we were there, our son ate five cheese steak sandwiches. He ", "also talks about how his wife was accused of shoplifting in a major supermarket when her young son was spotted eating a grape from the trolley before the bag had been weighed. The nurses brought him food, but he had refused to eat it because it included cheese. I finished eating my cereal and put it in the sink when I heard Kay coming down the stairs. They even had the gall to chew open the fishfood container and eat the food! In nature we see animals eating their prey alive. With each bite, I regained strength, and I backed to the trunk of a tree to finish eating my food. In Africa, the fruits are eaten raw, or cooked in a soup, or fried in oil. She quickly ate the burger and swallowed some of the fries whole. Other people watched the dancing, talked, bought stuff and ate food. At all times, foods must be eaten slowly, chewed thoroughly or puréed, and consumed in small portions. Remember, in the wild, dogs eat fresh meat they have killed themselves. Now, it is considered more refined to eat with a spoon and fork. I forgot to wipe my mouth after eating the chocolate cake my mom baked. When eating solid food, patients may have difficulty chewing and initiating swallows. Synonymsconsume, devour, ingest, partake of, gobble, gobble down, gobble up, gulp, gulp down, bolt, bolt down, wolf, wolf down, cram down, finish, finish offconsume, devour, ingest, partake of, gobble, gobble down, gobble up, gulp, gulp down, bolt, bolt down, wolf, wolf down, cram down, finish, finish off1.1 Have (a meal) we ate dinner in a noisy cafe Example sentencesExamples There's a special security team that has been coordinated that will watch his every move, even when he eats his last meal. Meals are eaten with a large spoon or chop sticks. There's lots more to choose from if you can't make it by on a Saturday, or you want to eat lunch or dinner. She ate breakfast and dinner at the Amish Door Restaurant every day. Vince usually didn't eat lunch or dinner at the same time that she did, which didn't really bother her. But when it's snowing outside and you're eating the last meal of the year, a treat like this is deserved. I shrugged nonchalantly and our breakfast was eaten in silence. Furthermore, employees made use of the courtyard for their lunch breaks, eating their meals and enjoying the view of a fountai", "n. Then we sat on the water pipes which ran wide and warm along the wall outside the dinner hall and ate our lunch. We would find little use for most of this as we mainly ate breakfast and evening meals at restaurants and the guiding service supplied packed lunches every midday. Students who have eaten in the village cafeterias quickly learn to appreciate off-campus food. We ate breakfast lunch and dinner with our many relatives, all of whom were delighted to see my mother. By eating a meal with them, Jesus associated himself with them. People are so addicted that they eat lunch and dinner in front of the monitor. Then we ate at a small restaurant on a side street with no tourists. Michelle didn't tell Shane, but she hated eating in the cramped cafeteria. She was grinning wickedly at the three, and they bit their lips simultaneously with regret for not eating that morning's meal. There were several questions and quick answers, but most of the meal was eaten in silence. We sat at the dinner table later, eating the meal that Jane had prepared. I am only slightly ashamed to announce that I have taken to eating my meals at home at my desk while using my computer. Synonymshave a meal, partake of food, take food, consume food, feed1.2eat outno object Have a meal in a restaurant. Example sentencesExamples If eating out in a restaurant have a low calorie starter or dessert. Others thought the solution to changing food choices was to have someone else prepare all the food for them or to eat out in restaurants. They want to take in some live music in local pubs and eat out in local restaurants. No meals are provided but eating out in this area is not all that expensive with a typical evening meal costing £10. Getting paid to eat out at expensive restaurants is a tough job but someone has to do it. In the kitchen, Kathy began cooking meals instead of eating out so she could keep an eye on calories, fat grams and portion sizes. Combine this with take-away meals or eating out and you have the perfect recipe for a chore-free week. Eating at Glastonbury isn't, of course, like eating out in stylish restaurants. Most of us buy more low fat foods and since many of us still want to eat out, restaurants are increasing their ‘healthy’ selections. I would be happy walking by the river, or sitting at home snuggled on the couch - Scarlet always wanted to go places, see shows, eat out at posh restaurants. Waterhouse explains that since we eat out so often, restaurant meals are no longer the special treat they once were. Those of us who eat out enjoy marvelous restaurants. My other big money weakness is eating out in restaurants with my mates. Anyway, Parisians and New Yorkers eat out nearly every meal and are grateful for the comfort and blessed relative calm of a home-cooked meal. Today was mundane at work; however I ended up eating out for two meals out of three. At present we don't have a fridge, so have been eating out at different restaurants every night, which is nice, but makes me feel like I'm on holiday. When you do eat out, choose a restaurant that offers a healthy menu and head off hunger pangs with a small snack (like a few nuts or a piece of fruit) before you arrive. It's great to stay in the best hotels, eat out in the best restaurants in Scotland and find new places, but it's hard work. Even when I was playing, I enjoyed going to fine restaurants and eating out. ‘We ate out at restaurants or I cooked huge, high-fat meals every night,’ she recalls.1.3eat inno object Have a meal at home rather than in a restaurant. Example sentencesExamples The café sells a variety of food including kebabs and baltis and customers can either eat in or take meals away. We can do what ordinary Venetians do: eat in or out, invite friends, and not feel forced to sit on cafe terraces to fill in time between meals. The accommodation is self-catering, so eating in is the way forward.1.4informalBother; annoy. she knew what was eating him Example sentencesExamples You feel so violated, that it eats you away slowly. What you need to do is get to the root of who you are and discover what's eating you. Whatever's eating him, he's losing his temper more and more, and the angrier he gets, the more incomprehensible he gets.1.5US vulgar slangPerform fellatio or cunnilingus on (someone).1.6eat outvulgar slangPerform cunnilingus or anilingus on (someone).1.7US informalAbsorb (financial loss or cost). Example sentencesExamples If we had to, we could probably eat the cost and still have a margi", "n. Damage one and you don't service it yourself, you send it back and eat the cost. Rather than eat the loss, he allegedly constructed an electronic shell game to offload the contracts on a innocent dupe. So those shareholders who invested for those last three weeks are just going to have to eat their losses? They agree that the first team screwed up; they'd eat the install cost if I paid for the multiplexer. If a hospital spent more than its allotted DRG, it now had to eat the cost. Most don't earn enough to pay it off, so the label eats that cost, making it up through earnings from hits. We would probably have to impose ourselves on Ethiopia and eat the added cost of flying around Egypt. So they're generally eating the currency loss caused by the greenback's decline. Cost savings are often hard to realize, and those that are usually get eaten by the merger costs. For health clubs with set membership fees, passage may force them to eat the cost. As it stands, it's the band that has to eat the costs by having CDs made which they're then giving away. Either the barber raises his prices, eats the higher costs, or lays off a worker, like the guy who sweeps up. Usually, the purchasers have to place the machines themselves or eat the cost. In other words, if you like that Q1 banner flying over your plant, you'll eat more cost. In any event, large companies are most likely to eat the costs of any potential licensing, say analysts. He borrowed against his boats to pay the claims, and Julian ate the other costs. I'm sure he had ripped off more than enough foreigners that day to eat his loss. Organic Teas, have decided to eat the cost of buying fair trade rather than raise prices. Sometimes you'll end up eating the cost of a job due to the ammunition expenses and amount of repair that is required to fix up your robot.nounitēteatsinformal Food or snacks. people would stop for soft drinks or eats Example sentencesExamples Nice crowd for brunch at the Union Cafe - we opted for cheaper eats at the Oriental fast food place in the food court. Yes, that's right, the tables are turned in Germany and the person who is one year older is required to put up eats and drinks for her or his workmates. Tracy and Lu are the perfect traveling companions… not only do they know where the best eats in town are; they are up at the crack of dawn, ready to explore the city with gusto. He introduced me to the streets around the hotel and importantly the cheap eats. So making healthy eats more easily available is ", "also important. Open for three months now, it's a place for light vegetarian eats. Hola's ", "also got a nice short menu of tropical and tropical-inspired light eats, perfect breakfast and lunch fare. Tickets cost 10 and include drinks and light eats. Refuel with good Slovenian eats like sausages and pastas, and spend your nights in family-run pensions and a medieval castle. All this variety is organized into chapters like late-night eats, takeouts, breakfast joints and an array of ethnic sections. Make a mental note of the cheap eats along this stretch of road. Some members of the corps could be at the venue for anything up to four hours, and with no other outlet for eats or drinks at that level. Divided into sections that cover small eats, drinks, soups, rice dishes, side dishes and sweets, the recipes are clear and concise. An added attraction is a food court offering quick eats representing the best of the East and the West. Synonymsnourishment, sustenance, nutriment, subsistence, fare, bread, daily breadfood, sustenance, nourishment, nutriment, farePhraseseat someone alive1informal (of insects) bite someone many times. we were eaten alive by mosquitoes Example sentencesExamples At night, crammed as many as 14 to a room, they say the mosquitoes eat them alive. It's a wonder he wasn't eaten alive by the midges! When I started this, Patty wrote us and said bugs were eating them alive and they had no bathroom facilities except for putting two pieces of wood over a cardboard box and that's what they used as a toilet. I finally had to quit because the flies were eating me alive. He was tempted to take off his shirt, but knew that the wicked little insects would eat him alive. How can I drop a hint to the others that the mosquitoes are eating me alive when they, even the women, are all far more covered than I am? PPS - Population of my room - me, one cockroach, one gecko and one pesky mozzie that is eating me alive. I tell him I am a bit worried about mosquitoes after they nearly ate me alive last time I came here in the summer. I was sitting lazily in a lawn chair by the river down the hill from my aunt's house and the mosquitoes were eating me alive. Last time, in June we were eaten alive by a particularly nasty species of biting fly that drew blood.1.1Exploit someone's weakness and completely dominate them. he expects manufacturers to be eaten alive by lawyers in liability suits Example sentencesExamples If he doesn't change his tune the Democrats will eat him alive on this one. Up front Laois were eaten alive by a ravenous Westmeath defense. Most felt Christie would be eaten alive by some of the bigger, more robust full-forwards. Bargain hunters aren't a completely ruthless bunch, but if you look mean, they will eat you alive. ‘If a pro-war Labour MP came to our group he would be eaten alive, because we know who said what to whom and when, better than he does,’ said one member. And he said, ‘We would have handled it the same way, but Republicans in Congress, especially, would have been eating us alive for doing that.’ I think there are times when he needs to retreat from media attention - because the same media that will give you exposure is the same media that will eat you alive later o", "n. I just looked out on the prison compound from the solitary room, and I could tell, I couldn't run with these people at all, they'd eat me alive. I couldn't show any sign of weakness or they'd eat me alive. The Democrats are eating them alive for being go at it alone cowboys and here we go proving their point.eat one's heart out1Suffer from excessive longing for someone or something unattainable. Example sentencesExamples Let him eat his heart out for what he'd rejected. I've been eating my heart out for the last three weeks because he lost the San Diego. Since he left, she's been sitting at home eating her heart out. Jamie is eating his heart out for Amanda, the fashion-model wife who ditched him, and whom he still keeps pursuing until he warms to a blind date, Vicky, a philosophy student with whom he may start afresh. I made sure I looked amazing (he dumped me and broke my heart) so he should eat his heart out. How long will you eat your heart out here in tears and torment? Along comes Martha as a Texas heiress affianced to a prince but eating her heart out over a bus-driver back home. He quickly shut his mouth before opening it again to speak, ‘Can I say that you look absolutely drop-dead gorgeous and that there's not a single guy there tonight who won't be eating his heart out?’ And now that I have my man back, she can eat her heart out. Choreography like that would have had Diaghilev eating his heart out. Synonymspine, long, ache, brood, mope, fret, sigh, sorrow, suffer, bleed, yearn, agonize, weep and wail, regret someone's absence, regret someone's loss1.1informal in imperativeUsed to encourage feelings of jealousy or regret. eat your heart out, I'm having a ball! Example sentencesExamples There are ", "also a few anthemic numbers thrown in for good measure, such as ‘Lullaby’ and ‘Good Woman’ (Destiny's Child eat your heart out!). Performing home-grown songs laced with a healthy mix of rock standards - including a simply sublime version of Pink Cadillac - eat your heart out, Springsteen - this band set the stage alight. The PM's car has a steel plate underside, panic buttons, an exploding windscreen, loudspeakers and even gun ports: 007, eat your heart out. Mary Shelley eat your heart out, here we have a fear of giving birth to monsters in all its glory. There is a surprise victor at Wimbledon, Maria Sharapova, who as well as taking the plate ", "also wowed the crowds - Anna Kournikova eat your heart out. Bridget Jones eat your heart out, Tracy has a diary that would make many grown men weep, not least because it involves a wedding in November. ‘Sherlock Homes, eat your heart out,’ he muttered, then made his way to the opening in the wall. Well, Hugh, we may have been snubbed by the Patriot, but eat your heart out: we're in the New York Post's gossip column, Page Six. But April raised her arms high before her - Superman, eat your heart out, she thought - and flew - flew! Tiger eat your heart out at this display of totally average golf.eat like a birdinformal Eat very little. Example sentencesExamples Of course, let's not jump to any distorted conclusion about Sarah's chowing patterns; I imagine Freddie probably eats like a bird, don't you think? I can't stress enough that you don't have to starve yourself or eat like a bird to build a great body. Despite eating like a horse recently my weight has continued to plummet. Children wont starve themselves, and after a few days my daughter was eating like a horse. He wasn't into real sports, but was on the cross country and track teams, which pretty much explained why he was as skinny as stringed beans, even though he ate like a horse. Sometimes you can't get him to eat a thing, and then at other times he eats like a horse! Jack is a great footballer and he eats like a horse. She's been here for three months and she's fine… she eats like a horse… and she loves me. I'm a rather big girl, which means I don't exactly eat like a bird. Originally, she had dieted all the way down to 137 pounds - without doing any exercise - but she found she had to eat like a bird to keep herself at that weight.eat like a horseinformal Eat a great deal.eat someone out of house and homeinformal Eat a lot of someone else's food. Example sentencesExamples When I came home, Kyle and some of his friends I really didn't like were in the kitchen, eating us out of house and home as usual. Some people say rude guests eat you out of house and home, but they never mention the hijacking of candles. Then there comes a time when the children grow into teenagers and you think that will eat you out of house and home, but there is light of the end of the tunnel! ‘I ate them out of house and home so it's probably his wife's decision,’ he said. Now then, is eating me out of house and home all that more entertaining than actually talking to me? They ate us out of house and home, we have no hamburgers left and we ran out of cheese and onion rolls, but we're famous for that. I bet you anything we'll eat you out of house and home. She sits around complaining that we have no money and, to be perfectly honest, is eating me out of house and home. I followed closely, knowing that Mike might eat us out of house and home. This will help solve the problem of what to eat for lunch but will protect the employer from having workers eat him out of house and home, since the charge for food will both reduce consumption and ", "also provide income.eat one's wordsRetract what one has said, especially in a humiliated way. they will eat their words when I win Example sentencesExamples I'm glad to report that they have been made to eat their words. Those who talk tough are soon forced to eat their words. Her burning desire for achievement will ultimately lead her to success in the men's game and her current critics are going to eat their words. We are content to prove our mettle gradually in our own way - so that biased persons eat their words when we emerge victorious. However, after he released all three hours of the director's cut, critics were forced to eat their words. And now, you know, they saw it, and now they can eat their words. But the male regulars at the Met bar in Sale may have to eat their words after coming face to face with woman wielding the fastest cue in Britai", "n. Those who accused him of being a dogmatic socialist have been forced to eat their words. The Indian captain ", "also came down heavily on the critics and said that all those who said that Team India was a myth would now be made to eat their words. You can eat your words now because they have defied you and all of the doubting media army.have someone eating out of one's handHave someone completely under one's control. Example sentencesExamples Paul laughed at the memory of Jason bragging about how he'd have Kirby eating out of his hand and begging to be forgive", "n. Turning her charm switch on, Tracy had had him eating out of her hand in a week. Laidlaw had Jack eating out of his hand, especially when he offered him a wee trip round the Cote d' Azur in his yacht. He has everyone's respect because of his charisma and the young guys on the training pitch - he has us eating out of his hand. You won't be so reluctant to admit it when I have him eating out of your hand. Candlelight dinners will have me eating out of your hand. Toni nodded her approval, ‘If you don't have Jamie eating out of your hand, believe me, you'll have every other guy there instead!’ Synonymsbe in charge of, run, be in control of, manage, direct, administer, head, preside over, have authority over, supervise, superintend, oversee, guide, steerI'll eat my hatinformal Used to indicate that one thinks the specified thing is extremely unlikely to happe", "n. if he comes back, I'll eat my hat Example sentencesExamples It's so secret I haven't a clue where or when it is but I'll tell you this: if I don't get there, I'll eat my hat. But if you like the samples, you'll love the original stuff, or I'll eat my hat. If he's not snapped up by Hollywood I'll eat my hat. If computers come with CD drives 50 years from now, I'll eat my hat. If there's a child anywhere that'll like this I'll eat my hat. If you do all that, and still don't get an A, I'll eat my hat. If London is still standing in the year 2020, I'll eat my hat. If they can do it without relying on underlying axioms of homophobia and bigotry, then I'll eat my hat. If places like Scarborough and Doncaster don't benefit from that I'll eat my hat. And if that doesn't spark some debate, I'll eat my hat.Phrasal Verbseat intoErode or destroy something gradually. these liquids can discolor the surface or even eat into the top layer of concrete Example sentencesExamples The fear was that higher interest rates will eat into corporate earnings, slash investment spending and lead to job losses. But it is still uncertain how much of the bigger tab companies will be able to pass through to consumers, and how sharply the costs will eat into profit margins. Much more hope was placed in diminishing the burdens on production which ate into profits. Of course, charges and inflation are both eating into the profit. Bankers have previously warned that raising the reserve requirement would eat into bank profit margins and raise the cost of funds and hence increase the interest rate charged to borrowers. Lending will expand at a faster rate because the lower interest rates are eating into banks' revenues from government bonds. That cuts to the heart of Hollywood's distribution system and eats into studio profits, even as it simultaneously creates new revenue opportunities. Oil has jumped nearly 60 percent so far this year, stoking concerns that higher energy costs will eat into corporate profits and curb consumer spending. But to suspend the wires above the ceiling would cost £10,000 per bed, a cost which would eat into already stretched resources. Transaction costs on small trades can eat into your profits.eat someone upDominate the thoughts of someone completely. I'm eaten up with guilt Example sentencesExamples You want to be there the whole time, it just eats you up inside when you're not there. That would be too much of a luxury, besides, guilt would eat me up. That's not something I'm proud of, not something I'd not dearly love to change someday, not something that doesn't quietly eat me up. I've been sober for ten years, had small children and know the guilt and how that can eat you up so hang in there. The guilt continued to grow and eat me up inside for all the innocent beings I had been part of killing for so long. Yet, finally her inner loneliness is eating her up, the feeling that she belongs nowhere, an outcast among the outcastes. It's important that when you're not working you live a life, because it can eat you up inside and you just do job after job after job. If I go through the rest of my life hating the people who killed my son and letting that eat me up and destroy me, that will happen to my children too. ‘If you take it too seriously it's going to eat you up,’ the Brisbane swimmer said. I didn't want hate to eat me up - I didn't want to become a man-basher or hate a whole religion because of one monk. Synonymsabsorb, preoccupy, engrosseat something up1Use resources or time in very large quantities. an operating system that eats up 200Mb of disk space Example sentencesExamples All of the city's loose change for the next three years will be eaten up by the police. The problem is that he fears his profits will be eaten up by the taxman unless his spending increases with his earning. Advance purchase is advised - otherwise, your savings will be eaten up. The administrative resources of voluntary organizations are eaten up by site visits from auditors, sometimes different teams from the same department who have no knowledge of the other's visit. Also, because of the requirements of the shelters, a good portion of each day is eaten up when getting processed. But we moved in a budget year where we hadn't planned to move, so there were problems with the cost of moving and renovations, and any surplus was eaten up by the old space. Bad inheritance planning can mean your legacy is eaten up by probate taxes, solicitor's fees and charges. You're saying that anti-war voices can't get on cable TV, because so much air time is eaten up by administration officials? Smith said much of his small budget is eaten up with weed control on the 140 hectares of wild space. I had intended to do some work on the book, sort out my buildings insurance and washing machine repair cover, but somehow the day has been eaten up with other things.1.1Encroach on something. this is the countryside that villagers fear will be eaten up by concrete Example sentencesExamples In 1699, he asked Louvois to compensate a poor man with eight children whose land had been eaten up by the citadel of Pinerolo. With more and more ground being eaten up by multi-storey buildings, green space is fast sinking in the city. Now so much of it is eaten up by concrete, and the rest has become a slum. With many of the old roadside spaces eaten up by development, there was a move towards the towns. He whispered it again - war is coming - and then slipped off like a shadow does when darkness eats it up. Nearly all the reclaimed land made available by the construction of the Aswan Dam has been eaten up by insatiable urban sprawl.eat away at (or eat something away)1Erode or destroy something gradually. the sun and wind eat away at the ice prevents bone from being eaten away Example sentencesExamples The timbers have been eaten away by what Mr Fox calls ‘radioactive seepage’. The stone blocks had been eaten away by time and now were only a shadow of their former glory. It seems everywhere that two apples rub up against each other, the skin has been eaten away by a worm. He wants to eat away at some of the more annoying kinds of brakes that can be applied to a measure along its legislative journey. Going into the room he expected to step on carpet but found that the carpet had been eaten away and in places there were only the bare floorboards underneath. In that time literally millions of bombs have rained down on the soft Holderness earth - and now they are all being exposed as the cliffs are eaten away by the sea. He swallowed hard, preparing to admit something that had bothered him for the past seven years, eating away at his insides. ‘I learned a long time ago that you can't let a big loss eat away at you,’ the coach said. If I don't make the initial effort, nobody bothers with me and that sucks and it's eating away at me. The front porch had collapsed at one end where the supports had been eaten away by the fire and what looked like a bundle of rags had been wrapped around a post flanking the steps.1.1Use up (profits, resources, or time), especially when they are intended for other purposes. inflation can eat away at the annuity's value over the years Example sentencesExamples Bad investments usually subject investors to gut-wrenching volatility, while often eating away at their capital. It eats away at self confidence which is a problem all of the girls my age are having. Each of those planes will eat away at BA's European market. Offering salespeople the right incentives to sell offshore deals eats away at lucrative margins. They are awarded in addition to monies granted for works on the ground so will not eat away at the £ 2.3m ring-fenced for capital improvements. There is some truth in the accusation that the offshore world eats away at government revenue. His wife takes in work as a seamstress and bakes to help support the family, as they eat away at their savings. This would be a real achievement, for nothing eats away at public confidence more than corruptio", "n. There's something eating away at the global economy, creatures chomping through trillions of dollars. Interest inflation, that is, is eating away at your returns every day. Synonymserode, corrode, abrade, wear away, wear away at, wear down, wear through, gnaw away, gnaw away at, bite into, burn into, burn through, consume, dissolve, disintegrate, crumble, waste away, rot, decayOriginOld English etan, of Germanic origin; related to Dutch eten and German essen, from an Indo-European root shared by Latin edere and Greek edei", "n.verb.1 phr. phr.", "v."]}], "usphone": "", "ukphone": ""}