{"name": "circumstances", "trans": [{"dict": "TOEIC", "values": ["circumstance3 ENTRIES FOUND:circumstance (noun)pomp (noun)reduce (verb)circumstance/ˈsɚkəmˌstæns/nounplural circumstancescircumstance/ˈsɚkəmˌstæns/ nounplural circumstancesLearner's definition of CIRCUMSTANCE1[count] : a condition or fact that affects a situation情况；条件I can't imagine a circumstance in/under which I would do that.我真想象不出自己在什么情形下能做出那样的事。— usually plural通常用复数If our business is to survive, we must be able to adapt to changing circumstances.如果我们想继续把生意做下去，我们必须能够适应千变万化的环境。It is impossible under these circumstances to meet our deadline.在这样的情况下，根本不可能如期完成。Do not, under any circumstances, open that door. = Under no circumstances are you to open that door. [=no matter what happens, do not open that door]无论如何都不要打开那扇门。Due to circumstances beyond our control [=things that have happened that we cannot change or influence], the flight is canceled.由于出现无法控制的情况，航班被取消。There is nothing we can do under the circumstances. [=in this specific situation]在这种情况下，我们毫无办法。Given the circumstances, I think we did well. [=when you consider how everything went, I think we did well]鉴于当时的情况，我认为我们做得够好了。2circumstances [plural] : the way something happens : the specific details of an event情况；细节；详情The circumstances of his death are suspicious.他死亡的情形十分可疑。3: an event or situation that you cannot control（非人力所能控制的）机缘，命运，机遇[noncount]She says that her client is a victim of circumstance and should not be blamed for the accident.她说她的委托人也是客观环境的受害者，不应把事故的责任推给他。[plural]He was a victim of circumstances.他是客观环境的牺牲品。4circumstances [plural] : the conditions in which someone lives境遇；境况；经济状况Their circumstances changed dramatically after she lost her job.她失业后他们的经济状况发生了巨大的变化。I don't know anything about his financial circumstances. [=about how much money he has]我对他的经济状况一无所知。They have been forced to live in reduced circumstances. [=to live with less money]他们被迫过着紧巴巴的日子。pomp and circumstance—see pomp"]}, {"dict": "itVocabulary", "values": ["n.情况，环境，细节"]}], "usphone": "", "ukphone": ""}