{"name": "pass round", "trans": [{"dict": "Oxford5000", "values": ["pass the hat roundSee hatDefinition of hat in English: hat noun hathæt1A shaped covering for the head worn for warmth, as a fashion item, or as part of a uniform. a black straw hat a woolly hat Example sentencesExamples Dwarves, all wearing brightly coloured pointy hats, hurried pass on all manner of errands. Raucous women of all ages, many of them wearing glittery cowboy hats, are screeching at each other loudly. Staff and directors donned chef hats and aprons in the battle of the best cake. There were felt hats and straw hats, decorated with feathers and flowers, ribbon and lace. The city look was updated with pinstripe suits worn with pork pie hats and maxi-length leather coats. However, safari or straw hats ", "also come to mind for the golfing and country club set. Turn out your cupboard for old straw sunhats, berets, baseball caps and felt hats. Miss Sobania said on this occasion he wore a woolly hat instead of a helmet because it was cold. The man was wearing a long black raincoat and a hat and his face was hidden as he struggled with the dog. His suits were put into storage, and on went the beanie hats and jeans. We've all seen Beckham with his tea cosy version of the woolly hat and Victoria in her baseball cap. Church hats, straw hats or a colorful scarf tied around the head is very popular with the older crowd. The Stetson hats and baseball caps are whipped off when they begin with prayer. We walk away from the smattering of polo insiders wearing baseball caps and woolly hats, watching a practice game. This year's race on 2 November will be a day of hedonism and hats, of fashion shows and celebrities. Behind the counter men in white kitchen uniforms with little paper hats prepared plates of burgers and fries. They are both wearing Santa Claus hats, and they are out of their heads on Malibu. The original style V-neck T-shirt have sold out as have woolly and beanie hats. Everybody is wearing cowboy hats, and it's hotter than it was in Texas when he left. Straw hats vary in style, indicating either where the hat was made or where the wearer is from. SynonymsBritish informal titfer1.1 Used to refer to a particular role or occupation of someone who has more than one. wearing her scientific hat she is director of a pharmacology research group Example sentencesExamples From his humble origins to the height of power, Merten was a man of many hats for all seasons- Financier, Adventurer, War Hero. A Toastmaster Wears Many Hats. The Toastmaster is the host of the day and conducts the meeting (with the exception of the business portion). Life can be busy with many different roles and hats to put on and take off agai", "n. Wearing all her various hats and wearing them well, Paula certainly fits the Burton bill.Phrasesbe all hat and no cattleinformal Tend to talk boastfully without acting on one's words. in my view, the Senators are all mouth and no action or, as we say in my part of the country, all hat and no cattle Example sentencesExamples But for all the shiny numbers Manning puts up there is still a slight sense that he is, as they say in Texas, all hat and no cattle. It's all hat and no cattle, all buckle and no belt; or, as a noted English playwright once put it, ‘It is a tale told by an idiot, full of sound and fury, signifying nothing.’ And when you run ads saying you are going to take care of Social Security, my friend, that's all hat and no cattle. They're all hat and no cattle, a long run for a short slide. Chappell thinks the NHS shouldn't be broken up, or even handed over to fast-talking private managers who may turn out to be all hat and no cattle. Betraying all the latent suspicions and canny introspection of the Texas cattleman, they just wanted to know one thing: ‘Is he all hat and no cattle?’hats off to —Used to express admiration for someone who has done something praiseworthy. hats off to them for agreeing to work for the day to raise money Example sentencesExamples ‘It really is hats off to the fire brigade for mopping up so much so quickly,’ he said. If she and her boys can turn the younger music public onto something a little more challenging and less tedious then hats off to them. Firstly, hats off to me too for bravely not passing out. It's an absolutely incredible amount, and we really have to take our hats off to them. We must say hats off to the Evening Press though, as initiatives such as these are ones we had not thought of until the Press became involved. So hats off to my sister-in-law's brother who, when wished a happy 30th, instantly replied, ‘Don't be silly, I'm celebrating the first anniversary of my 29th birthday’. Stuart Hornby hit the ball superbly and hats off to him. Talking of which, free entry for kids under 16 to all enclosures on all three days is certainly good value, so hats off to marketing manager Carol Moore. But hats off to the lads - they've down a great job. So hats off to the band for going ahead with the film - particularly as they come across not as the fearsome rock warriors of popular image but a bunch of self-regarding, touchy-feely sissies.keep something under one's hatKeep something a secret. keep it under your hat is the golden rule for top chefs when it comes to sharing culinary secrets Example sentencesExamples If you've got a good idea, keep it under your hat. Here's a tip for Ascot, but keep it under your hat! They've certainly kept this change under their hat. The good folk of Harrogate would not want it shouting from their elegant Georgian rooftops, so keep it under your hat. I know how to keep my politics under my hat for a dinner party. At the moment it's all a bit hush-hush, so keep it under your hat. Churchill replied: ‘I'll tell you a secret, but keep it under your hat.’ I've been keeping some exciting news under my hat for the past two weeks. It was difficult for Weber to keep the discovery under his hat. I've spoken with him myself on his motives for committing his crime, and while I agreed to keep his explanation under my hat, I firmly believe his actions were justified. Synonymsconceal, hide, cover up, disguise, dissemble, mask, veilpass the hat roundCollect contributions of money from a number of people for a specific purpose. we're going to pass the hat round later and buy some beer Example sentencesExamples Of course, he left his unsuspecting assistant to pass the hat, and of course the money filled it to the brim. Celebrities are for the most part airheads, true, but they're really good at passing the hat for lobbying funds. After each performance, they pass the hat, collect what they can, and move on to the next village. Some restaurants have plans to ignore the ban altogether and pass the hat around for the fines. So the group passed the hat at school, asking the families of the 675 kids for donations, and raised another $14,000. We'll ", "also use the occasion to pass the hat around for a charity (to be confirmed) which is working on tsunami relief. Or you can watch the show from any vantage point on the plaza and pay what you can when they pass the hat. And in Richmond, organizers plan to pass the hat at parties and hold other fund-raisers for the US $1,000 or so needed to charter a bus. We'll ", "also be passing the hat for additional donations, so drink up and loosen your purse strings. Corporates and individuals pitch in, passing the hat around, so that the target is met.pick something out of a hatSelect something, especially the winner of a contest, at random. he picked the victor out of a hat Example sentencesExamples An inside source told me that candidates’ seating positions were chosen by picking numbers out of a hat. Today, we will be picking names out of a hat for our partners with our next project. Did someone just pick a percentage out of a hat and declare it to be fair? This is a case when the filmmakers couldn't have come up with worse choices if they had picked names out of a hat. Then tell them that after considerable thought, you've decided that the only way to make the call is to pick a name out of a hat and randomly choose a car to sell. It hardly seems fair to force people to pick a number out of a hat to justify a long-term strategic decisio", "n. I think they must have just picked players out of a hat rather than a seeding system because later on I played people Michael would have easily beate", "n. There is something liberating about going into a travel agent and saying that I want to go away in three days and just picking a hotel out of a hat. If two or more people suggested the chosen name, the winner will be picked out of a hat. Two lucky volunteers' names were picked out of a hat to fill the two places allocated to some charities for a trip to Londo", "n.take one's hat off toState one's admiration for (someone who has achieved something) I take my hat off to anyone who makes it work Example sentencesExamples I think for modern pop, you've go to take your hat off to the Spice Girls, they've all had to work very hard and they've done a great job. There are a lot of excellent farm shops in the region so I take my hat off to them as well. We've been working towards something special for the last five months, so you've got to take your hat off to these young fellas. Add to that the fact that he has recently had a heart attack and heart surgery and he's 59 and you certainly have to take your hat off to him. Supt Hitchborne added: ‘I take my hat off to the professionalism and commitment of the Army.’ ‘I take my hat off to all the participants,’ he said. I took my hat off to him for trying something like that. I take my hat off to all the people who do the job for an entire seaso", "n. Gatland added: ‘I think you've got to take your hat off to England, they came up with a fantastic performance.’ But I take my hat off to Sundberg for getting the technology and the media attentio", "n. Synonymspraise, pay tribute to, sing the praises of, speak highly of, express admiration of, commend, acclaim, applaud, salute, honour, show appreciation of, appreciate, recognize, acknowledge, give recognition to, show gratitude to, be grateful for, pay homage to, extolthrow one's hat in (or into) the ringExpress willingness to take up a challenge. he has resisted the temptation to throw his hat in the ring and do both jobs simultaneously Example sentencesExamples Last year he surprised many by throwing his hat in the ring to contest the chair against Queenan and came close to causing an upset. Never being one to turn down a new challenge, Larry threw his hat into the ring as a candidate for the position, and he was hired for the job. However he is not throwing his hat into the ring for the provincial vice chair. It seems she is seriously considering throwing her hat in the ring. It's not at all clear to me that he can push these other contenders from the field simply by throwing his hat into the ring. Undeterred, Danesh threw his hat in the ring once more by entering the Pop Idol competition last autum", "n. But he made clear yesterday that he will not be throwing his hat in the ring. I sincerely hope that he throws his hat into the ring and if he does, I will support him. All will be revealed on Friday night September 17 when the two heavyweights as well as many more local protagonists will be throwing their hat into the ring and vying for the coveted title. Everyone is throwing their hat in the ring because this is the last chance to do a deal. Synonymscompete for, contend for, vie for, challenge for, fight for, fight over, battle for, struggle for, tussle forDerivativeshatfulnounPlural hatfuls ˈhatfʊlˈhætˌfʊl I know now that I don't have to take hatfuls of wickets to impress. Example sentencesExamples He was about nineteen feet tall and scored hatfuls of goals as a result, all of them headers. To a large extent, Ireland were masters of their own downfall, making countless errors and conceding a hatful of penalties. Silsden missed a hatful of chances as Bulldogs levelled the match. After creating but failing to capitalise on a hatful of first-half chances Guiseley redeemed themselves with four second-half goals.hatlessadjective ˈhatləsˈhætləs Until the 1950s, many women would go hatless in their own quartier, something they would not do if they were to go beyond its informal limits. Example sentencesExamples The man came out of the darkness, impeccable as always in his well-styled coat - hatless this time, he noted, in spite of the wind. He was hatless with his hair slicked back and parted down the middle. It was very hot in the Brazilian sun on a hatless balding head. In contrast to many of the self portraits, it shows him dressed informally, tieless, hatless and with his shirt sleeves rolled up.hattedadjective ˈhatɪdˈhædədWearing a hat. a suited, booted, and hatted gentlemanOriginOld English hætt, of Germanic origin; related to Old Norse hǫttr 'hood', ", "also to hood1.Rhymesat, bat, brat, cat, chat, cravat, drat, expat, fat, flat, frat, gat, gnat, hereat, high-hat, howzat, lat, mat, matt, matte, Montserrat, Nat, outsat, pat, pit-a-pat, plait, plat, prat, Rabat, rat, rat-tat, Sadat, sat, scat, Sebat, shabbat, shat, skat, slat, spat, splat, sprat, stat, Surat, tat, that, thereat, tit-for-tat, vat, whereatnou", "n.1 phr.Definition of hat in US English: hat nounhæthat1A shaped covering for the head worn for warmth, as a fashion item, or as part of a uniform. Example sentencesExamples Raucous women of all ages, many of them wearing glittery cowboy hats, are screeching at each other loudly. Everybody is wearing cowboy hats, and it's hotter than it was in Texas when he left. His suits were put into storage, and on went the beanie hats and jeans. Straw hats vary in style, indicating either where the hat was made or where the wearer is from. However, safari or straw hats ", "also come to mind for the golfing and country club set. The Stetson hats and baseball caps are whipped off when they begin with prayer. This year's race on 2 November will be a day of hedonism and hats, of fashion shows and celebrities. There were felt hats and straw hats, decorated with feathers and flowers, ribbon and lace. Miss Sobania said on this occasion he wore a woolly hat instead of a helmet because it was cold. We've all seen Beckham with his tea cosy version of the woolly hat and Victoria in her baseball cap. Church hats, straw hats or a colorful scarf tied around the head is very popular with the older crowd. Behind the counter men in white kitchen uniforms with little paper hats prepared plates of burgers and fries. We walk away from the smattering of polo insiders wearing baseball caps and woolly hats, watching a practice game. The city look was updated with pinstripe suits worn with pork pie hats and maxi-length leather coats. The original style V-neck T-shirt have sold out as have woolly and beanie hats. Staff and directors donned chef hats and aprons in the battle of the best cake. The man was wearing a long black raincoat and a hat and his face was hidden as he struggled with the dog. Turn out your cupboard for old straw sunhats, berets, baseball caps and felt hats. Dwarves, all wearing brightly coloured pointy hats, hurried pass on all manner of errands. They are both wearing Santa Claus hats, and they are out of their heads on Malibu. Synonymstitfer1.1 Used to refer to a particular role or occupation of someone who has more than one. wearing her scientific hat she is director of a pharmacology research group Example sentencesExamples Life can be busy with many different roles and hats to put on and take off agai", "n. Wearing all her various hats and wearing them well, Paula certainly fits the Burton bill. From his humble origins to the height of power, Merten was a man of many hats for all seasons- Financier, Adventurer, War Hero. A Toastmaster Wears Many Hats. The Toastmaster is the host of the day and conducts the meeting (with the exception of the business portion).Phrasesbe all hat and no cattleinformal Tend to talk boastfully without acting on one's words. Example sentencesExamples It's all hat and no cattle, all buckle and no belt; or, as a noted English playwright once put it, ‘It is a tale told by an idiot, full of sound and fury, signifying nothing.’ And when you run ads saying you are going to take care of Social Security, my friend, that's all hat and no cattle. But for all the shiny numbers Manning puts up there is still a slight sense that he is, as they say in Texas, all hat and no cattle. Betraying all the latent suspicions and canny introspection of the Texas cattleman, they just wanted to know one thing: ‘Is he all hat and no cattle?’ Chappell thinks the NHS shouldn't be broken up, or even handed over to fast-talking private managers who may turn out to be all hat and no cattle. They're all hat and no cattle, a long run for a short slide.hat in handHumbly asking for a favor. they should not have to go hat in hand to Congress to ask for more money Example sentencesExamples The CEOs from Detroit's big three automakers go back before Congress today hat in hand. If I had approached James, hat in hand so to speak, and asked if he had talked with Murphy about that bill, what do you suppose he would have said? We must go hat in hand to the UN and ask the world to repair the political catastrophe we've sown at its root. And believe me, I went hat in hand to all of them. The big three went hat in hand to Congress to stay afloat at least through March. I went hat in hand and asked for your feedback on the hot young garage punk bands of 2003, and you, the readers, came out in force and told me. He has an approach that sounds like humble farmer with hat in hand. Rather than go hat in hand to the state, it sought bankruptcy protection from producers and banks, to which it owes a total $19 billio", "n. Senator McCain doesn't want to be seen hat in hand with the president whose failed policies he promises to continue for another four years. We didn't go hat in hand, we were asked to take it.keep something under one's hatKeep something a secret. Example sentencesExamples At the moment it's all a bit hush-hush, so keep it under your hat. I know how to keep my politics under my hat for a dinner party. Here's a tip for Ascot, but keep it under your hat! They've certainly kept this change under their hat. The good folk of Harrogate would not want it shouting from their elegant Georgian rooftops, so keep it under your hat. I've spoken with him myself on his motives for committing his crime, and while I agreed to keep his explanation under my hat, I firmly believe his actions were justified. If you've got a good idea, keep it under your hat. Churchill replied: ‘I'll tell you a secret, but keep it under your hat.’ I've been keeping some exciting news under my hat for the past two weeks. It was difficult for Weber to keep the discovery under his hat. Synonymsconceal, hide, cover up, disguise, dissemble, mask, veilpass the hatCollect contributions of money from a number of people for a specific purpose. Example sentencesExamples Celebrities are for the most part airheads, true, but they're really good at passing the hat for lobbying funds. And in Richmond, organizers plan to pass the hat at parties and hold other fund-raisers for the US $1,000 or so needed to charter a bus. Or you can watch the show from any vantage point on the plaza and pay what you can when they pass the hat. Some restaurants have plans to ignore the ban altogether and pass the hat around for the fines. Corporates and individuals pitch in, passing the hat around, so that the target is met. We'll ", "also be passing the hat for additional donations, so drink up and loosen your purse strings. So the group passed the hat at school, asking the families of the 675 kids for donations, and raised another $14,000. After each performance, they pass the hat, collect what they can, and move on to the next village. We'll ", "also use the occasion to pass the hat around for a charity (to be confirmed) which is working on tsunami relief. Of course, he left his unsuspecting assistant to pass the hat, and of course the money filled it to the brim.pick something out of a hatSelect something, especially the winner of a contest, at random. Example sentencesExamples I think they must have just picked players out of a hat rather than a seeding system because later on I played people Michael would have easily beate", "n. Did someone just pick a percentage out of a hat and declare it to be fair? Two lucky volunteers' names were picked out of a hat to fill the two places allocated to some charities for a trip to Londo", "n. This is a case when the filmmakers couldn't have come up with worse choices if they had picked names out of a hat. Today, we will be picking names out of a hat for our partners with our next project. If two or more people suggested the chosen name, the winner will be picked out of a hat. An inside source told me that candidates’ seating positions were chosen by picking numbers out of a hat. Then tell them that after considerable thought, you've decided that the only way to make the call is to pick a name out of a hat and randomly choose a car to sell. There is something liberating about going into a travel agent and saying that I want to go away in three days and just picking a hotel out of a hat. It hardly seems fair to force people to pick a number out of a hat to justify a long-term strategic decisio", "n.take one's hat off toUsed to state one's admiration for (someone who has done something praiseworthy) I take my hat off to anyone who makes it work Example sentencesExamples But I take my hat off to Sundberg for getting the technology and the media attentio", "n. I took my hat off to him for trying something like that. There are a lot of excellent farm shops in the region so I take my hat off to them as well. I take my hat off to all the people who do the job for an entire seaso", "n. We've been working towards something special for the last five months, so you've got to take your hat off to these young fellas. ‘I take my hat off to all the participants,’ he said. Gatland added: ‘I think you've got to take your hat off to England, they came up with a fantastic performance.’ Supt Hitchborne added: ‘I take my hat off to the professionalism and commitment of the Army.’ I think for modern pop, you've go to take your hat off to the Spice Girls, they've all had to work very hard and they've done a great job. Add to that the fact that he has recently had a heart attack and heart surgery and he's 59 and you certainly have to take your hat off to him. Synonymspraise, pay tribute to, sing the praises of, speak highly of, express admiration of, commend, acclaim, applaud, salute, honour, show appreciation of, appreciate, recognize, acknowledge, give recognition to, show gratitude to, be grateful for, pay homage to, extolthrow one's hat in (or into) the ringExpress willingness to take up a challenge, especially to enter a political race. Example sentencesExamples It's not at all clear to me that he can push these other contenders from the field simply by throwing his hat into the ring. But he made clear yesterday that he will not be throwing his hat in the ring. Everyone is throwing their hat in the ring because this is the last chance to do a deal. I sincerely hope that he throws his hat into the ring and if he does, I will support him. Last year he surprised many by throwing his hat in the ring to contest the chair against Queenan and came close to causing an upset. Undeterred, Danesh threw his hat in the ring once more by entering the Pop Idol competition last autum", "n. However he is not throwing his hat into the ring for the provincial vice chair. All will be revealed on Friday night September 17 when the two heavyweights as well as many more local protagonists will be throwing their hat into the ring and vying for the coveted title. Never being one to turn down a new challenge, Larry threw his hat into the ring as a candidate for the position, and he was hired for the job. It seems she is seriously considering throwing her hat in the ring. Synonymscompete for, contend for, vie for, challenge for, fight for, fight over, battle for, struggle for, tussle forOriginOld English hætt, of Germanic origin; related to Old Norse hǫttr ‘hood’, ", "also to hood.nou", "n.1 phr."]}, {"dict": "Oxford5000", "values": ["pass the hat roundSee hatDefinition of hat in English: hat noun hathæt1A shaped covering for the head worn for warmth, as a fashion item, or as part of a uniform. a black straw hat a woolly hat Example sentencesExamples Dwarves, all wearing brightly coloured pointy hats, hurried pass on all manner of errands. Raucous women of all ages, many of them wearing glittery cowboy hats, are screeching at each other loudly. Staff and directors donned chef hats and aprons in the battle of the best cake. There were felt hats and straw hats, decorated with feathers and flowers, ribbon and lace. The city look was updated with pinstripe suits worn with pork pie hats and maxi-length leather coats. However, safari or straw hats ", "also come to mind for the golfing and country club set. Turn out your cupboard for old straw sunhats, berets, baseball caps and felt hats. Miss Sobania said on this occasion he wore a woolly hat instead of a helmet because it was cold. The man was wearing a long black raincoat and a hat and his face was hidden as he struggled with the dog. His suits were put into storage, and on went the beanie hats and jeans. We've all seen Beckham with his tea cosy version of the woolly hat and Victoria in her baseball cap. Church hats, straw hats or a colorful scarf tied around the head is very popular with the older crowd. The Stetson hats and baseball caps are whipped off when they begin with prayer. We walk away from the smattering of polo insiders wearing baseball caps and woolly hats, watching a practice game. This year's race on 2 November will be a day of hedonism and hats, of fashion shows and celebrities. Behind the counter men in white kitchen uniforms with little paper hats prepared plates of burgers and fries. They are both wearing Santa Claus hats, and they are out of their heads on Malibu. The original style V-neck T-shirt have sold out as have woolly and beanie hats. Everybody is wearing cowboy hats, and it's hotter than it was in Texas when he left. Straw hats vary in style, indicating either where the hat was made or where the wearer is from. SynonymsBritish informal titfer1.1 Used to refer to a particular role or occupation of someone who has more than one. wearing her scientific hat she is director of a pharmacology research group Example sentencesExamples From his humble origins to the height of power, Merten was a man of many hats for all seasons- Financier, Adventurer, War Hero. A Toastmaster Wears Many Hats. The Toastmaster is the host of the day and conducts the meeting (with the exception of the business portion). Life can be busy with many different roles and hats to put on and take off agai", "n. Wearing all her various hats and wearing them well, Paula certainly fits the Burton bill.Phrasesbe all hat and no cattleinformal Tend to talk boastfully without acting on one's words. in my view, the Senators are all mouth and no action or, as we say in my part of the country, all hat and no cattle Example sentencesExamples But for all the shiny numbers Manning puts up there is still a slight sense that he is, as they say in Texas, all hat and no cattle. It's all hat and no cattle, all buckle and no belt; or, as a noted English playwright once put it, ‘It is a tale told by an idiot, full of sound and fury, signifying nothing.’ And when you run ads saying you are going to take care of Social Security, my friend, that's all hat and no cattle. They're all hat and no cattle, a long run for a short slide. Chappell thinks the NHS shouldn't be broken up, or even handed over to fast-talking private managers who may turn out to be all hat and no cattle. Betraying all the latent suspicions and canny introspection of the Texas cattleman, they just wanted to know one thing: ‘Is he all hat and no cattle?’hats off to —Used to express admiration for someone who has done something praiseworthy. hats off to them for agreeing to work for the day to raise money Example sentencesExamples ‘It really is hats off to the fire brigade for mopping up so much so quickly,’ he said. If she and her boys can turn the younger music public onto something a little more challenging and less tedious then hats off to them. Firstly, hats off to me too for bravely not passing out. It's an absolutely incredible amount, and we really have to take our hats off to them. We must say hats off to the Evening Press though, as initiatives such as these are ones we had not thought of until the Press became involved. So hats off to my sister-in-law's brother who, when wished a happy 30th, instantly replied, ‘Don't be silly, I'm celebrating the first anniversary of my 29th birthday’. Stuart Hornby hit the ball superbly and hats off to him. Talking of which, free entry for kids under 16 to all enclosures on all three days is certainly good value, so hats off to marketing manager Carol Moore. But hats off to the lads - they've down a great job. So hats off to the band for going ahead with the film - particularly as they come across not as the fearsome rock warriors of popular image but a bunch of self-regarding, touchy-feely sissies.keep something under one's hatKeep something a secret. keep it under your hat is the golden rule for top chefs when it comes to sharing culinary secrets Example sentencesExamples If you've got a good idea, keep it under your hat. Here's a tip for Ascot, but keep it under your hat! They've certainly kept this change under their hat. The good folk of Harrogate would not want it shouting from their elegant Georgian rooftops, so keep it under your hat. I know how to keep my politics under my hat for a dinner party. At the moment it's all a bit hush-hush, so keep it under your hat. Churchill replied: ‘I'll tell you a secret, but keep it under your hat.’ I've been keeping some exciting news under my hat for the past two weeks. It was difficult for Weber to keep the discovery under his hat. I've spoken with him myself on his motives for committing his crime, and while I agreed to keep his explanation under my hat, I firmly believe his actions were justified. Synonymsconceal, hide, cover up, disguise, dissemble, mask, veilpass the hat roundCollect contributions of money from a number of people for a specific purpose. we're going to pass the hat round later and buy some beer Example sentencesExamples Of course, he left his unsuspecting assistant to pass the hat, and of course the money filled it to the brim. Celebrities are for the most part airheads, true, but they're really good at passing the hat for lobbying funds. After each performance, they pass the hat, collect what they can, and move on to the next village. Some restaurants have plans to ignore the ban altogether and pass the hat around for the fines. So the group passed the hat at school, asking the families of the 675 kids for donations, and raised another $14,000. We'll ", "also use the occasion to pass the hat around for a charity (to be confirmed) which is working on tsunami relief. Or you can watch the show from any vantage point on the plaza and pay what you can when they pass the hat. And in Richmond, organizers plan to pass the hat at parties and hold other fund-raisers for the US $1,000 or so needed to charter a bus. We'll ", "also be passing the hat for additional donations, so drink up and loosen your purse strings. Corporates and individuals pitch in, passing the hat around, so that the target is met.pick something out of a hatSelect something, especially the winner of a contest, at random. he picked the victor out of a hat Example sentencesExamples An inside source told me that candidates’ seating positions were chosen by picking numbers out of a hat. Today, we will be picking names out of a hat for our partners with our next project. Did someone just pick a percentage out of a hat and declare it to be fair? This is a case when the filmmakers couldn't have come up with worse choices if they had picked names out of a hat. Then tell them that after considerable thought, you've decided that the only way to make the call is to pick a name out of a hat and randomly choose a car to sell. It hardly seems fair to force people to pick a number out of a hat to justify a long-term strategic decisio", "n. I think they must have just picked players out of a hat rather than a seeding system because later on I played people Michael would have easily beate", "n. There is something liberating about going into a travel agent and saying that I want to go away in three days and just picking a hotel out of a hat. If two or more people suggested the chosen name, the winner will be picked out of a hat. Two lucky volunteers' names were picked out of a hat to fill the two places allocated to some charities for a trip to Londo", "n.take one's hat off toState one's admiration for (someone who has achieved something) I take my hat off to anyone who makes it work Example sentencesExamples I think for modern pop, you've go to take your hat off to the Spice Girls, they've all had to work very hard and they've done a great job. There are a lot of excellent farm shops in the region so I take my hat off to them as well. We've been working towards something special for the last five months, so you've got to take your hat off to these young fellas. Add to that the fact that he has recently had a heart attack and heart surgery and he's 59 and you certainly have to take your hat off to him. Supt Hitchborne added: ‘I take my hat off to the professionalism and commitment of the Army.’ ‘I take my hat off to all the participants,’ he said. I took my hat off to him for trying something like that. I take my hat off to all the people who do the job for an entire seaso", "n. Gatland added: ‘I think you've got to take your hat off to England, they came up with a fantastic performance.’ But I take my hat off to Sundberg for getting the technology and the media attentio", "n. Synonymspraise, pay tribute to, sing the praises of, speak highly of, express admiration of, commend, acclaim, applaud, salute, honour, show appreciation of, appreciate, recognize, acknowledge, give recognition to, show gratitude to, be grateful for, pay homage to, extolthrow one's hat in (or into) the ringExpress willingness to take up a challenge. he has resisted the temptation to throw his hat in the ring and do both jobs simultaneously Example sentencesExamples Last year he surprised many by throwing his hat in the ring to contest the chair against Queenan and came close to causing an upset. Never being one to turn down a new challenge, Larry threw his hat into the ring as a candidate for the position, and he was hired for the job. However he is not throwing his hat into the ring for the provincial vice chair. It seems she is seriously considering throwing her hat in the ring. It's not at all clear to me that he can push these other contenders from the field simply by throwing his hat into the ring. Undeterred, Danesh threw his hat in the ring once more by entering the Pop Idol competition last autum", "n. But he made clear yesterday that he will not be throwing his hat in the ring. I sincerely hope that he throws his hat into the ring and if he does, I will support him. All will be revealed on Friday night September 17 when the two heavyweights as well as many more local protagonists will be throwing their hat into the ring and vying for the coveted title. Everyone is throwing their hat in the ring because this is the last chance to do a deal. Synonymscompete for, contend for, vie for, challenge for, fight for, fight over, battle for, struggle for, tussle forDerivativeshatfulnounPlural hatfuls ˈhatfʊlˈhætˌfʊl I know now that I don't have to take hatfuls of wickets to impress. Example sentencesExamples He was about nineteen feet tall and scored hatfuls of goals as a result, all of them headers. To a large extent, Ireland were masters of their own downfall, making countless errors and conceding a hatful of penalties. Silsden missed a hatful of chances as Bulldogs levelled the match. After creating but failing to capitalise on a hatful of first-half chances Guiseley redeemed themselves with four second-half goals.hatlessadjective ˈhatləsˈhætləs Until the 1950s, many women would go hatless in their own quartier, something they would not do if they were to go beyond its informal limits. Example sentencesExamples The man came out of the darkness, impeccable as always in his well-styled coat - hatless this time, he noted, in spite of the wind. He was hatless with his hair slicked back and parted down the middle. It was very hot in the Brazilian sun on a hatless balding head. In contrast to many of the self portraits, it shows him dressed informally, tieless, hatless and with his shirt sleeves rolled up.hattedadjective ˈhatɪdˈhædədWearing a hat. a suited, booted, and hatted gentlemanOriginOld English hætt, of Germanic origin; related to Old Norse hǫttr 'hood', ", "also to hood1.Rhymesat, bat, brat, cat, chat, cravat, drat, expat, fat, flat, frat, gat, gnat, hereat, high-hat, howzat, lat, mat, matt, matte, Montserrat, Nat, outsat, pat, pit-a-pat, plait, plat, prat, Rabat, rat, rat-tat, Sadat, sat, scat, Sebat, shabbat, shat, skat, slat, spat, splat, sprat, stat, Surat, tat, that, thereat, tit-for-tat, vat, whereatnou", "n.1 phr.Definition of hat in US English: hat nounhæthat1A shaped covering for the head worn for warmth, as a fashion item, or as part of a uniform. Example sentencesExamples Raucous women of all ages, many of them wearing glittery cowboy hats, are screeching at each other loudly. Everybody is wearing cowboy hats, and it's hotter than it was in Texas when he left. His suits were put into storage, and on went the beanie hats and jeans. Straw hats vary in style, indicating either where the hat was made or where the wearer is from. However, safari or straw hats ", "also come to mind for the golfing and country club set. The Stetson hats and baseball caps are whipped off when they begin with prayer. This year's race on 2 November will be a day of hedonism and hats, of fashion shows and celebrities. There were felt hats and straw hats, decorated with feathers and flowers, ribbon and lace. Miss Sobania said on this occasion he wore a woolly hat instead of a helmet because it was cold. We've all seen Beckham with his tea cosy version of the woolly hat and Victoria in her baseball cap. Church hats, straw hats or a colorful scarf tied around the head is very popular with the older crowd. Behind the counter men in white kitchen uniforms with little paper hats prepared plates of burgers and fries. We walk away from the smattering of polo insiders wearing baseball caps and woolly hats, watching a practice game. The city look was updated with pinstripe suits worn with pork pie hats and maxi-length leather coats. The original style V-neck T-shirt have sold out as have woolly and beanie hats. Staff and directors donned chef hats and aprons in the battle of the best cake. The man was wearing a long black raincoat and a hat and his face was hidden as he struggled with the dog. Turn out your cupboard for old straw sunhats, berets, baseball caps and felt hats. Dwarves, all wearing brightly coloured pointy hats, hurried pass on all manner of errands. They are both wearing Santa Claus hats, and they are out of their heads on Malibu. Synonymstitfer1.1 Used to refer to a particular role or occupation of someone who has more than one. wearing her scientific hat she is director of a pharmacology research group Example sentencesExamples Life can be busy with many different roles and hats to put on and take off agai", "n. Wearing all her various hats and wearing them well, Paula certainly fits the Burton bill. From his humble origins to the height of power, Merten was a man of many hats for all seasons- Financier, Adventurer, War Hero. A Toastmaster Wears Many Hats. The Toastmaster is the host of the day and conducts the meeting (with the exception of the business portion).Phrasesbe all hat and no cattleinformal Tend to talk boastfully without acting on one's words. Example sentencesExamples It's all hat and no cattle, all buckle and no belt; or, as a noted English playwright once put it, ‘It is a tale told by an idiot, full of sound and fury, signifying nothing.’ And when you run ads saying you are going to take care of Social Security, my friend, that's all hat and no cattle. But for all the shiny numbers Manning puts up there is still a slight sense that he is, as they say in Texas, all hat and no cattle. Betraying all the latent suspicions and canny introspection of the Texas cattleman, they just wanted to know one thing: ‘Is he all hat and no cattle?’ Chappell thinks the NHS shouldn't be broken up, or even handed over to fast-talking private managers who may turn out to be all hat and no cattle. They're all hat and no cattle, a long run for a short slide.hat in handHumbly asking for a favor. they should not have to go hat in hand to Congress to ask for more money Example sentencesExamples The CEOs from Detroit's big three automakers go back before Congress today hat in hand. If I had approached James, hat in hand so to speak, and asked if he had talked with Murphy about that bill, what do you suppose he would have said? We must go hat in hand to the UN and ask the world to repair the political catastrophe we've sown at its root. And believe me, I went hat in hand to all of them. The big three went hat in hand to Congress to stay afloat at least through March. I went hat in hand and asked for your feedback on the hot young garage punk bands of 2003, and you, the readers, came out in force and told me. He has an approach that sounds like humble farmer with hat in hand. Rather than go hat in hand to the state, it sought bankruptcy protection from producers and banks, to which it owes a total $19 billio", "n. Senator McCain doesn't want to be seen hat in hand with the president whose failed policies he promises to continue for another four years. We didn't go hat in hand, we were asked to take it.keep something under one's hatKeep something a secret. Example sentencesExamples At the moment it's all a bit hush-hush, so keep it under your hat. I know how to keep my politics under my hat for a dinner party. Here's a tip for Ascot, but keep it under your hat! They've certainly kept this change under their hat. The good folk of Harrogate would not want it shouting from their elegant Georgian rooftops, so keep it under your hat. I've spoken with him myself on his motives for committing his crime, and while I agreed to keep his explanation under my hat, I firmly believe his actions were justified. If you've got a good idea, keep it under your hat. Churchill replied: ‘I'll tell you a secret, but keep it under your hat.’ I've been keeping some exciting news under my hat for the past two weeks. It was difficult for Weber to keep the discovery under his hat. Synonymsconceal, hide, cover up, disguise, dissemble, mask, veilpass the hatCollect contributions of money from a number of people for a specific purpose. Example sentencesExamples Celebrities are for the most part airheads, true, but they're really good at passing the hat for lobbying funds. And in Richmond, organizers plan to pass the hat at parties and hold other fund-raisers for the US $1,000 or so needed to charter a bus. Or you can watch the show from any vantage point on the plaza and pay what you can when they pass the hat. Some restaurants have plans to ignore the ban altogether and pass the hat around for the fines. Corporates and individuals pitch in, passing the hat around, so that the target is met. We'll ", "also be passing the hat for additional donations, so drink up and loosen your purse strings. So the group passed the hat at school, asking the families of the 675 kids for donations, and raised another $14,000. After each performance, they pass the hat, collect what they can, and move on to the next village. We'll ", "also use the occasion to pass the hat around for a charity (to be confirmed) which is working on tsunami relief. Of course, he left his unsuspecting assistant to pass the hat, and of course the money filled it to the brim.pick something out of a hatSelect something, especially the winner of a contest, at random. Example sentencesExamples I think they must have just picked players out of a hat rather than a seeding system because later on I played people Michael would have easily beate", "n. Did someone just pick a percentage out of a hat and declare it to be fair? Two lucky volunteers' names were picked out of a hat to fill the two places allocated to some charities for a trip to Londo", "n. This is a case when the filmmakers couldn't have come up with worse choices if they had picked names out of a hat. Today, we will be picking names out of a hat for our partners with our next project. If two or more people suggested the chosen name, the winner will be picked out of a hat. An inside source told me that candidates’ seating positions were chosen by picking numbers out of a hat. Then tell them that after considerable thought, you've decided that the only way to make the call is to pick a name out of a hat and randomly choose a car to sell. There is something liberating about going into a travel agent and saying that I want to go away in three days and just picking a hotel out of a hat. It hardly seems fair to force people to pick a number out of a hat to justify a long-term strategic decisio", "n.take one's hat off toUsed to state one's admiration for (someone who has done something praiseworthy) I take my hat off to anyone who makes it work Example sentencesExamples But I take my hat off to Sundberg for getting the technology and the media attentio", "n. I took my hat off to him for trying something like that. There are a lot of excellent farm shops in the region so I take my hat off to them as well. I take my hat off to all the people who do the job for an entire seaso", "n. We've been working towards something special for the last five months, so you've got to take your hat off to these young fellas. ‘I take my hat off to all the participants,’ he said. Gatland added: ‘I think you've got to take your hat off to England, they came up with a fantastic performance.’ Supt Hitchborne added: ‘I take my hat off to the professionalism and commitment of the Army.’ I think for modern pop, you've go to take your hat off to the Spice Girls, they've all had to work very hard and they've done a great job. Add to that the fact that he has recently had a heart attack and heart surgery and he's 59 and you certainly have to take your hat off to him. Synonymspraise, pay tribute to, sing the praises of, speak highly of, express admiration of, commend, acclaim, applaud, salute, honour, show appreciation of, appreciate, recognize, acknowledge, give recognition to, show gratitude to, be grateful for, pay homage to, extolthrow one's hat in (or into) the ringExpress willingness to take up a challenge, especially to enter a political race. Example sentencesExamples It's not at all clear to me that he can push these other contenders from the field simply by throwing his hat into the ring. But he made clear yesterday that he will not be throwing his hat in the ring. Everyone is throwing their hat in the ring because this is the last chance to do a deal. I sincerely hope that he throws his hat into the ring and if he does, I will support him. Last year he surprised many by throwing his hat in the ring to contest the chair against Queenan and came close to causing an upset. Undeterred, Danesh threw his hat in the ring once more by entering the Pop Idol competition last autum", "n. However he is not throwing his hat into the ring for the provincial vice chair. All will be revealed on Friday night September 17 when the two heavyweights as well as many more local protagonists will be throwing their hat into the ring and vying for the coveted title. Never being one to turn down a new challenge, Larry threw his hat into the ring as a candidate for the position, and he was hired for the job. It seems she is seriously considering throwing her hat in the ring. Synonymscompete for, contend for, vie for, challenge for, fight for, fight over, battle for, struggle for, tussle forOriginOld English hætt, of Germanic origin; related to Old Norse hǫttr ‘hood’, ", "also to hood.nou", "n.1 phr."]}], "usphone": "", "ukphone": ""}