{"name": "push about", "trans": [{"dict": "Oxford5000", "values": ["push someone around (or about)See pushDefinition of push in English: push verb pʊʃpʊʃ1with object, usually with adverbial Exert force on (someone or something) in order to move them away from oneself. she pushed her glass towards himwith object and complement Lydia pushed the door shutno object he pushed at the skylight, but it wouldn't budge Example sentencesExamples Immediately she was pushed away and the ground would have cushion her fall except that would have hurt, but she was cushion by a warm body instead. The boy who had pushed Jaime earlier was now walking with Gwion, gesturing wildly as his voice rose to new heights. The guard announced, gently pushing the boy in front of him. I slam the brakes and the force of the car pushes us toward the windshield. Another woman budded in, pushing her way in front of the group. Lora, who was well under four feet tall, easily pushed the larger boy away and slipped into the room without a sound. Then the mass of boys began pushing Hyrum down the street. He felt sunshine on his face, but it was quickly torn away from him as a sack was ruthlessly shoved onto his head and he was pushed away. The winds pressed against my back and forced me upright, pushed me toward the side yard, then into the front. She said in exasperation, pushing her way in front of them once agai", "n. Ryo stood to walk out of the house, but Kunshi moved toward him and pushed him back into a seat. Akasha and Jessie were able to get threw because a large boy in front of them was pushing people out the way. He sat up, pushing the younger boy up as well, as he reached over to the table and grabbed a textbook. Rira managed to get in front of me and pushed the girl out of the way. Being the chivalrous idiot that I am, I kept pushing the person in front up, and the inevitable happened. I started pushing the people in front of me to get in the front ", "also. In one case the workers were pushed away by federal and military police squads. With his leg Marcus pushed one of the boys off of him and then he took his arm and hit the other boy. Embarassedly Kris pushed the older boy away, and tried to hide his blush. When he was about to take Winston's hand I found myself blocking the way, gently pushing the distressed little boy behind me. Synonymsshove, thrust, propel, impelsend, press, drive, plunge, stick, force, shoot, ram, bump, knock, strike, hit, jolt, butt, prod, poke, nudge, elbow, shoulderbulldoze, sweep, jostle, bundle, hustle, hurry, rush, manhandle1.1 Hold and exert force on (something) so as to cause it to move in front of one. a woman was pushing a pram Example sentencesExamples A few months ago, I was walking down the main street in my home town when two women in front, pushing their children in strollers, stopped dead on the pavement and started talking. After a couple, you'll be ready to emulate Byron, who liked to swim across the Grand Canal pushing a candle in front of him. And wisely, unlike so many of her opponents, she had elected not to run with that stall on her back or push it in front of her on a trolley. She glared and started pushing her cart in front of mine. Two young mums pushing their children in front of them walk along the narrow pavement by the pub as we stand watching the traffic. she asked, helping me into the wheelchair as she pushed the cart in front of me. Gasping for air, I scramble towards the raft and, with my four bobbing companions, swim to the safety of the shore pushing the raft in front of us. I made my way around one defense man but skating between them and pushing the puck in front of me. ‘He started running away pushing the pushchair in front of him,’ said Mr Butterworth. As everyone looked to the door, a plump nurse appeared around the curtain pushing a cart in front of her.1.2with adverbial Move one's body or a part of it into a specified position with effort. she pushed her hands into her pockets Example sentencesExamples It is a strong move in which you are pushing your lower body down into the ground and using the ground to enhance your resistance and stability. She drew close to him and pushed herself against his body, wrapping her arms around him. I pushed his nearly limp body up to a sitting position and got up from the couch. His brown eyes lingered on her body, as she pushed herself against him. She pushed herself against his body, against his chest where there was no heartbeat. After a moment or two to focus his effort, he pushed himself away from the wall. I ease myself quietly from the entanglement of his body and push myself up into a sitting positio", "n. When you push yourself, your body makes endorphins which give you a natural high. Stand up slowly to a straight leg position, then push yourself on to your toes. James grinned and pushed himself from his position with the muscles in his back. So he pushed himself in an effort to get better every day, so he could start and be prepared for that first game. He gently began pushing himself against her body, she frightful that he might fall on top of her. She used what body parts she could to push herself into sitting positio", "n. How is hands slowly would grip my hips as we pushed our ever decaying bodies closer to each other as the night died young. Bend your elbows so that your arms are at 90 degrees to your body, then push back up to the start positio", "n.1.3 Press (a part of a machine or other device) the lift boy pushed the button for the twentieth floor Example sentencesExamples She dementedly begins cackling as she pulls out an antenna and pushes a big red butto", "n. ‘I want to hear,’ she said, pushing the small black button on the phone's cradle. He laughed pushing the up button and the elevator doors swung ope", "n. By pushing a few ATM buttons, they can transfer their cash directly into Citibank vaults. Then I discovered I could keep my left leg elevated, whilst pushing the sewing machine pedal with my right foot. She pushed a small blue button on the side of the device, and it lit up. When everything was frozen in place again, he pushed the Unpause butto", "n. Staff activate the alarms by pushing an easily accessible butto", "n. She pushes the down button on the one next to it, hoping it would hurry up. Ally took the keys and pushed the unlock button on the keyless entry remote. Over the next few hours, I experiment with pushing the little attendant button occasionally to see if anyone cares, but they don't. Cameron knelt down quickly, pushing one more butto", "n. The man in the coat turned around to his desk, pushing a big red butto", "n. They were instructed to quickly push one of two buttons depending on the arrow's directio", "n. He picked up the cell phone and turned it around, pushing a small gray button at the back which opened up a slot for the tape. They have reached the elevator and he pushes the down butto", "n. After pushing the last button a soft breeze washed over everyone and they all turned around to find its source. He picks up the presentation/computer remote and pushes the top left butto", "n. The size of a watch, the DRS device is activated by pushing the Panic Button or when the device senses you haven't moved around in a while. They walked silently to the elevator and Bridget pushed the down butto", "n. Synonymspress (down), push down, depress, exert pressure on, bear down on, hold down, squeezeoperate, activate, actuate1.4with adverbial Cause to reach a particular level or state. competition in the retail sector will push down prices the political chaos could push the country into recession2no object, with adverbial Move forward by using force to pass people or cause them to move aside. she pushed her way through the crowded streets he pushed past an old woman in his haste Example sentencesExamples ‘Oh Sam, stop being such a drama queen,’ Bryant rolled his eyes and moved to push past her to step into the house. To chat to him your options are to push aside young, excited children, or rush to an enclosed area such as the corridor of staff toilets. Her male colleague approached and took hold of the defendant's arm but was hit in the arm and the other officer was pushed away, she said. Mark jumped aside as Grace pushed past him and made a watch out kind of whistle. After pushing past him they passed through the curtains and suddenly were in a big, warmly lit room. Forward ranks pushed back, darting past the elite guards at their backs as they fled for their own lines. shouted the boy suddenly, pushing the two ladies out of the way. He motioned for me to stay, then walked forward, pushed past his father and stepped into the study. With more and more force, he pushed aside anyone that stood in his way, with his hands and soon with his blade. I even had to push aside a few nurses and their flag-waving kiddies because the protest moved too slowly and the market was nearly closing. The soldier in the front, the one who I had cut, growled in rage as I passed and tried to push past Rama", "n. The security forces were aggressive, pushing forward until an elderly demonstrator suffered a heart attack. Then Sally was racing forward, pushing past the others, and diving head-first into the murky water. Teran made a move to push past Hayato, but found him unmoving. Mihra moved, pushing past him, making for the entrance in the rock through which her guide had disappeared. At once, the torch end erupted into flame, and he began to move forward, pushing roughly through the crowd. Synonymsforce (one's way), shove, thrust, squeeze, jostle, elbow, shoulderthread, wind, work, inch2.1 (of an army) advance over territory. the guerrillas have pushed south to within 100 miles of the capital Example sentencesExamples In January 1945 Montgomery's forces pushed forward to the Rhine. Thereafter, Twenty-first Army Group pushed steadily towards the Rhine. The war began when colonists from Massachusetts Bay began pushing into territory claimed by these people. As the Union army pushed into the South, a young soldier from the south, but committed to the Union cause, was assigned guard duty. In 1941 Germany pushed deep into Soviet territory, when the Soviet air-force hit back. With the enemy reception proving nothing like they had anticipated, troops pushed inland. The Huddersfield Second Battalion, and the rest of the Regiment, were pushing down to the south in the next phase of attack. With our nation at war, the Army is pushing toward more rapid, immediately relevant change in the Current and Future Force. In the late autumn of 1950, UN forces pushed forward up the peninsula towards the Chinese border. We must not weaken as we strike again and again, probing and pushing to exploit the enemy's vulnerabilities. Troops of the 101st, pushing deeper into Najaf, are greeted by cheering crowds. By August 1944, the U.S. VI Corps landed in the south of France and began pushing to the northeast, Prieur said. It was now October 1917 and the Allied advance pushed towards a feature known as Broodseinde Ridge. Gaede's Army Detachment pushed forward into the French lines near Obersept on the 13th of February. Ayutthaya pushed into Khmer territory and sacked the capital of Angkor. It is a third of the way to their destination, and the US army's 3rd Infantry Division is already pushing towards the city from further north. Right now, they were pushing through enemy territory in France. Israeli armour and infantry pushed into Jordan capturing the West Bank, deep into Sinai up to the Suez Canal and into the Golan Heights in Syria. All of the vehicles push through the kill zone as quickly as possible, advancing approximately 300 meters. As the Elf army pushed forward, a sea of blood, bodies and gore was left behind.2.2 Exert oneself to attain something or surpass others. I was pushing hard until about 10 laps from the finish Example sentencesExamples Will he be pushing hard for hate crimes legislation? Currently, the group is pushing hard to become highly cost efficient and has entered into processing arrangements with Gambia in order to create a highly competitive base. It is the one he is pushing hardest, although he admits that no possible reorganization can keep up the current levels of service. He really wanted this and has been pushing hard for it. With Montrose pushing hard for an equaliser and Peterhead admirably trying to double their tally, it was no surprise when the home side struck on the break after 75 minutes. After that the car was so consistent the whole race that I was really able to push hard, until the last 15 laps. The former young driver of the year finalist still has an outside chance of the Irish title this season and will be pushing hard to continue his winning ways on home soil. Coelho, who turned down an interview request, saying it might jeopardise his chance of election, has always rejected such assessments and is pushing hard for recognitio", "n. I made a clean start from pole and was pushing really hard until the first pitstop when I saw how big the gap actually was. He spent the lead-up to the G8 summit pushing hard for a deal on climate change, yet this deal caught Downing Street completely by surprise. When there's no nation pushing hard, the UN drifts like a beachball. They're pushing very hard for a conviction for murder. With billions of dollars in foreign aid at stake, the United Nations, sponsors of the talks, were pushing hard for a conclusion yesterday. The event, 54 holes of it anyway, was played on the Torrey Pines course near San Diego, which is pushing hard for a US Open in 2008. Six months ago they cautioned against being too aggressive on the corporate scandals; now they censure Democrats for not pushing harder. We're pushing very hard to get that to happen as soon as possible. We were pushing hard to include the costs of the road-over-rail but the Government said it didn't want it to be included. A dancer is always trying to tough it out a little longer, hoping to earn a few more bucks, pushing just a little harder. The fact that lots of Wall Streeters will get rich racking up fees on these tiny accounts only serves to show why they're pushing so hard for it. What they don't want is to lose their jobs and educational opportunities by pushing too hard at the restrictions their government has placed on their ability to speak. Synonymsstrive, struggle, endeavour, work, try hard, make every effort, do one's best, do one's utmost, do all one can, give one's all, give it one's all, give something one's all, go all out, fight, be at pains, put oneself out, apply oneself, exert oneself2.3be pushinginformalBe nearly (a particular age or amount) she must be pushing forty, but she's still a good looker Example sentencesExamples I'm pushing forty, though forty seems to be doing most of the pushing. I was surprised to find out, however, that the boys are actually a bit older than myself (I'm pushing fifty). Synonymsroughly, about, around, just about, round about, or so, or thereabouts, more or less, in the neighbourhood of, in the region of, in the area of, in the vicinity of, of the order of, something like, give or take, give or take a few, in round numbers, rounded down, rounded up3with object Compel or urge (someone) to do something, especially to work hard. she believed he was pushing their daughter too hard Example sentencesExamples Years of tests have pushed him hard physically and mentally. Significantly, she left her job as a schools coach amid allegations that she pushed the kids too hard. Parents who push their children hard always focus on examples they like, successes such as Lang and Ding. Gus pushes me hard to not just automatically do everything the accepted way. Although she didn't do anything sporty, she always wants to do her job well and she pushed us quite hard to get the potential out of us. Michael's father was a military man with a strong sense of order, and he pushed his sons hard in athletics. An unnamable urge was pushing me to drive harder, and for once, I didn't struggle to put words around it. That's why we'll push him hard to come around to the beliefs that mean the most to us. I've been pushing her too hard, asking too much of her. Tiburce always believed in me, and always pushed me to work hard. Afraid of losing a big customer, Mo didn't push him too hard. The need for Ottawa to push the U.S. harder to reopen the border to live cattle is a common refrain from producers across the country. All of a sudden the public want journalists to get the truth out of him, and the public backs them when they push Howard hard. The problem with that is that if you push a witness too hard too fast, they are going to take the Fifth Amendment or tell you to walk away. He was only 6 then, and I felt they were just pushing the kids too hard. On the subject of fitness, Black rejected Dawson's claims that Henry had pushed the players too hard. They were pushing me so hard I presumed I must have been in the top three. I only remember one teacher pushing me to work harder on my academic pursuits. But I have to say if he was available for Northern Ireland, I would be pushing him very hard. Do you think the government is trying to push voters even harder than it's pushed them already? Synonymsurge, press, pressure, put pressure on, pressurize, force, drive, impel, coerce, naglean on, prevail ondragoon into, steamroller into, browbeat into, use strong-arm tactics oninformal put the heat on, put the screws on, twist someone's arm, railroad into, bulldoze into3.1push forno object Demand persistently. the council continued to push for the better management of water resources Example sentencesExamples I will continue to push for policies that put ordinary members first and fight for a rank and file strategy. They have a successful side pushing for promotion from the Third Divisio", "n. Unions and safety campaigners have been pushing for the law to be extended. There have been calls for the council to try to push for a second railway station in the Swindon area. The Green Party will continue to push for more attractive alternatives to the car and lorry. She was the founder and former director of both the Center for Responsive Politics, which tracks electoral spending, and Public Campaign, which pushes for campaign finance reform. He said the campaign group was still pushing for more controls on the manufacture and sale of fireworks. York are pushing for the second promotion place after they sealed Poppleton's relegatio", "n. We ", "also work with housing associations and will push for families to be evicted if they continue to misbehave. They must now regroup and continue their push for promotion to the senior ranks. He is the one who pushed for campaign spending limits in this race; he rather insisted on them. Campaigners at the school are still pushing for the decision to be halted until more information can be given to the members. Any campaign pushing for a name change has to begin with our own media, officials and the people on the street. Some union chiefs are pushing for campaigns focusing on how families will be affected. Consumer campaigners have been pushing for a Europe-wide clothing size scale in a bid to make shopping easier. Green campaigners are pushing for recycling facilities in Thundersley to be given an upgrade. Their fall from grace appears to have levelled off and they are now pushing for promotion and ultimately a return to the top. Mrs Beatty has contacted the town council to help her push for more road safety improvements. That party will continue to push for a softening of the law around cannabis. So we should welcome and push for a leadership election campaign as soon as it's feasible. Synonymsdemand, insist on, clamour for, ask/call for, request, press for, campaign for, work for, lobby for, speak for, drum up support for, sponsor, urge, promote, advocate, recommend, champion, espouse3.2be pushedinformalHave very little of something, especially time. I'm a bit pushed for time at the moment3.3be pushed to do somethinginformalFind it difficult to achieve something. he will be pushed to retain the title as his form this season has been below par4informal with object Promote the use, sale, or acceptance of. the company has been pushing a document management system Example sentencesExamples Nevertheless, he mentioned that promotion activities that usually push up the sales figures had been stopped because of the strike. He's pushed the Yell sale - which has been in limbo for years. One upcoming promotion will push the redesigned CNN Headline News to the local ad sales community. Froggatt has been using some of the cost savings to invest in a series of marketing campaigns, which appears to be pushing up profits and sales of some of S&amp;N's core brands. He thinks Sindi pushed Stuart into accepting and that he only said yes because he doesn't really trust her. Dr Dorothy Faulkner, an expert in the social and intellectual development of children, says that publicity about bad forms of play could be pushing up traditional toy sales. I know America keeps pushing Europe to accept Turkey. Strong memory sales helped push AMD to a solid second quarter, the company reported today. Global sales have pushed Hyundai to seventh place, ahead of both Honda and Nissa", "n. Public sympathy pushed the Sorbonne to promote her to her dead husband's professorship. Synonymsadvertise, publicize, promote, give publicity to, beat/bang the drum for, popularizesell, market, merchandiseinformal plug, give a plug to, hype, hype up, give a puff to, puff, puff up, boost, flogNorth American informal ballyhoo, flack, huckster4.1 Sell (a narcotic drug) illegally. she was arrested for pushing hard drugs Example sentencesExamples Their example has fostered the establishment of another woman to pushing drugs in another area and to prosper. Police today declared war on drug dealers from London pushing cocaine, heroin and crack to children as young as 13. Since they can't keep him in the designer sneakers he wants, young Marcus starts pushing drugs himself. Of these junk messages, half are pushing drugs, a fifth promote porn and another fifth promote cheap software. Users should not be jailed, unless they were pushing others into the habit. We want to know who, what, where, when and if possible, how they know someone is pushing drugs. They lie, rob, cheat, push hard drugs, intimidate innocent people and run protection rackets. Side-effects and unforeseen deaths are part of the deal when you're pushing drugs. Police sources said he had been arrested for pushing drugs. As a result she ended up in the law courts for pushing drugs via her ever-popular soups and casseroles. While he adapts himself to life in the slums, he ", "also finds out there is money to be made in black-marketing false passports, pushing drugs and doing countless other small jobs. But Shadow Home Secretary Ann Widdecombe said legalising cannabis would lead drug barons to push even more hard drugs. Once cannabis is legalised, the dealers will be taken out of the equation and the risk of them pushing harder drugs and the availability of harder drugs to the cannabis smoker is eliminated. One kind of crime the former drugs squad officer is determined to come down on heavily, he warned, is the pushing of illegal drugs. Ah, the shadowy evil dealer, pushing drugs outside the school gate. Cllr Wright said he was not an informer, but where drugs were concerned, he would have no problem informing on those pushing, selling and taking drugs. Synonymssell, put on sale, put up for sale, offer for sale, vend, retail, trade in, deal in, traffic in, peddle, hawk, advertise5Computing with object Prepare (a stack) to receive a piece of data on the top.5.1 Transfer (data) to the top of a stack.6Photography with object Develop (a film) so as to compensate for deliberate underexposure. some films can be pushed during processingnoun pʊʃpʊʃ1An act of pushing someone or something in order to move them away from oneself. he closed the door with a push Example sentencesExamples Instead, though, I gave Anna a little push, and they moved sideways to the locker beside me. There is a push now to move the drugs over the counter. Mark said, giving her a small push through the door and closing it behind her. The corporation is fighting a push by creditors to move the former energy trading giant's bankruptcy case from New York to its hometown of Housto", "n. The move follows a government push to recruit 3,000 matrons across the country as part of a major plan for the National Health Service. Not so much as a push - absolutely no physical contact - just words. With a gentle push from another locomotive from behind, Flying Scotsman broke through a banner declaring Railfest open to the sound of the City of York Pipe Band. Jess gave the door a slight push and it swung ope", "n. I pushed the handle down and gave a gentle push upon the door. The move is the latest push by baseball to increase its marketing to younger fans - and make money along the way. Finally I gave him a push and slammed the door in front of his face. There was a push, a punch and another blow then a complaint to the police. If it means more critics or voters seeing films in the theater, it's a terrific outcome, even if the push behind the move is incredibly faulty. Michaels shoved me into the backseat with a harsh push and slammed the door in my face, and I realized it has been a while since a cop has done that to me. Then he tried to push Alice away gently trying not to hurt her bruises from the previous night but she wouldn't move with his gentle push. The Chinese are reportedly already a slight majority but new plans indicate a big push to move more settlers i", "n. Spitz looked back at the wisecracking Kai and with a little push, Kai was knocked out agai", "n. She sees the skin of her hand and pushes Neil out the door, ending the seduction for now. Just push open the door and walk straight up to the bar. He patted me on the back and gave me a slight push to the door as if I should do it right now. Synonymsshove, thrust, ram, bump, knock, hit, jolt, butt, prod, poke, elbow, nudge, shoulder, jostle1.1 An act of pressing a part of a machine or device. the door locks at the push of a button Example sentencesExamples With the push of a button the hatch swung open immediately reducing the million pigeons to just under a million with a wet feathery splat. With the push of a button, the narrow barrel of his device glowed and a beam of light issued from where blasts usually came. And then, with a push of a single button, the drink will be concocted before his very eyes within a matter of seconds. Printing great quality images is now possible directly from the Gallery with just a few pushes of a butto", "n. With a single push of a button, you can replay the last incoming transmission and up to 16 messages. Two short pushes of a button enable the operator to direct the system manually, and zoom in on the strange object, which has almost vanished between the waves. In just 20 seconds, the fully automatic, insulated roof retracts at the push of a button - and back again should the weather tur", "n. The work suggests a metal contraption, perhaps an explosive device that could be detonated with a push of the beige butto", "n. The air-taxi service's telephone number, programmed into Len's sat phone, is no more than the push of a memory button away. The rest push completely into the device and are ejected with a small eject button to the right of the slot. Then, with the push of a button, I erased the number from memory. The sound can usually be turned off by a button push. Go from the acoustic response of a baroque concert hall to that of a 10,000-seat arena or a gothic cathedral with the push of a butto", "n. They had an automatic phone fitted in his office, preprogrammed to enable him to reach other numbers at the push of a single butto", "n. Information is limited to only that which is host often used and is accessible with only a few pushes of the butto", "n. This is handy, but the machine does not remove them with a push of the button - you have to do the prewash treatment yourself. You can make tactical heads-up navigational displays for your vehicles with the push of a butto", "n. The electric beds, which can be raised and lowered at the push of a button, will help give patients more control and independence. The push of a button should reconnect power automatically when power is restored. The computer is turned on by a long push of either butto", "n.2A vigorous effort to do or obtain something. many clubs are joining in the fund-raising push he determined to make one last push for success Example sentencesExamples In an effort to maintain the push, Operation Impact has forged a partnership with Crimestoppers. The Yorkshire Dales National Park Authority is revitalising its network of information points and is urging local shops, pubs and cafes to join in the promotion push. A leading campaigner in the push to reopen Rochdale Canal has called on Rochdale Council to act swiftly to create a boatyard in Littleborough. A series of events is ", "also planned as part of the fund-raising push. That it continues to provide solace to readers long after the initial marketing push. They were amazing during our promotion push last seaso", "n. The nonpartisan effort, sponsored by a coalition of local groups, pushes registration at venues such as clubs and restaurants. The company's ambitious push to drive the brand upmarket risks hurting its existing premium marque, Audi. Jerry Gill is already looking forward to a promotion push with Cheltenham next season as he reckons their young bucks will be even better next term. It's part of a fundraising push that will ", "also see an internationally renowned pianist play the £11,000 grand piano at Swindon's New College. So was the long push to get the case before a jury worth the effort? The push into the enterprise space makes sense. Tindal Street Press gives the genre a push onto the bookshelves. The weekend's traffic effort from the Gardai was part of a national push to clamp down on dangerous and drunken driving. The Lartigue Monorail Restoration project has started its final fundraising push at a special press briefing in Listowel. The visitors were denied a third goal on 69 minutes when Sills crashed a powerful volley into the roof of the net but his effort was ruled out for an innocuous push. Nevertheless, the triumph gave York their first double of the league campaign and it could yet prove crucial in both side's promotion pushes. However, over the last month the manager has noticed a marked improvement in their standards and he now believes that his side are ready to embark on a serious promotion push. He noted that the TV station's ratings have responded to recent programming changes, and a strong push of promotion will help even more. This push into music is the start of a daring effort to reinvent one of the world's best-known brands. It attributes this growth to more affluent online shoppers, an ecommerce push by traditional retailers and the aggressive promotion of online stores. He says the decision would ", "also complement the current push to regulate the labour hire industry and ensure employers did not use labour hire to undercut the award system. As reported in Monday's Evening Press, York Police have launched a new push to remove beggars from York's streets. Synonymsendeavour, striving, effort, exertion, labour, work, toiling, pains2.1 A military attack in force. the army was engaged in a push against guerrilla strongholds Example sentencesExamples The push to downsize the military and privatize functions means government contracts are a growth industry. Now, all this comes on the heels of what was the deadliest attack here since the they ended their push, their offensive near the coast. The push of the main group of forces should be directed at exploiting success and thwarting the enemy's attempts to restore its defenses. The Allied forces co-ordinated a major push from the spring and, in April, the British pushed forward in the battle of Arras. The re-election of the president is expected to be followed in short order by a massive US military push into the desert city. It was too easy for some units we saw to take a final break before the big push into Iraq. We hit the targets at night in a final push against the terrorist's stronghold near the airport. The Marines need a divisional push to seize Fallujah and they don't have the me", "n. The Pentagon is making a serious push to pull US forces out of Balkans altogether. With the rapid push to Baghdad, our mission changed often, as did the CSB's task organizatio", "n. In Iraq, the military has launched another push against insurgents in the region where the rebellion continues to rage. Once Morocco was secure, it served as a major base for U.S. bombers and as a logistics center for the push toward Tunisia and Sicily. The Biafran army then went on the offensive in a push towards Lagos. A Communist push from the highlands to the sea to cut South Vietnam in half and isolate Saigon appeared in the offing. Despite the military push, a rocket which was fired from Gaza landed in an open area of Israel's Negev Desert overnight, causing no damage or injuries. Now, these attacks come, as you say, amid day three of the military's latest push against insurgents in the western desert. He was convinced that a major US military push into Najaf was not far away. American forces then embarked on the long push to Tokyo. It is the latest U.S. military push against the insurgency. The allies had concentrated the bulk of their troops to the north in advance of the push towards Germany, and this had left the US forces at the Ardennes thinly spread. Synonymsadvance, drive, thrust, charge, attack, assault, onslaught, onrush, offensive, sortie, foray, raid, sally, invasion, incursion, blitz, campaignarchaic onset2.2mass noun Forcefulness and enterprise. an investor with the necessary money and push Example sentencesExamples These men, who ‘do not let the grass grow under their feet’, are clearly all push and enterprise. Synonymsdrive, initiative, enterprise, enthusiasm, eagerness, ambition, motivation, go, dynamism, energy, gusto, vigour, vitality, verve, fire, fervour2.3a pushBritish informalSomething that is hard to achieve. we're managing on our own but it's a pushPhrasesat a pushinformal If absolutely necessary; only with a certain degree of difficulty. there's room for four people, or five at a push Example sentencesExamples You could use cottage cheese at a push, but sieve it really well, or the mix will end up lumpy. Or if you can't make you own notes photocopy your mates or at a push ask the teacher to go over it one lunchtime for you. In the past it was a lot simpler - you'd reach a certain age - somewhere between 22 and, at a push, 35-and you'd freeze dry your record collection, stop going to gigs and, certainly, stop reading music papers. Not making the link depend on a central server or need special software, ie hand-decodable at a push. Someone could say to me that Scott Brown, pictured, can play right wing and, at a push, centre-forward. Yes you can tap your feet to it, and at a push, sway your hips but there was no chance of being overwhelmed. Every single person I know can make fancy stuff like Thai green curry or at a push, stuffed peppers. I can say, for example, that it tends to form chemical bonds to five other atoms at a time, but can tolerate fewer and, at a push, more. They fit a good 10 to 12 tracks into a set that can't be much over 20 minutes - all of which are raucous, thrashy and comprised of two powerchords - maybe three at a push. Rear passenger space is a bit on the small side, almost making this a two-seater, but you could shoehorn in a couple of adults at a push. Synonymsif necessary, in case of necessity, if need be, if needs must, if forced, if all else fails, in an emergencyget the push (or shove)1informal Be dismissed from a job. four PR people at head office are getting the push Example sentencesExamples This was compounded further when Ronnie Burns was given the shove, and headed to Adelaide to join national uber scapegoat-in-the-making Wayne Carey. ‘You've done as much as you can with the paper,’ declared Ken Cowley, the News Corp managing director, when he gave me the shove. Eisner's position is not all that secure, and if his going was the difference between the renewal of the Pixar deal, or the loss of the Pixar deal, then conceivably the board might give him the shove. The luminescent bruises on that aggrieved ego are so obvious, the Professor can't help wondering if the column was penned within minutes of Farmer Phil learning that he was set to get the shove. Yet the committee-bound European elite, with their ludicrous consensus-based politicking, will almost assuredly be unable to muster up the courage to give him the push. When Colonel Lourake came to visit me here, he gave me the push. If he cannot back up such madness, and there isn't a hope in hell he will be able to, then Ladbrokes have to give him the shove. John Smith, the £205,000 a year chief executive of the Post Office, is getting the push for not being ruthless enough. What does John Tamihere have to do to get the push from Labour? They want pointy end fighters, and that is why DC got the shove from McLaren, and why I think Sir Frank Williams will give him the cold shoulder too. Synonymsthrow out, remove, eject, expel, turn out, turf out, fling out, force out, drive out, evict, dislodge, oust1.1Be rejected in a relationship. Example sentencesExamples As Gloria, his fiancée of five years who gets the push, Jessica Walker is a perfect screech, with a classic mother to match in Carol Wilso", "n. I just hoped Rebecca wouldn't give him the shove, like she does with most of the guys that showed interest in her.give someone the push (or shove)1informal Dismiss someone from a job. it's hard to psych yourself up to get another job after you've been given the push1.1End a relationship with someone.push at (or against) an open doorHave no difficulty in accomplishing a task. if the management were to tackle this issue, it might find that it was pushing at an open door Example sentencesExamples I think you should see instead us as pushing at an open door. There is no doubt that those campaigning for the right-to-die push at an open door. He should in some ways be pushing at an open door. I think that you are pushing at an open door, when you talk about public service ethos, and there is a price tag that goes with that. He's pushing at an open door with plenty of voters in Braithwaite where the extent of the prejudice harboured by some towards the 10 per cent Asian population in the town is stark. It made us realise that we could win this game, even if to be honest, I think he was pushing at an open door. Collecting signatures was like pushing at an open door. I understand Mr Leakey's concerns but as the club has committed to protect the genuine open space at the County Ground, he is pushing at an open door. There was a sense in which the Party was pushing at an open door. Chapman already planned to vote for him so the letter was pushing at an open door.push one's luckinformal Take a risk on the assumption that one will continue to be successful or in favour. he had pushed his luck too far, and his smuggling was discovered Example sentencesExamples ‘You could be great, along with my help,’ he continued, pushing his luck. Sure it was a risk to be pushing his luck so soon, but he was having a great time with Krystal and dreaded the fact that their evening would be coming to an end. He was basically pushing his luck, but seemed unaware of it. The wild cards afford you the luxury of being able to push your luck with no risk. As Brendan was leaving the church, and by this time definitely pushing his luck, he spoke to the priest who had officiated at the service. On the other hand, you are pushing your luck if you try to pull off heroic endurance feats every day. He must always be out there, pushing his luck, trying new things, taking a carefully calculated risk. The tradition ended abruptly when he pushed his luck too far and alienated the avowedly nationalist group by telling them that they must support the principles of unionism. Your parents have agreed to let you go for the party, don't push your luck by asking them to let you stay late. Those girls pushed their luck though when they suggested we might feel more comfortable someplace quieter.when push comes to shoveinformal When one must commit oneself to an action or decisio", "n. when push came to shove, I always stood up for him Example sentencesExamples While we'll work as a team, ultimately, when push comes to shove, Michael will have the final say. They sometimes say they are, but in fact when push comes to shove, they are no more interested in the weaker clubs than they are in clubs that are not in Victoria. I think when push comes to shove, the young people of the United States will react the same as generations before them. But again, I've got to think when push comes to shove, he won't do it. But when push comes to shove, he sold out to preserve his place in the party, and all for a man whose campaign attacked his family to score political points only 4 years ago. But I think, when push comes to shove, he'll be there with us. Is it possible you're totally wrong about North Korea, that the country is in such terrible shape that when push comes to shove, its military is going to turn out to be in just that kind of shape as well? But when push comes to shove, my greatest enjoyment can be summed up in one word: shopping. The good characters are decidedly saintly, and the bad guys aren't really all that bad when push comes to shove. But, two, I think it really helped when push comes to shove. Synonymseventually, in the end, in the long run, at length, finally, sooner or later, in time, in the fullness of time, after some time, in the final analysis, when all is said and done, one day, some day, sometime, at last, at long lastPhrasal Verbspush aheadProceed with or continue a course of actio", "n. he promised to push ahead with economic reform Example sentencesExamples She questioned the wisdom of the U.S. pushing ahead with a programme for which there is little or no scientific basis that it will be successful and which would be astronomically expensive. The county council is pushing ahead with plans to introduce by-laws increasing the speed limit on its section of the same road from 80 kmph to 100 kmph. As for the future, En Foco will continue to push ahead with more emphasis on the journal. He said that it was important to establish a new use for the site quickly, but this would not inhibit the council from pushing ahead with plans to help the 260 Thrall workers find new jobs. Coca-Cola continues to push ahead with the establishment of more local bottling plants. Instead of pushing ahead with a compulsory scheme in the short term, the Government will introduce draft legislation in the Queen's speech this month as the first step towards a voluntary system. But with China pushing ahead with development on its side, and near the border, Japan worries that the resources on its side will be affected. The Scottish Executive, however, attracted the bulk of criticism for increasing stress on teachers by pushing ahead with a policy of reducing the number of pupils being excluded from school. Since then the Town has continued to push ahead with the project on its ow", "n. Now the Food Standards Agency Scotland is pushing ahead with legislation that will force manufacturers to disclose any traces of the most dangerous dozen ingredients of food.push alongGo away; dep", "art.push someone around (or about)Treat someone roughly or inconsiderately. he was annoyed by their arrogance in thinking they could push him around whenever they wished Example sentencesExamples Nobody is pushing us around or has ever pushed us around on West Indian wickets. All those years he made fun of me, bullied me, pushed me around, I think that it was his cry for help. Maura pushed her around, Dinah had pushed her around, Chase pushed her around, everyone pushed her around, but Piper was going to stand up her decision this time. It appears that perhaps unconsciously you are attracting partners who push you around and treat you badly because at a deeper level you may still carry negative belief patterns from your childhood. You must hold your head up high and not allow those bullies to push you around. It means that part of what you should develop about your life is not letting people push you around. Sing along, now dad, dad, why did you let that man push you around like that? Nobody has succeeded in pushing me around before and now I'm even freer and in a better position to do my best for Bradley ward and Nelso", "n. They are going to push you around as much as a big corporate client. Everyone pushes us around, but the minute we get just a little bit of power, we exercise it to the fullest without prudence or thoughts on what it is doing to us in the bigger picture. Synonymsbully, domineer, boss about, boss around, ride roughshod over, trample on, tread on, bulldoze, abuse, mistreat, maltreat, kick about, kick around, browbeat, lean on, tyrannize, intimidate, threaten, torment, terrorize, victimize, pick onpush inGo in front of people who are already queuing. they scowled at him because they thought he was trying to push in at the head of the queue Example sentencesExamples I have ", "also witnessed the elderly pushing in the queue for the bus at the interchange, but if children dare do this, they get a mouthful of abuse. Was it a war against French and Dutch skiers trying to push in front of you in the queues for lifts? Seething with suppressed fury when someone cuts you up in traffic or pushes in front of you in a shop queue is a sure way to develop a raging headache, says a US researcher. I myself hate getting on the train and always stand at the back as I watch people get pushed in front of and people darting in-between people. It seems that while I have been happily queuing, others have been pushing in and sneaking ahead. She then pushed in front of me in the queue, demanded a discount and got it. Please, no pushing in the queue, we are all civilised and cultured people, your turn too shall come. You find yourself rubbing shoulders with some household names and being a little in awe of the whole thing, but by about day three you don't care who you're pushing in front of in the canteen queue. To start with, I was quite offended by people pushing in front of me as if I didn't exist. The woman pushed in front of her daughter until she was face to face with Isabelle.push off1Use an oar, boathook, etc. to exert pressure so as to move a boat out from a bank. we pushed off and rowed out into midstream Example sentencesExamples They pushed off the shore, rowing through the ice of the wide Delaware. Shapovalov pushes off for Ukraine in the men's four repechage. Push the ball behind your back toward your left hand as you push off your right foot to start moving to your left. Come right up to the bank to let her out, push off and be back again as soon as she was. Finally, it did, and though the orders that followed were to return to ship, a squall blew up and the boats could not push off. He helped me into the boat, then pushed off and jumped in himself. Once in the boat she ‘gets possession of an oar’ and pushes off. She too had got possession of an oar, and had pushed off, so as to release the boat from the overhanging window-frame. But when he tried to push off the block to get moving again, the block slid across the floor too. The water was shallow enough, and the bottom varied enough, that they often touched up against a rock of bit of sandbar, and when they did, they reacted instantly, pushing off against it to move laterally.2Go away. I've got to push off and get to work Synonymsgo away, depart, leave, take oneself off, take off, get out, get out of my sightpush onContinue on a journey. the light was already fading, but she pushed on Example sentencesExamples The middle westerner pushes on, endures, and finally finds a place that looks like home. A short photo stop soon cooled us down, before we pushed on up the hill carrying the weighty bags of tackle and camera gear. After a week and a half of catching up on sleep and drinking enough wine to prop up the economy, we begin thinking about pushing on to the island of Faial. Two gunmen were arrested and, as heavy fire could still be heard ahead, Major Hollister pushed on with just two of his me", "n. We acclimatise with two nights in Namche before pushing o", "n. By now, both were very fatigued, but they both pushed o", "n. Pace yourself with a pause at a cafe, in a square or park, before pushing o", "n. They advanced some two to three miles to a roundabout Capt Cosby described as the gates of the city before pushing o", "n. The pair pushed on first to Lion-sur-Mer, then Hermanville-sur-Mer, before they set up their station in Cae", "n. It would be a lovely journey, so people kept pushing o", "n. Synonymscontinue one's journey, continue on one's way, carry on, advance, press on, progress, make progress, proceed, go on, make headway, gain ground, push forward, forge ahead, go aheadpush something throughGet a proposed measure completed or accepted quickly. the government is trying to push through a package of measures to combat organized crime Example sentencesExamples Local authorities are creating problems for themselves in trying to push such ventures through so quickly. More than 100 of the party's MPs have signed motions criticising the government's plans and he faces a bruising battle to push the measure through the Commons. The company strategy is about teamwork and pushing good ideas through the system as quickly as possible, with superior dedication from all divisions within the company. Surely a chicane system should be considered before the proposed measures are pushed through. Abbott's package was the government's third attempt in a year to push its measures through parliament. In part, school-to-work manifests itself as a desire to push students through universities and colleges quickly, to train rather than educate them. If justice can be done, I have no objections - and provided the defence have got time to prepare a proper defence and the cases are not pushed through too quickly. She's really focussed on looking outwards rather than inward and she's prepared to push innovative measures through the Scottish parliament. But in the years ahead, as the fiscal squeeze tightens, the sense that some politicians took advantage of our trauma to push this measure through will not help our new-found sense of national unity. Indeed, these laws have been pushed through as silently and quickly as possible precisely so as to avoid such a discussio", "n.OriginMiddle English (as a verb): from Old French pousser, from Latin pulsare 'to push, beat, pulse' (see pulse1). The early sense was 'exert force on', giving rise later to 'make a strenuous effort, endeavour'.appeal from Middle English:Recorded first in legal contexts, appeal comes via Old French from Latin appellare ‘to address, accost, call upon’. Peal (Late Middle English) is a shortening of appeal, perhaps from the call to prayers of a ringing bell. The base of appeal is Latin pellere ‘to drive’, found ", "also in compel ‘drive together’; dispel ‘drive apart’; expel ‘drive out’; impel ‘drive towards’; and impulsive; propel ‘drive forwards’; repel ‘drive back’, all Late Middle English. It is ", "also the source of the pulse (Middle English) that you can feel on your wrist and is related to push (Middle English). The other kind of pulse, an edible seed, is a different word, which comes via Old French from Latin puls ‘porridge of meal or pulse’, related to the sources of both pollen and powder.RhymesHindu Kush, kurus, mush, whoosh, woosh bellverb.1 phr. phr.", "v.Definition of push in US English: push verbpʊʃpo͝oSH1with object, usually with adverbial Exert force on (someone or something), typically with one's hand, in order to move them away from oneself or the origin of the force. she pushed her glass toward himwith object and complement Lydia pushed the door shutno object he pushed at the skylight, but it wouldn't budge Example sentencesExamples He felt sunshine on his face, but it was quickly torn away from him as a sack was ruthlessly shoved onto his head and he was pushed away. Another woman budded in, pushing her way in front of the group. The winds pressed against my back and forced me upright, pushed me toward the side yard, then into the front. Being the chivalrous idiot that I am, I kept pushing the person in front up, and the inevitable happened. With his leg Marcus pushed one of the boys off of him and then he took his arm and hit the other boy. The guard announced, gently pushing the boy in front of him. Ryo stood to walk out of the house, but Kunshi moved toward him and pushed him back into a seat. The boy who had pushed Jaime earlier was now walking with Gwion, gesturing wildly as his voice rose to new heights. In one case the workers were pushed away by federal and military police squads. Akasha and Jessie were able to get threw because a large boy in front of them was pushing people out the way. Then the mass of boys began pushing Hyrum down the street. When he was about to take Winston's hand I found myself blocking the way, gently pushing the distressed little boy behind me. I started pushing the people in front of me to get in the front ", "also. Immediately she was pushed away and the ground would have cushion her fall except that would have hurt, but she was cushion by a warm body instead. Lora, who was well under four feet tall, easily pushed the larger boy away and slipped into the room without a sound. Embarassedly Kris pushed the older boy away, and tried to hide his blush. Rira managed to get in front of me and pushed the girl out of the way. I slam the brakes and the force of the car pushes us toward the windshield. He sat up, pushing the younger boy up as well, as he reached over to the table and grabbed a textbook. She said in exasperation, pushing her way in front of them once agai", "n. Synonymsshove, thrust, propel, impel1.1with object Hold and exert force on (something) so as to cause it to move along in front of one. a woman was pushing a stroller Example sentencesExamples she asked, helping me into the wheelchair as she pushed the cart in front of me. ‘He started running away pushing the pushchair in front of him,’ said Mr Butterworth. Gasping for air, I scramble towards the raft and, with my four bobbing companions, swim to the safety of the shore pushing the raft in front of us. Two young mums pushing their children in front of them walk along the narrow pavement by the pub as we stand watching the traffic. A few months ago, I was walking down the main street in my home town when two women in front, pushing their children in strollers, stopped dead on the pavement and started talking. After a couple, you'll be ready to emulate Byron, who liked to swim across the Grand Canal pushing a candle in front of him. And wisely, unlike so many of her opponents, she had elected not to run with that stall on her back or push it in front of her on a trolley. As everyone looked to the door, a plump nurse appeared around the curtain pushing a cart in front of her. She glared and started pushing her cart in front of mine. I made my way around one defense man but skating between them and pushing the puck in front of me.1.2 Move one's body or a part of it into a specified position, especially forcefully or with effort. she pushed her hands into her pockets Example sentencesExamples How is hands slowly would grip my hips as we pushed our ever decaying bodies closer to each other as the night died young. He gently began pushing himself against her body, she frightful that he might fall on top of her. After a moment or two to focus his effort, he pushed himself away from the wall. She drew close to him and pushed herself against his body, wrapping her arms around him. I ease myself quietly from the entanglement of his body and push myself up into a sitting positio", "n. Bend your elbows so that your arms are at 90 degrees to your body, then push back up to the start positio", "n. When you push yourself, your body makes endorphins which give you a natural high. She used what body parts she could to push herself into sitting positio", "n. It is a strong move in which you are pushing your lower body down into the ground and using the ground to enhance your resistance and stability. His brown eyes lingered on her body, as she pushed herself against him. She pushed herself against his body, against his chest where there was no heartbeat. So he pushed himself in an effort to get better every day, so he could start and be prepared for that first game. I pushed his nearly limp body up to a sitting position and got up from the couch. James grinned and pushed himself from his position with the muscles in his back. Stand up slowly to a straight leg position, then push yourself on to your toes.1.3with object Press (a part of a machine or other device) he pushed the button for the twentieth floor Example sentencesExamples Over the next few hours, I experiment with pushing the little attendant button occasionally to see if anyone cares, but they don't. She pushed a small blue button on the side of the device, and it lit up. Then I discovered I could keep my left leg elevated, whilst pushing the sewing machine pedal with my right foot. The size of a watch, the DRS device is activated by pushing the Panic Button or when the device senses you haven't moved around in a while. When everything was frozen in place again, he pushed the Unpause butto", "n. He picked up the cell phone and turned it around, pushing a small gray button at the back which opened up a slot for the tape. He picks up the presentation/computer remote and pushes the top left butto", "n. Staff activate the alarms by pushing an easily accessible butto", "n. She pushes the down button on the one next to it, hoping it would hurry up. Cameron knelt down quickly, pushing one more butto", "n. They have reached the elevator and he pushes the down butto", "n. Ally took the keys and pushed the unlock button on the keyless entry remote. By pushing a few ATM buttons, they can transfer their cash directly into Citibank vaults. They were instructed to quickly push one of two buttons depending on the arrow's directio", "n. ‘I want to hear,’ she said, pushing the small black button on the phone's cradle. They walked silently to the elevator and Bridget pushed the down butto", "n. She dementedly begins cackling as she pulls out an antenna and pushes a big red butto", "n. The man in the coat turned around to his desk, pushing a big red butto", "n. After pushing the last button a soft breeze washed over everyone and they all turned around to find its source. He laughed pushing the up button and the elevator doors swung ope", "n. Synonymspress, press down, push down, depress, exert pressure on, bear down on, hold down, squeeze1.4with adverbial Cause to reach a particular level or state. the political chaos could push the country into recession they expect that the huge crop will push down prices2no object, with adverbial Move forward by using force to pass people or cause them to move aside. she pushed her way through the crowded streets he pushed past an old woman in his haste Example sentencesExamples shouted the boy suddenly, pushing the two ladies out of the way. After pushing past him they passed through the curtains and suddenly were in a big, warmly lit room. The security forces were aggressive, pushing forward until an elderly demonstrator suffered a heart attack. At once, the torch end erupted into flame, and he began to move forward, pushing roughly through the crowd. ‘Oh Sam, stop being such a drama queen,’ Bryant rolled his eyes and moved to push past her to step into the house. Forward ranks pushed back, darting past the elite guards at their backs as they fled for their own lines. To chat to him your options are to push aside young, excited children, or rush to an enclosed area such as the corridor of staff toilets. He motioned for me to stay, then walked forward, pushed past his father and stepped into the study. I even had to push aside a few nurses and their flag-waving kiddies because the protest moved too slowly and the market was nearly closing. Her male colleague approached and took hold of the defendant's arm but was hit in the arm and the other officer was pushed away, she said. Mark jumped aside as Grace pushed past him and made a watch out kind of whistle. The soldier in the front, the one who I had cut, growled in rage as I passed and tried to push past Rama", "n. With more and more force, he pushed aside anyone that stood in his way, with his hands and soon with his blade. Teran made a move to push past Hayato, but found him unmoving. Mihra moved, pushing past him, making for the entrance in the rock through which her guide had disappeared. Then Sally was racing forward, pushing past the others, and diving head-first into the murky water. Synonymsforce, force one's way, shove, thrust, squeeze, jostle, elbow, shoulder2.1 (of an army) advance over territory. the guerrillas have pushed south to within 100 miles of the capital Example sentencesExamples It was now October 1917 and the Allied advance pushed towards a feature known as Broodseinde Ridge. All of the vehicles push through the kill zone as quickly as possible, advancing approximately 300 meters. Ayutthaya pushed into Khmer territory and sacked the capital of Angkor. With our nation at war, the Army is pushing toward more rapid, immediately relevant change in the Current and Future Force. It is a third of the way to their destination, and the US army's 3rd Infantry Division is already pushing towards the city from further north. As the Elf army pushed forward, a sea of blood, bodies and gore was left behind. With the enemy reception proving nothing like they had anticipated, troops pushed inland. By August 1944, the U.S. VI Corps landed in the south of France and began pushing to the northeast, Prieur said. In January 1945 Montgomery's forces pushed forward to the Rhine. Israeli armour and infantry pushed into Jordan capturing the West Bank, deep into Sinai up to the Suez Canal and into the Golan Heights in Syria. Troops of the 101st, pushing deeper into Najaf, are greeted by cheering crowds. Thereafter, Twenty-first Army Group pushed steadily towards the Rhine. In the late autumn of 1950, UN forces pushed forward up the peninsula towards the Chinese border. As the Union army pushed into the South, a young soldier from the south, but committed to the Union cause, was assigned guard duty. In 1941 Germany pushed deep into Soviet territory, when the Soviet air-force hit back. The Huddersfield Second Battalion, and the rest of the Regiment, were pushing down to the south in the next phase of attack. The war began when colonists from Massachusetts Bay began pushing into territory claimed by these people. We must not weaken as we strike again and again, probing and pushing to exploit the enemy's vulnerabilities. Right now, they were pushing through enemy territory in France. Gaede's Army Detachment pushed forward into the French lines near Obersept on the 13th of February.2.2 Exert oneself to attain something or surpass others. I was pushing hard until about 10 laps from the finish Example sentencesExamples With Montrose pushing hard for an equaliser and Peterhead admirably trying to double their tally, it was no surprise when the home side struck on the break after 75 minutes. We were pushing hard to include the costs of the road-over-rail but the Government said it didn't want it to be included. The event, 54 holes of it anyway, was played on the Torrey Pines course near San Diego, which is pushing hard for a US Open in 2008. He really wanted this and has been pushing hard for it. He spent the lead-up to the G8 summit pushing hard for a deal on climate change, yet this deal caught Downing Street completely by surprise. I made a clean start from pole and was pushing really hard until the first pitstop when I saw how big the gap actually was. Will he be pushing hard for hate crimes legislation? The former young driver of the year finalist still has an outside chance of the Irish title this season and will be pushing hard to continue his winning ways on home soil. They're pushing very hard for a conviction for murder. Currently, the group is pushing hard to become highly cost efficient and has entered into processing arrangements with Gambia in order to create a highly competitive base. When there's no nation pushing hard, the UN drifts like a beachball. It is the one he is pushing hardest, although he admits that no possible reorganization can keep up the current levels of service. After that the car was so consistent the whole race that I was really able to push hard, until the last 15 laps. What they don't want is to lose their jobs and educational opportunities by pushing too hard at the restrictions their government has placed on their ability to speak. Coelho, who turned down an interview request, saying it might jeopardise his chance of election, has always rejected such assessments and is pushing hard for recognitio", "n. With billions of dollars in foreign aid at stake, the United Nations, sponsors of the talks, were pushing hard for a conclusion yesterday. The fact that lots of Wall Streeters will get rich racking up fees on these tiny accounts only serves to show why they're pushing so hard for it. We're pushing very hard to get that to happen as soon as possible. Six months ago they cautioned against being too aggressive on the corporate scandals; now they censure Democrats for not pushing harder. A dancer is always trying to tough it out a little longer, hoping to earn a few more bucks, pushing just a little harder. Synonymsstrive, struggle, endeavour, work, try hard, make every effort, do one's best, do one's utmost, do all one can, give one's all, give it one's all, give something one's all, go all out, fight, be at pains, put oneself out, apply oneself, exert oneself2.3be pushinginformalBe nearly (a particular age) she must be pushing forty, but she's still a good looker Example sentencesExamples I'm pushing forty, though forty seems to be doing most of the pushing. I was surprised to find out, however, that the boys are actually a bit older than myself (I'm pushing fifty). Synonymsroughly, about, around, just about, round about, or so, or thereabouts, more or less, in the neighbourhood of, in the region of, in the area of, in the vicinity of, of the order of, something like, give or take, give or take a few, in round numbers, rounded down, rounded up3with object Compel or urge (someone) to do something, especially to work hard. she believed he was pushing their daughter too hard Example sentencesExamples He was only 6 then, and I felt they were just pushing the kids too hard. All of a sudden the public want journalists to get the truth out of him, and the public backs them when they push Howard hard. The need for Ottawa to push the U.S. harder to reopen the border to live cattle is a common refrain from producers across the country. Gus pushes me hard to not just automatically do everything the accepted way. Parents who push their children hard always focus on examples they like, successes such as Lang and Ding. Years of tests have pushed him hard physically and mentally. Do you think the government is trying to push voters even harder than it's pushed them already? An unnamable urge was pushing me to drive harder, and for once, I didn't struggle to put words around it. Although she didn't do anything sporty, she always wants to do her job well and she pushed us quite hard to get the potential out of us. I've been pushing her too hard, asking too much of her. On the subject of fitness, Black rejected Dawson's claims that Henry had pushed the players too hard. Tiburce always believed in me, and always pushed me to work hard. Michael's father was a military man with a strong sense of order, and he pushed his sons hard in athletics. The problem with that is that if you push a witness too hard too fast, they are going to take the Fifth Amendment or tell you to walk away. They were pushing me so hard I presumed I must have been in the top three. I only remember one teacher pushing me to work harder on my academic pursuits. But I have to say if he was available for Northern Ireland, I would be pushing him very hard. Afraid of losing a big customer, Mo didn't push him too hard. That's why we'll push him hard to come around to the beliefs that mean the most to us. Significantly, she left her job as a schools coach amid allegations that she pushed the kids too hard. Synonymsassertive, thrusting, pushing, ambitious, driven, aggressive, forceful, forward, obtrusive, bold, brash, bumptious, arrogant, officious, bossy, presumptuous, full of oneself, self-assertive, overbearing, domineering, confident, overconfident, cocksureurge, press, pressure, put pressure on, pressurize, force, drive, impel, coerce, nagassertive, thrusting, pushy, ambitious, aggressive, forceful, forward, obtrusive, bold, brash, bumptious, arrogant, officious, bossy, presumptuous, full of oneself, self-assertive, over-assertive, overbearing, domineering, confident, overconfident, cocksure3.1push for Demand persistently. the council continued to push for the better management of water resources Example sentencesExamples Unions and safety campaigners have been pushing for the law to be extended. Mrs Beatty has contacted the town council to help her push for more road safety improvements. York are pushing for the second promotion place after they sealed Poppleton's relegatio", "n. I will continue to push for policies that put ordinary members first and fight for a rank and file strategy. The Green Party will continue to push for more attractive alternatives to the car and lorry. We ", "also work with housing associations and will push for families to be evicted if they continue to misbehave. Campaigners at the school are still pushing for the decision to be halted until more information can be given to the members. Consumer campaigners have been pushing for a Europe-wide clothing size scale in a bid to make shopping easier. Some union chiefs are pushing for campaigns focusing on how families will be affected. They must now regroup and continue their push for promotion to the senior ranks. Their fall from grace appears to have levelled off and they are now pushing for promotion and ultimately a return to the top. He is the one who pushed for campaign spending limits in this race; he rather insisted on them. There have been calls for the council to try to push for a second railway station in the Swindon area. She was the founder and former director of both the Center for Responsive Politics, which tracks electoral spending, and Public Campaign, which pushes for campaign finance reform. Any campaign pushing for a name change has to begin with our own media, officials and the people on the street. That party will continue to push for a softening of the law around cannabis. He said the campaign group was still pushing for more controls on the manufacture and sale of fireworks. Green campaigners are pushing for recycling facilities in Thundersley to be given an upgrade. So we should welcome and push for a leadership election campaign as soon as it's feasible. They have a successful side pushing for promotion from the Third Divisio", "n. Synonymsdemand, insist on, clamour for, ask for, call for, request, press for, campaign for, work for, lobby for, speak for, drum up support for, sponsor, urge, promote, advocate, recommend, champion, espouse3.2be pushedinformalHave very little of something, especially time. I'm a bit pushed for time at the moment4informal with object Promote the use, sale, or acceptance of. the company is pushing a $500 asking price Example sentencesExamples Global sales have pushed Hyundai to seventh place, ahead of both Honda and Nissa", "n. Froggatt has been using some of the cost savings to invest in a series of marketing campaigns, which appears to be pushing up profits and sales of some of S&amp;N's core brands. Strong memory sales helped push AMD to a solid second quarter, the company reported today. Nevertheless, he mentioned that promotion activities that usually push up the sales figures had been stopped because of the strike. He's pushed the Yell sale - which has been in limbo for years. I know America keeps pushing Europe to accept Turkey. Public sympathy pushed the Sorbonne to promote her to her dead husband's professorship. Dr Dorothy Faulkner, an expert in the social and intellectual development of children, says that publicity about bad forms of play could be pushing up traditional toy sales. One upcoming promotion will push the redesigned CNN Headline News to the local ad sales community. He thinks Sindi pushed Stuart into accepting and that he only said yes because he doesn't really trust her. Synonymsadvertise, publicize, promote, give publicity to, bang the drum for, beat the drum for, popularize4.1 Sell (a narcotic drug) illegally. Example sentencesExamples Their example has fostered the establishment of another woman to pushing drugs in another area and to prosper. Ah, the shadowy evil dealer, pushing drugs outside the school gate. We want to know who, what, where, when and if possible, how they know someone is pushing drugs. As a result she ended up in the law courts for pushing drugs via her ever-popular soups and casseroles. Users should not be jailed, unless they were pushing others into the habit. While he adapts himself to life in the slums, he ", "also finds out there is money to be made in black-marketing false passports, pushing drugs and doing countless other small jobs. Once cannabis is legalised, the dealers will be taken out of the equation and the risk of them pushing harder drugs and the availability of harder drugs to the cannabis smoker is eliminated. But Shadow Home Secretary Ann Widdecombe said legalising cannabis would lead drug barons to push even more hard drugs. Police today declared war on drug dealers from London pushing cocaine, heroin and crack to children as young as 13. One kind of crime the former drugs squad officer is determined to come down on heavily, he warned, is the pushing of illegal drugs. Since they can't keep him in the designer sneakers he wants, young Marcus starts pushing drugs himself. Police sources said he had been arrested for pushing drugs. Side-effects and unforeseen deaths are part of the deal when you're pushing drugs. Cllr Wright said he was not an informer, but where drugs were concerned, he would have no problem informing on those pushing, selling and taking drugs. Of these junk messages, half are pushing drugs, a fifth promote porn and another fifth promote cheap software. They lie, rob, cheat, push hard drugs, intimidate innocent people and run protection rackets. Synonymssell, put on sale, put up for sale, offer for sale, vend, retail, trade in, deal in, traffic in, peddle, hawk, advertise5Computing with object Prepare (a stack) to receive a piece of data on the top.5.1 Transfer (data) to the top of a stack.6Photography with object Develop (a film) so as to compensate for deliberate underexposure.nounpʊʃpo͝oSH1An act of exerting force on someone or something in order to move them away from oneself. he closed the door with a push Example sentencesExamples Jess gave the door a slight push and it swung ope", "n. She sees the skin of her hand and pushes Neil out the door, ending the seduction for now. If it means more critics or voters seeing films in the theater, it's a terrific outcome, even if the push behind the move is incredibly faulty. Then he tried to push Alice away gently trying not to hurt her bruises from the previous night but she wouldn't move with his gentle push. With a gentle push from another locomotive from behind, Flying Scotsman broke through a banner declaring Railfest open to the sound of the City of York Pipe Band. There is a push now to move the drugs over the counter. I pushed the handle down and gave a gentle push upon the door. Not so much as a push - absolutely no physical contact - just words. Mark said, giving her a small push through the door and closing it behind her. Just push open the door and walk straight up to the bar. The corporation is fighting a push by creditors to move the former energy trading giant's bankruptcy case from New York to its hometown of Housto", "n. Michaels shoved me into the backseat with a harsh push and slammed the door in my face, and I realized it has been a while since a cop has done that to me. There was a push, a punch and another blow then a complaint to the police. The move follows a government push to recruit 3,000 matrons across the country as part of a major plan for the National Health Service. The move is the latest push by baseball to increase its marketing to younger fans - and make money along the way. Instead, though, I gave Anna a little push, and they moved sideways to the locker beside me. The Chinese are reportedly already a slight majority but new plans indicate a big push to move more settlers i", "n. He patted me on the back and gave me a slight push to the door as if I should do it right now. Finally I gave him a push and slammed the door in front of his face. Spitz looked back at the wisecracking Kai and with a little push, Kai was knocked out agai", "n. Synonymsshove, thrust, ram, bump, knock, hit, jolt, butt, prod, poke, elbow, nudge, shoulder, jostle1.1 An act of pressing a part of a machine or device. the door locks at the push of a button Example sentencesExamples In just 20 seconds, the fully automatic, insulated roof retracts at the push of a button - and back again should the weather tur", "n. The air-taxi service's telephone number, programmed into Len's sat phone, is no more than the push of a memory button away. Then, with the push of a button, I erased the number from memory. Printing great quality images is now possible directly from the Gallery with just a few pushes of a butto", "n. The work suggests a metal contraption, perhaps an explosive device that could be detonated with a push of the beige butto", "n. This is handy, but the machine does not remove them with a push of the button - you have to do the prewash treatment yourself. You can make tactical heads-up navigational displays for your vehicles with the push of a butto", "n. The push of a button should reconnect power automatically when power is restored. The electric beds, which can be raised and lowered at the push of a button, will help give patients more control and independence. And then, with a push of a single button, the drink will be concocted before his very eyes within a matter of seconds. With the push of a button, the narrow barrel of his device glowed and a beam of light issued from where blasts usually came. The rest push completely into the device and are ejected with a small eject button to the right of the slot. The sound can usually be turned off by a button push. Two short pushes of a button enable the operator to direct the system manually, and zoom in on the strange object, which has almost vanished between the waves. The computer is turned on by a long push of either butto", "n. With the push of a button the hatch swung open immediately reducing the million pigeons to just under a million with a wet feathery splat. With a single push of a button, you can replay the last incoming transmission and up to 16 messages. They had an automatic phone fitted in his office, preprogrammed to enable him to reach other numbers at the push of a single butto", "n. Go from the acoustic response of a baroque concert hall to that of a 10,000-seat arena or a gothic cathedral with the push of a butto", "n. Information is limited to only that which is host often used and is accessible with only a few pushes of the butto", "n.1.2 Something that encourages or assists something else. the fall in prices was given a push by official policy2A vigorous effort to do or obtain something. many clubs are joining in the fund-raising push he determined to make one last push for success Example sentencesExamples This push into music is the start of a daring effort to reinvent one of the world's best-known brands. Tindal Street Press gives the genre a push onto the bookshelves. The Yorkshire Dales National Park Authority is revitalising its network of information points and is urging local shops, pubs and cafes to join in the promotion push. They were amazing during our promotion push last seaso", "n. The Lartigue Monorail Restoration project has started its final fundraising push at a special press briefing in Listowel. He says the decision would ", "also complement the current push to regulate the labour hire industry and ensure employers did not use labour hire to undercut the award system. It attributes this growth to more affluent online shoppers, an ecommerce push by traditional retailers and the aggressive promotion of online stores. As reported in Monday's Evening Press, York Police have launched a new push to remove beggars from York's streets. Nevertheless, the triumph gave York their first double of the league campaign and it could yet prove crucial in both side's promotion pushes. The push into the enterprise space makes sense. Jerry Gill is already looking forward to a promotion push with Cheltenham next season as he reckons their young bucks will be even better next term. He noted that the TV station's ratings have responded to recent programming changes, and a strong push of promotion will help even more. In an effort to maintain the push, Operation Impact has forged a partnership with Crimestoppers. So was the long push to get the case before a jury worth the effort? The company's ambitious push to drive the brand upmarket risks hurting its existing premium marque, Audi. A series of events is ", "also planned as part of the fund-raising push. The visitors were denied a third goal on 69 minutes when Sills crashed a powerful volley into the roof of the net but his effort was ruled out for an innocuous push. That it continues to provide solace to readers long after the initial marketing push. The weekend's traffic effort from the Gardai was part of a national push to clamp down on dangerous and drunken driving. However, over the last month the manager has noticed a marked improvement in their standards and he now believes that his side are ready to embark on a serious promotion push. It's part of a fundraising push that will ", "also see an internationally renowned pianist play the £11,000 grand piano at Swindon's New College. The nonpartisan effort, sponsored by a coalition of local groups, pushes registration at venues such as clubs and restaurants. A leading campaigner in the push to reopen Rochdale Canal has called on Rochdale Council to act swiftly to create a boatyard in Littleborough. Synonymsendeavour, striving, effort, exertion, labour, work, toiling, pains2.1 A military attack in force. the army was engaged in a push against guerrilla strongholds Example sentencesExamples American forces then embarked on the long push to Tokyo. The Allied forces co-ordinated a major push from the spring and, in April, the British pushed forward in the battle of Arras. The Marines need a divisional push to seize Fallujah and they don't have the me", "n. A Communist push from the highlands to the sea to cut South Vietnam in half and isolate Saigon appeared in the offing. The allies had concentrated the bulk of their troops to the north in advance of the push towards Germany, and this had left the US forces at the Ardennes thinly spread. The push to downsize the military and privatize functions means government contracts are a growth industry. The push of the main group of forces should be directed at exploiting success and thwarting the enemy's attempts to restore its defenses. Once Morocco was secure, it served as a major base for U.S. bombers and as a logistics center for the push toward Tunisia and Sicily. It was too easy for some units we saw to take a final break before the big push into Iraq. The Biafran army then went on the offensive in a push towards Lagos. Now, all this comes on the heels of what was the deadliest attack here since the they ended their push, their offensive near the coast. The re-election of the president is expected to be followed in short order by a massive US military push into the desert city. The Pentagon is making a serious push to pull US forces out of Balkans altogether. It is the latest U.S. military push against the insurgency. He was convinced that a major US military push into Najaf was not far away. We hit the targets at night in a final push against the terrorist's stronghold near the airport. Now, these attacks come, as you say, amid day three of the military's latest push against insurgents in the western desert. With the rapid push to Baghdad, our mission changed often, as did the CSB's task organizatio", "n. In Iraq, the military has launched another push against insurgents in the region where the rebellion continues to rage. Despite the military push, a rocket which was fired from Gaza landed in an open area of Israel's Negev Desert overnight, causing no damage or injuries. Synonymsadvance, drive, thrust, charge, attack, assault, onslaught, onrush, offensive, sortie, foray, raid, sally, invasion, incursion, blitz, campaign2.2 Forcefulness and enterprise. an investor with the necessary money and push Example sentencesExamples These men, who ‘do not let the grass grow under their feet’, are clearly all push and enterprise. Synonymsdrive, initiative, enterprise, enthusiasm, eagerness, ambition, motivation, go, dynamism, energy, gusto, vigour, vitality, verve, fire, fervourPhrasesget the push (or shove)1informal Be dismissed from a job. four PR people are getting the push Example sentencesExamples What does John Tamihere have to do to get the push from Labour? Yet the committee-bound European elite, with their ludicrous consensus-based politicking, will almost assuredly be unable to muster up the courage to give him the push. This was compounded further when Ronnie Burns was given the shove, and headed to Adelaide to join national uber scapegoat-in-the-making Wayne Carey. ‘You've done as much as you can with the paper,’ declared Ken Cowley, the News Corp managing director, when he gave me the shove. When Colonel Lourake came to visit me here, he gave me the push. Eisner's position is not all that secure, and if his going was the difference between the renewal of the Pixar deal, or the loss of the Pixar deal, then conceivably the board might give him the shove. John Smith, the £205,000 a year chief executive of the Post Office, is getting the push for not being ruthless enough. The luminescent bruises on that aggrieved ego are so obvious, the Professor can't help wondering if the column was penned within minutes of Farmer Phil learning that he was set to get the shove. They want pointy end fighters, and that is why DC got the shove from McLaren, and why I think Sir Frank Williams will give him the cold shoulder too. If he cannot back up such madness, and there isn't a hope in hell he will be able to, then Ladbrokes have to give him the shove. Synonymsthrow out, remove, eject, expel, turn out, turf out, fling out, force out, drive out, evict, dislodge, oust1.1Be rejected in a relationship. Example sentencesExamples I just hoped Rebecca wouldn't give him the shove, like she does with most of the guys that showed interest in her. As Gloria, his fiancée of five years who gets the push, Jessica Walker is a perfect screech, with a classic mother to match in Carol Wilso", "n.give someone the push (or shove)1informal Dismiss someone from a job. it's hard to psych yourself up to get another job after you've been given the push1.1End a relationship with someone.push one's luckinformal Take a risk on the assumption that one will continue to be successful or in favor. Example sentencesExamples On the other hand, you are pushing your luck if you try to pull off heroic endurance feats every day. The wild cards afford you the luxury of being able to push your luck with no risk. He was basically pushing his luck, but seemed unaware of it. Sure it was a risk to be pushing his luck so soon, but he was having a great time with Krystal and dreaded the fact that their evening would be coming to an end. As Brendan was leaving the church, and by this time definitely pushing his luck, he spoke to the priest who had officiated at the service. Those girls pushed their luck though when they suggested we might feel more comfortable someplace quieter. ‘You could be great, along with my help,’ he continued, pushing his luck. Your parents have agreed to let you go for the party, don't push your luck by asking them to let you stay late. He must always be out there, pushing his luck, trying new things, taking a carefully calculated risk. The tradition ended abruptly when he pushed his luck too far and alienated the avowedly nationalist group by telling them that they must support the principles of unionism.when push comes to shoveinformal When one must commit oneself to an action or decisio", "n. when push came to shove, I always stood up for him Example sentencesExamples Is it possible you're totally wrong about North Korea, that the country is in such terrible shape that when push comes to shove, its military is going to turn out to be in just that kind of shape as well? But I think, when push comes to shove, he'll be there with us. The good characters are decidedly saintly, and the bad guys aren't really all that bad when push comes to shove. But when push comes to shove, my greatest enjoyment can be summed up in one word: shopping. But, two, I think it really helped when push comes to shove. But when push comes to shove, he sold out to preserve his place in the party, and all for a man whose campaign attacked his family to score political points only 4 years ago. I think when push comes to shove, the young people of the United States will react the same as generations before them. While we'll work as a team, ultimately, when push comes to shove, Michael will have the final say. They sometimes say they are, but in fact when push comes to shove, they are no more interested in the weaker clubs than they are in clubs that are not in Victoria. But again, I've got to think when push comes to shove, he won't do it. Synonymseventually, in the end, in the long run, at length, finally, sooner or later, in time, in the fullness of time, after some time, in the final analysis, when all is said and done, one day, some day, sometime, at last, at long lastPhrasal Verbspush aheadProceed with or continue a course of action or policy. he promised to push ahead with economic reform Example sentencesExamples Instead of pushing ahead with a compulsory scheme in the short term, the Government will introduce draft legislation in the Queen's speech this month as the first step towards a voluntary system. Coca-Cola continues to push ahead with the establishment of more local bottling plants. He said that it was important to establish a new use for the site quickly, but this would not inhibit the council from pushing ahead with plans to help the 260 Thrall workers find new jobs. As for the future, En Foco will continue to push ahead with more emphasis on the journal. The county council is pushing ahead with plans to introduce by-laws increasing the speed limit on its section of the same road from 80 kmph to 100 kmph. Now the Food Standards Agency Scotland is pushing ahead with legislation that will force manufacturers to disclose any traces of the most dangerous dozen ingredients of food. But with China pushing ahead with development on its side, and near the border, Japan worries that the resources on its side will be affected. Since then the Town has continued to push ahead with the project on its ow", "n. The Scottish Executive, however, attracted the bulk of criticism for increasing stress on teachers by pushing ahead with a policy of reducing the number of pupils being excluded from school. She questioned the wisdom of the U.S. pushing ahead with a programme for which there is little or no scientific basis that it will be successful and which would be astronomically expensive.push alongGo away; dep", "art.push someone around (or about)Treat someone roughly or inconsiderately. Example sentencesExamples It appears that perhaps unconsciously you are attracting partners who push you around and treat you badly because at a deeper level you may still carry negative belief patterns from your childhood. Maura pushed her around, Dinah had pushed her around, Chase pushed her around, everyone pushed her around, but Piper was going to stand up her decision this time. You must hold your head up high and not allow those bullies to push you around. Sing along, now dad, dad, why did you let that man push you around like that? Nobody is pushing us around or has ever pushed us around on West Indian wickets. Nobody has succeeded in pushing me around before and now I'm even freer and in a better position to do my best for Bradley ward and Nelso", "n. Everyone pushes us around, but the minute we get just a little bit of power, we exercise it to the fullest without prudence or thoughts on what it is doing to us in the bigger picture. It means that part of what you should develop about your life is not letting people push you around. All those years he made fun of me, bullied me, pushed me around, I think that it was his cry for help. They are going to push you around as much as a big corporate client. Synonymsbully, domineer, boss about, boss around, ride roughshod over, trample on, tread on, bulldoze, abuse, mistreat, maltreat, kick about, kick around, browbeat, lean on, tyrannize, intimidate, threaten, torment, terrorize, victimize, pick onpush offUse an oar, boathook, etc., to exert pressure so as to move a boat out from shore or away from another vessel. Example sentencesExamples But when he tried to push off the block to get moving again, the block slid across the floor too. Finally, it did, and though the orders that followed were to return to ship, a squall blew up and the boats could not push off. Once in the boat she ‘gets possession of an oar’ and pushes off. She too had got possession of an oar, and had pushed off, so as to release the boat from the overhanging window-frame. Shapovalov pushes off for Ukraine in the men's four repechage. The water was shallow enough, and the bottom varied enough, that they often touched up against a rock of bit of sandbar, and when they did, they reacted instantly, pushing off against it to move laterally. He helped me into the boat, then pushed off and jumped in himself. Come right up to the bank to let her out, push off and be back again as soon as she was. Push the ball behind your back toward your left hand as you push off your right foot to start moving to your left. They pushed off the shore, rowing through the ice of the wide Delaware.push onContinue on a journey. the light was already fading, but she pushed on Example sentencesExamples By now, both were very fatigued, but they both pushed o", "n. Pace yourself with a pause at a cafe, in a square or park, before pushing o", "n. After a week and a half of catching up on sleep and drinking enough wine to prop up the economy, we begin thinking about pushing on to the island of Faial. Two gunmen were arrested and, as heavy fire could still be heard ahead, Major Hollister pushed on with just two of his me", "n. They advanced some two to three miles to a roundabout Capt Cosby described as the gates of the city before pushing o", "n. It would be a lovely journey, so people kept pushing o", "n. The pair pushed on first to Lion-sur-Mer, then Hermanville-sur-Mer, before they set up their station in Cae", "n. We acclimatise with two nights in Namche before pushing o", "n. The middle westerner pushes on, endures, and finally finds a place that looks like home. A short photo stop soon cooled us down, before we pushed on up the hill carrying the weighty bags of tackle and camera gear. Synonymscontinue one's journey, continue on one's way, carry on, advance, press on, progress, make progress, proceed, go on, make headway, gain ground, push forward, forge ahead, go aheadpush something throughGet a proposed measure completed or accepted quickly. Example sentencesExamples If justice can be done, I have no objections - and provided the defence have got time to prepare a proper defence and the cases are not pushed through too quickly. Abbott's package was the government's third attempt in a year to push its measures through parliament. Indeed, these laws have been pushed through as silently and quickly as possible precisely so as to avoid such a discussio", "n. She's really focussed on looking outwards rather than inward and she's prepared to push innovative measures through the Scottish parliament. The company strategy is about teamwork and pushing good ideas through the system as quickly as possible, with superior dedication from all divisions within the company. But in the years ahead, as the fiscal squeeze tightens, the sense that some politicians took advantage of our trauma to push this measure through will not help our new-found sense of national unity. Surely a chicane system should be considered before the proposed measures are pushed through. In part, school-to-work manifests itself as a desire to push students through universities and colleges quickly, to train rather than educate them. Local authorities are creating problems for themselves in trying to push such ventures through so quickly. More than 100 of the party's MPs have signed motions criticising the government's plans and he faces a bruising battle to push the measure through the Commons.OriginMiddle English (as a verb): from Old French pousser, from Latin pulsare ‘to push, beat, pulse’ (see pulse). The early sense was ‘exert force on’, giving rise later to ‘make a strenuous effort, endeavor’.verb.1 phr. phr.", "v."]}, {"dict": "Oxford5000", "values": ["push someone around (or about)See pushDefinition of push in English: push verb pʊʃpʊʃ1with object, usually with adverbial Exert force on (someone or something) in order to move them away from oneself. she pushed her glass towards himwith object and complement Lydia pushed the door shutno object he pushed at the skylight, but it wouldn't budge Example sentencesExamples Immediately she was pushed away and the ground would have cushion her fall except that would have hurt, but she was cushion by a warm body instead. The boy who had pushed Jaime earlier was now walking with Gwion, gesturing wildly as his voice rose to new heights. The guard announced, gently pushing the boy in front of him. I slam the brakes and the force of the car pushes us toward the windshield. Another woman budded in, pushing her way in front of the group. Lora, who was well under four feet tall, easily pushed the larger boy away and slipped into the room without a sound. Then the mass of boys began pushing Hyrum down the street. He felt sunshine on his face, but it was quickly torn away from him as a sack was ruthlessly shoved onto his head and he was pushed away. The winds pressed against my back and forced me upright, pushed me toward the side yard, then into the front. She said in exasperation, pushing her way in front of them once agai", "n. Ryo stood to walk out of the house, but Kunshi moved toward him and pushed him back into a seat. Akasha and Jessie were able to get threw because a large boy in front of them was pushing people out the way. He sat up, pushing the younger boy up as well, as he reached over to the table and grabbed a textbook. Rira managed to get in front of me and pushed the girl out of the way. Being the chivalrous idiot that I am, I kept pushing the person in front up, and the inevitable happened. I started pushing the people in front of me to get in the front ", "also. In one case the workers were pushed away by federal and military police squads. With his leg Marcus pushed one of the boys off of him and then he took his arm and hit the other boy. Embarassedly Kris pushed the older boy away, and tried to hide his blush. When he was about to take Winston's hand I found myself blocking the way, gently pushing the distressed little boy behind me. Synonymsshove, thrust, propel, impelsend, press, drive, plunge, stick, force, shoot, ram, bump, knock, strike, hit, jolt, butt, prod, poke, nudge, elbow, shoulderbulldoze, sweep, jostle, bundle, hustle, hurry, rush, manhandle1.1 Hold and exert force on (something) so as to cause it to move in front of one. a woman was pushing a pram Example sentencesExamples A few months ago, I was walking down the main street in my home town when two women in front, pushing their children in strollers, stopped dead on the pavement and started talking. After a couple, you'll be ready to emulate Byron, who liked to swim across the Grand Canal pushing a candle in front of him. And wisely, unlike so many of her opponents, she had elected not to run with that stall on her back or push it in front of her on a trolley. She glared and started pushing her cart in front of mine. Two young mums pushing their children in front of them walk along the narrow pavement by the pub as we stand watching the traffic. she asked, helping me into the wheelchair as she pushed the cart in front of me. Gasping for air, I scramble towards the raft and, with my four bobbing companions, swim to the safety of the shore pushing the raft in front of us. I made my way around one defense man but skating between them and pushing the puck in front of me. ‘He started running away pushing the pushchair in front of him,’ said Mr Butterworth. As everyone looked to the door, a plump nurse appeared around the curtain pushing a cart in front of her.1.2with adverbial Move one's body or a part of it into a specified position with effort. she pushed her hands into her pockets Example sentencesExamples It is a strong move in which you are pushing your lower body down into the ground and using the ground to enhance your resistance and stability. She drew close to him and pushed herself against his body, wrapping her arms around him. I pushed his nearly limp body up to a sitting position and got up from the couch. His brown eyes lingered on her body, as she pushed herself against him. She pushed herself against his body, against his chest where there was no heartbeat. After a moment or two to focus his effort, he pushed himself away from the wall. I ease myself quietly from the entanglement of his body and push myself up into a sitting positio", "n. When you push yourself, your body makes endorphins which give you a natural high. Stand up slowly to a straight leg position, then push yourself on to your toes. James grinned and pushed himself from his position with the muscles in his back. So he pushed himself in an effort to get better every day, so he could start and be prepared for that first game. He gently began pushing himself against her body, she frightful that he might fall on top of her. She used what body parts she could to push herself into sitting positio", "n. How is hands slowly would grip my hips as we pushed our ever decaying bodies closer to each other as the night died young. Bend your elbows so that your arms are at 90 degrees to your body, then push back up to the start positio", "n.1.3 Press (a part of a machine or other device) the lift boy pushed the button for the twentieth floor Example sentencesExamples She dementedly begins cackling as she pulls out an antenna and pushes a big red butto", "n. ‘I want to hear,’ she said, pushing the small black button on the phone's cradle. He laughed pushing the up button and the elevator doors swung ope", "n. By pushing a few ATM buttons, they can transfer their cash directly into Citibank vaults. Then I discovered I could keep my left leg elevated, whilst pushing the sewing machine pedal with my right foot. She pushed a small blue button on the side of the device, and it lit up. When everything was frozen in place again, he pushed the Unpause butto", "n. Staff activate the alarms by pushing an easily accessible butto", "n. She pushes the down button on the one next to it, hoping it would hurry up. Ally took the keys and pushed the unlock button on the keyless entry remote. Over the next few hours, I experiment with pushing the little attendant button occasionally to see if anyone cares, but they don't. Cameron knelt down quickly, pushing one more butto", "n. The man in the coat turned around to his desk, pushing a big red butto", "n. They were instructed to quickly push one of two buttons depending on the arrow's directio", "n. He picked up the cell phone and turned it around, pushing a small gray button at the back which opened up a slot for the tape. They have reached the elevator and he pushes the down butto", "n. After pushing the last button a soft breeze washed over everyone and they all turned around to find its source. He picks up the presentation/computer remote and pushes the top left butto", "n. The size of a watch, the DRS device is activated by pushing the Panic Button or when the device senses you haven't moved around in a while. They walked silently to the elevator and Bridget pushed the down butto", "n. Synonymspress (down), push down, depress, exert pressure on, bear down on, hold down, squeezeoperate, activate, actuate1.4with adverbial Cause to reach a particular level or state. competition in the retail sector will push down prices the political chaos could push the country into recession2no object, with adverbial Move forward by using force to pass people or cause them to move aside. she pushed her way through the crowded streets he pushed past an old woman in his haste Example sentencesExamples ‘Oh Sam, stop being such a drama queen,’ Bryant rolled his eyes and moved to push past her to step into the house. To chat to him your options are to push aside young, excited children, or rush to an enclosed area such as the corridor of staff toilets. Her male colleague approached and took hold of the defendant's arm but was hit in the arm and the other officer was pushed away, she said. Mark jumped aside as Grace pushed past him and made a watch out kind of whistle. After pushing past him they passed through the curtains and suddenly were in a big, warmly lit room. Forward ranks pushed back, darting past the elite guards at their backs as they fled for their own lines. shouted the boy suddenly, pushing the two ladies out of the way. He motioned for me to stay, then walked forward, pushed past his father and stepped into the study. With more and more force, he pushed aside anyone that stood in his way, with his hands and soon with his blade. I even had to push aside a few nurses and their flag-waving kiddies because the protest moved too slowly and the market was nearly closing. The soldier in the front, the one who I had cut, growled in rage as I passed and tried to push past Rama", "n. The security forces were aggressive, pushing forward until an elderly demonstrator suffered a heart attack. Then Sally was racing forward, pushing past the others, and diving head-first into the murky water. Teran made a move to push past Hayato, but found him unmoving. Mihra moved, pushing past him, making for the entrance in the rock through which her guide had disappeared. At once, the torch end erupted into flame, and he began to move forward, pushing roughly through the crowd. Synonymsforce (one's way), shove, thrust, squeeze, jostle, elbow, shoulderthread, wind, work, inch2.1 (of an army) advance over territory. the guerrillas have pushed south to within 100 miles of the capital Example sentencesExamples In January 1945 Montgomery's forces pushed forward to the Rhine. Thereafter, Twenty-first Army Group pushed steadily towards the Rhine. The war began when colonists from Massachusetts Bay began pushing into territory claimed by these people. As the Union army pushed into the South, a young soldier from the south, but committed to the Union cause, was assigned guard duty. In 1941 Germany pushed deep into Soviet territory, when the Soviet air-force hit back. With the enemy reception proving nothing like they had anticipated, troops pushed inland. The Huddersfield Second Battalion, and the rest of the Regiment, were pushing down to the south in the next phase of attack. With our nation at war, the Army is pushing toward more rapid, immediately relevant change in the Current and Future Force. In the late autumn of 1950, UN forces pushed forward up the peninsula towards the Chinese border. We must not weaken as we strike again and again, probing and pushing to exploit the enemy's vulnerabilities. Troops of the 101st, pushing deeper into Najaf, are greeted by cheering crowds. By August 1944, the U.S. VI Corps landed in the south of France and began pushing to the northeast, Prieur said. It was now October 1917 and the Allied advance pushed towards a feature known as Broodseinde Ridge. Gaede's Army Detachment pushed forward into the French lines near Obersept on the 13th of February. Ayutthaya pushed into Khmer territory and sacked the capital of Angkor. It is a third of the way to their destination, and the US army's 3rd Infantry Division is already pushing towards the city from further north. Right now, they were pushing through enemy territory in France. Israeli armour and infantry pushed into Jordan capturing the West Bank, deep into Sinai up to the Suez Canal and into the Golan Heights in Syria. All of the vehicles push through the kill zone as quickly as possible, advancing approximately 300 meters. As the Elf army pushed forward, a sea of blood, bodies and gore was left behind.2.2 Exert oneself to attain something or surpass others. I was pushing hard until about 10 laps from the finish Example sentencesExamples Will he be pushing hard for hate crimes legislation? Currently, the group is pushing hard to become highly cost efficient and has entered into processing arrangements with Gambia in order to create a highly competitive base. It is the one he is pushing hardest, although he admits that no possible reorganization can keep up the current levels of service. He really wanted this and has been pushing hard for it. With Montrose pushing hard for an equaliser and Peterhead admirably trying to double their tally, it was no surprise when the home side struck on the break after 75 minutes. After that the car was so consistent the whole race that I was really able to push hard, until the last 15 laps. The former young driver of the year finalist still has an outside chance of the Irish title this season and will be pushing hard to continue his winning ways on home soil. Coelho, who turned down an interview request, saying it might jeopardise his chance of election, has always rejected such assessments and is pushing hard for recognitio", "n. I made a clean start from pole and was pushing really hard until the first pitstop when I saw how big the gap actually was. He spent the lead-up to the G8 summit pushing hard for a deal on climate change, yet this deal caught Downing Street completely by surprise. When there's no nation pushing hard, the UN drifts like a beachball. They're pushing very hard for a conviction for murder. With billions of dollars in foreign aid at stake, the United Nations, sponsors of the talks, were pushing hard for a conclusion yesterday. The event, 54 holes of it anyway, was played on the Torrey Pines course near San Diego, which is pushing hard for a US Open in 2008. Six months ago they cautioned against being too aggressive on the corporate scandals; now they censure Democrats for not pushing harder. We're pushing very hard to get that to happen as soon as possible. We were pushing hard to include the costs of the road-over-rail but the Government said it didn't want it to be included. A dancer is always trying to tough it out a little longer, hoping to earn a few more bucks, pushing just a little harder. The fact that lots of Wall Streeters will get rich racking up fees on these tiny accounts only serves to show why they're pushing so hard for it. What they don't want is to lose their jobs and educational opportunities by pushing too hard at the restrictions their government has placed on their ability to speak. Synonymsstrive, struggle, endeavour, work, try hard, make every effort, do one's best, do one's utmost, do all one can, give one's all, give it one's all, give something one's all, go all out, fight, be at pains, put oneself out, apply oneself, exert oneself2.3be pushinginformalBe nearly (a particular age or amount) she must be pushing forty, but she's still a good looker Example sentencesExamples I'm pushing forty, though forty seems to be doing most of the pushing. I was surprised to find out, however, that the boys are actually a bit older than myself (I'm pushing fifty). Synonymsroughly, about, around, just about, round about, or so, or thereabouts, more or less, in the neighbourhood of, in the region of, in the area of, in the vicinity of, of the order of, something like, give or take, give or take a few, in round numbers, rounded down, rounded up3with object Compel or urge (someone) to do something, especially to work hard. she believed he was pushing their daughter too hard Example sentencesExamples Years of tests have pushed him hard physically and mentally. Significantly, she left her job as a schools coach amid allegations that she pushed the kids too hard. Parents who push their children hard always focus on examples they like, successes such as Lang and Ding. Gus pushes me hard to not just automatically do everything the accepted way. Although she didn't do anything sporty, she always wants to do her job well and she pushed us quite hard to get the potential out of us. Michael's father was a military man with a strong sense of order, and he pushed his sons hard in athletics. An unnamable urge was pushing me to drive harder, and for once, I didn't struggle to put words around it. That's why we'll push him hard to come around to the beliefs that mean the most to us. I've been pushing her too hard, asking too much of her. Tiburce always believed in me, and always pushed me to work hard. Afraid of losing a big customer, Mo didn't push him too hard. The need for Ottawa to push the U.S. harder to reopen the border to live cattle is a common refrain from producers across the country. All of a sudden the public want journalists to get the truth out of him, and the public backs them when they push Howard hard. The problem with that is that if you push a witness too hard too fast, they are going to take the Fifth Amendment or tell you to walk away. He was only 6 then, and I felt they were just pushing the kids too hard. On the subject of fitness, Black rejected Dawson's claims that Henry had pushed the players too hard. They were pushing me so hard I presumed I must have been in the top three. I only remember one teacher pushing me to work harder on my academic pursuits. But I have to say if he was available for Northern Ireland, I would be pushing him very hard. Do you think the government is trying to push voters even harder than it's pushed them already? Synonymsurge, press, pressure, put pressure on, pressurize, force, drive, impel, coerce, naglean on, prevail ondragoon into, steamroller into, browbeat into, use strong-arm tactics oninformal put the heat on, put the screws on, twist someone's arm, railroad into, bulldoze into3.1push forno object Demand persistently. the council continued to push for the better management of water resources Example sentencesExamples I will continue to push for policies that put ordinary members first and fight for a rank and file strategy. They have a successful side pushing for promotion from the Third Divisio", "n. Unions and safety campaigners have been pushing for the law to be extended. There have been calls for the council to try to push for a second railway station in the Swindon area. The Green Party will continue to push for more attractive alternatives to the car and lorry. She was the founder and former director of both the Center for Responsive Politics, which tracks electoral spending, and Public Campaign, which pushes for campaign finance reform. He said the campaign group was still pushing for more controls on the manufacture and sale of fireworks. York are pushing for the second promotion place after they sealed Poppleton's relegatio", "n. We ", "also work with housing associations and will push for families to be evicted if they continue to misbehave. They must now regroup and continue their push for promotion to the senior ranks. He is the one who pushed for campaign spending limits in this race; he rather insisted on them. Campaigners at the school are still pushing for the decision to be halted until more information can be given to the members. Any campaign pushing for a name change has to begin with our own media, officials and the people on the street. Some union chiefs are pushing for campaigns focusing on how families will be affected. Consumer campaigners have been pushing for a Europe-wide clothing size scale in a bid to make shopping easier. Green campaigners are pushing for recycling facilities in Thundersley to be given an upgrade. Their fall from grace appears to have levelled off and they are now pushing for promotion and ultimately a return to the top. Mrs Beatty has contacted the town council to help her push for more road safety improvements. That party will continue to push for a softening of the law around cannabis. So we should welcome and push for a leadership election campaign as soon as it's feasible. Synonymsdemand, insist on, clamour for, ask/call for, request, press for, campaign for, work for, lobby for, speak for, drum up support for, sponsor, urge, promote, advocate, recommend, champion, espouse3.2be pushedinformalHave very little of something, especially time. I'm a bit pushed for time at the moment3.3be pushed to do somethinginformalFind it difficult to achieve something. he will be pushed to retain the title as his form this season has been below par4informal with object Promote the use, sale, or acceptance of. the company has been pushing a document management system Example sentencesExamples Nevertheless, he mentioned that promotion activities that usually push up the sales figures had been stopped because of the strike. He's pushed the Yell sale - which has been in limbo for years. One upcoming promotion will push the redesigned CNN Headline News to the local ad sales community. Froggatt has been using some of the cost savings to invest in a series of marketing campaigns, which appears to be pushing up profits and sales of some of S&amp;N's core brands. He thinks Sindi pushed Stuart into accepting and that he only said yes because he doesn't really trust her. Dr Dorothy Faulkner, an expert in the social and intellectual development of children, says that publicity about bad forms of play could be pushing up traditional toy sales. I know America keeps pushing Europe to accept Turkey. Strong memory sales helped push AMD to a solid second quarter, the company reported today. Global sales have pushed Hyundai to seventh place, ahead of both Honda and Nissa", "n. Public sympathy pushed the Sorbonne to promote her to her dead husband's professorship. Synonymsadvertise, publicize, promote, give publicity to, beat/bang the drum for, popularizesell, market, merchandiseinformal plug, give a plug to, hype, hype up, give a puff to, puff, puff up, boost, flogNorth American informal ballyhoo, flack, huckster4.1 Sell (a narcotic drug) illegally. she was arrested for pushing hard drugs Example sentencesExamples Their example has fostered the establishment of another woman to pushing drugs in another area and to prosper. Police today declared war on drug dealers from London pushing cocaine, heroin and crack to children as young as 13. Since they can't keep him in the designer sneakers he wants, young Marcus starts pushing drugs himself. Of these junk messages, half are pushing drugs, a fifth promote porn and another fifth promote cheap software. Users should not be jailed, unless they were pushing others into the habit. We want to know who, what, where, when and if possible, how they know someone is pushing drugs. They lie, rob, cheat, push hard drugs, intimidate innocent people and run protection rackets. Side-effects and unforeseen deaths are part of the deal when you're pushing drugs. Police sources said he had been arrested for pushing drugs. As a result she ended up in the law courts for pushing drugs via her ever-popular soups and casseroles. While he adapts himself to life in the slums, he ", "also finds out there is money to be made in black-marketing false passports, pushing drugs and doing countless other small jobs. But Shadow Home Secretary Ann Widdecombe said legalising cannabis would lead drug barons to push even more hard drugs. Once cannabis is legalised, the dealers will be taken out of the equation and the risk of them pushing harder drugs and the availability of harder drugs to the cannabis smoker is eliminated. One kind of crime the former drugs squad officer is determined to come down on heavily, he warned, is the pushing of illegal drugs. Ah, the shadowy evil dealer, pushing drugs outside the school gate. Cllr Wright said he was not an informer, but where drugs were concerned, he would have no problem informing on those pushing, selling and taking drugs. Synonymssell, put on sale, put up for sale, offer for sale, vend, retail, trade in, deal in, traffic in, peddle, hawk, advertise5Computing with object Prepare (a stack) to receive a piece of data on the top.5.1 Transfer (data) to the top of a stack.6Photography with object Develop (a film) so as to compensate for deliberate underexposure. some films can be pushed during processingnoun pʊʃpʊʃ1An act of pushing someone or something in order to move them away from oneself. he closed the door with a push Example sentencesExamples Instead, though, I gave Anna a little push, and they moved sideways to the locker beside me. There is a push now to move the drugs over the counter. Mark said, giving her a small push through the door and closing it behind her. The corporation is fighting a push by creditors to move the former energy trading giant's bankruptcy case from New York to its hometown of Housto", "n. The move follows a government push to recruit 3,000 matrons across the country as part of a major plan for the National Health Service. Not so much as a push - absolutely no physical contact - just words. With a gentle push from another locomotive from behind, Flying Scotsman broke through a banner declaring Railfest open to the sound of the City of York Pipe Band. Jess gave the door a slight push and it swung ope", "n. I pushed the handle down and gave a gentle push upon the door. The move is the latest push by baseball to increase its marketing to younger fans - and make money along the way. Finally I gave him a push and slammed the door in front of his face. There was a push, a punch and another blow then a complaint to the police. If it means more critics or voters seeing films in the theater, it's a terrific outcome, even if the push behind the move is incredibly faulty. Michaels shoved me into the backseat with a harsh push and slammed the door in my face, and I realized it has been a while since a cop has done that to me. Then he tried to push Alice away gently trying not to hurt her bruises from the previous night but she wouldn't move with his gentle push. The Chinese are reportedly already a slight majority but new plans indicate a big push to move more settlers i", "n. Spitz looked back at the wisecracking Kai and with a little push, Kai was knocked out agai", "n. She sees the skin of her hand and pushes Neil out the door, ending the seduction for now. Just push open the door and walk straight up to the bar. He patted me on the back and gave me a slight push to the door as if I should do it right now. Synonymsshove, thrust, ram, bump, knock, hit, jolt, butt, prod, poke, elbow, nudge, shoulder, jostle1.1 An act of pressing a part of a machine or device. the door locks at the push of a button Example sentencesExamples With the push of a button the hatch swung open immediately reducing the million pigeons to just under a million with a wet feathery splat. With the push of a button, the narrow barrel of his device glowed and a beam of light issued from where blasts usually came. And then, with a push of a single button, the drink will be concocted before his very eyes within a matter of seconds. Printing great quality images is now possible directly from the Gallery with just a few pushes of a butto", "n. With a single push of a button, you can replay the last incoming transmission and up to 16 messages. Two short pushes of a button enable the operator to direct the system manually, and zoom in on the strange object, which has almost vanished between the waves. In just 20 seconds, the fully automatic, insulated roof retracts at the push of a button - and back again should the weather tur", "n. The work suggests a metal contraption, perhaps an explosive device that could be detonated with a push of the beige butto", "n. The air-taxi service's telephone number, programmed into Len's sat phone, is no more than the push of a memory button away. The rest push completely into the device and are ejected with a small eject button to the right of the slot. Then, with the push of a button, I erased the number from memory. The sound can usually be turned off by a button push. Go from the acoustic response of a baroque concert hall to that of a 10,000-seat arena or a gothic cathedral with the push of a butto", "n. They had an automatic phone fitted in his office, preprogrammed to enable him to reach other numbers at the push of a single butto", "n. Information is limited to only that which is host often used and is accessible with only a few pushes of the butto", "n. This is handy, but the machine does not remove them with a push of the button - you have to do the prewash treatment yourself. You can make tactical heads-up navigational displays for your vehicles with the push of a butto", "n. The electric beds, which can be raised and lowered at the push of a button, will help give patients more control and independence. The push of a button should reconnect power automatically when power is restored. The computer is turned on by a long push of either butto", "n.2A vigorous effort to do or obtain something. many clubs are joining in the fund-raising push he determined to make one last push for success Example sentencesExamples In an effort to maintain the push, Operation Impact has forged a partnership with Crimestoppers. The Yorkshire Dales National Park Authority is revitalising its network of information points and is urging local shops, pubs and cafes to join in the promotion push. A leading campaigner in the push to reopen Rochdale Canal has called on Rochdale Council to act swiftly to create a boatyard in Littleborough. A series of events is ", "also planned as part of the fund-raising push. That it continues to provide solace to readers long after the initial marketing push. They were amazing during our promotion push last seaso", "n. The nonpartisan effort, sponsored by a coalition of local groups, pushes registration at venues such as clubs and restaurants. The company's ambitious push to drive the brand upmarket risks hurting its existing premium marque, Audi. Jerry Gill is already looking forward to a promotion push with Cheltenham next season as he reckons their young bucks will be even better next term. It's part of a fundraising push that will ", "also see an internationally renowned pianist play the £11,000 grand piano at Swindon's New College. So was the long push to get the case before a jury worth the effort? The push into the enterprise space makes sense. Tindal Street Press gives the genre a push onto the bookshelves. The weekend's traffic effort from the Gardai was part of a national push to clamp down on dangerous and drunken driving. The Lartigue Monorail Restoration project has started its final fundraising push at a special press briefing in Listowel. The visitors were denied a third goal on 69 minutes when Sills crashed a powerful volley into the roof of the net but his effort was ruled out for an innocuous push. Nevertheless, the triumph gave York their first double of the league campaign and it could yet prove crucial in both side's promotion pushes. However, over the last month the manager has noticed a marked improvement in their standards and he now believes that his side are ready to embark on a serious promotion push. He noted that the TV station's ratings have responded to recent programming changes, and a strong push of promotion will help even more. This push into music is the start of a daring effort to reinvent one of the world's best-known brands. It attributes this growth to more affluent online shoppers, an ecommerce push by traditional retailers and the aggressive promotion of online stores. He says the decision would ", "also complement the current push to regulate the labour hire industry and ensure employers did not use labour hire to undercut the award system. As reported in Monday's Evening Press, York Police have launched a new push to remove beggars from York's streets. Synonymsendeavour, striving, effort, exertion, labour, work, toiling, pains2.1 A military attack in force. the army was engaged in a push against guerrilla strongholds Example sentencesExamples The push to downsize the military and privatize functions means government contracts are a growth industry. Now, all this comes on the heels of what was the deadliest attack here since the they ended their push, their offensive near the coast. The push of the main group of forces should be directed at exploiting success and thwarting the enemy's attempts to restore its defenses. The Allied forces co-ordinated a major push from the spring and, in April, the British pushed forward in the battle of Arras. The re-election of the president is expected to be followed in short order by a massive US military push into the desert city. It was too easy for some units we saw to take a final break before the big push into Iraq. We hit the targets at night in a final push against the terrorist's stronghold near the airport. The Marines need a divisional push to seize Fallujah and they don't have the me", "n. The Pentagon is making a serious push to pull US forces out of Balkans altogether. With the rapid push to Baghdad, our mission changed often, as did the CSB's task organizatio", "n. In Iraq, the military has launched another push against insurgents in the region where the rebellion continues to rage. Once Morocco was secure, it served as a major base for U.S. bombers and as a logistics center for the push toward Tunisia and Sicily. The Biafran army then went on the offensive in a push towards Lagos. A Communist push from the highlands to the sea to cut South Vietnam in half and isolate Saigon appeared in the offing. Despite the military push, a rocket which was fired from Gaza landed in an open area of Israel's Negev Desert overnight, causing no damage or injuries. Now, these attacks come, as you say, amid day three of the military's latest push against insurgents in the western desert. He was convinced that a major US military push into Najaf was not far away. American forces then embarked on the long push to Tokyo. It is the latest U.S. military push against the insurgency. The allies had concentrated the bulk of their troops to the north in advance of the push towards Germany, and this had left the US forces at the Ardennes thinly spread. Synonymsadvance, drive, thrust, charge, attack, assault, onslaught, onrush, offensive, sortie, foray, raid, sally, invasion, incursion, blitz, campaignarchaic onset2.2mass noun Forcefulness and enterprise. an investor with the necessary money and push Example sentencesExamples These men, who ‘do not let the grass grow under their feet’, are clearly all push and enterprise. Synonymsdrive, initiative, enterprise, enthusiasm, eagerness, ambition, motivation, go, dynamism, energy, gusto, vigour, vitality, verve, fire, fervour2.3a pushBritish informalSomething that is hard to achieve. we're managing on our own but it's a pushPhrasesat a pushinformal If absolutely necessary; only with a certain degree of difficulty. there's room for four people, or five at a push Example sentencesExamples You could use cottage cheese at a push, but sieve it really well, or the mix will end up lumpy. Or if you can't make you own notes photocopy your mates or at a push ask the teacher to go over it one lunchtime for you. In the past it was a lot simpler - you'd reach a certain age - somewhere between 22 and, at a push, 35-and you'd freeze dry your record collection, stop going to gigs and, certainly, stop reading music papers. Not making the link depend on a central server or need special software, ie hand-decodable at a push. Someone could say to me that Scott Brown, pictured, can play right wing and, at a push, centre-forward. Yes you can tap your feet to it, and at a push, sway your hips but there was no chance of being overwhelmed. Every single person I know can make fancy stuff like Thai green curry or at a push, stuffed peppers. I can say, for example, that it tends to form chemical bonds to five other atoms at a time, but can tolerate fewer and, at a push, more. They fit a good 10 to 12 tracks into a set that can't be much over 20 minutes - all of which are raucous, thrashy and comprised of two powerchords - maybe three at a push. Rear passenger space is a bit on the small side, almost making this a two-seater, but you could shoehorn in a couple of adults at a push. Synonymsif necessary, in case of necessity, if need be, if needs must, if forced, if all else fails, in an emergencyget the push (or shove)1informal Be dismissed from a job. four PR people at head office are getting the push Example sentencesExamples This was compounded further when Ronnie Burns was given the shove, and headed to Adelaide to join national uber scapegoat-in-the-making Wayne Carey. ‘You've done as much as you can with the paper,’ declared Ken Cowley, the News Corp managing director, when he gave me the shove. Eisner's position is not all that secure, and if his going was the difference between the renewal of the Pixar deal, or the loss of the Pixar deal, then conceivably the board might give him the shove. The luminescent bruises on that aggrieved ego are so obvious, the Professor can't help wondering if the column was penned within minutes of Farmer Phil learning that he was set to get the shove. Yet the committee-bound European elite, with their ludicrous consensus-based politicking, will almost assuredly be unable to muster up the courage to give him the push. When Colonel Lourake came to visit me here, he gave me the push. If he cannot back up such madness, and there isn't a hope in hell he will be able to, then Ladbrokes have to give him the shove. John Smith, the £205,000 a year chief executive of the Post Office, is getting the push for not being ruthless enough. What does John Tamihere have to do to get the push from Labour? They want pointy end fighters, and that is why DC got the shove from McLaren, and why I think Sir Frank Williams will give him the cold shoulder too. Synonymsthrow out, remove, eject, expel, turn out, turf out, fling out, force out, drive out, evict, dislodge, oust1.1Be rejected in a relationship. Example sentencesExamples As Gloria, his fiancée of five years who gets the push, Jessica Walker is a perfect screech, with a classic mother to match in Carol Wilso", "n. I just hoped Rebecca wouldn't give him the shove, like she does with most of the guys that showed interest in her.give someone the push (or shove)1informal Dismiss someone from a job. it's hard to psych yourself up to get another job after you've been given the push1.1End a relationship with someone.push at (or against) an open doorHave no difficulty in accomplishing a task. if the management were to tackle this issue, it might find that it was pushing at an open door Example sentencesExamples I think you should see instead us as pushing at an open door. There is no doubt that those campaigning for the right-to-die push at an open door. He should in some ways be pushing at an open door. I think that you are pushing at an open door, when you talk about public service ethos, and there is a price tag that goes with that. He's pushing at an open door with plenty of voters in Braithwaite where the extent of the prejudice harboured by some towards the 10 per cent Asian population in the town is stark. It made us realise that we could win this game, even if to be honest, I think he was pushing at an open door. Collecting signatures was like pushing at an open door. I understand Mr Leakey's concerns but as the club has committed to protect the genuine open space at the County Ground, he is pushing at an open door. There was a sense in which the Party was pushing at an open door. Chapman already planned to vote for him so the letter was pushing at an open door.push one's luckinformal Take a risk on the assumption that one will continue to be successful or in favour. he had pushed his luck too far, and his smuggling was discovered Example sentencesExamples ‘You could be great, along with my help,’ he continued, pushing his luck. Sure it was a risk to be pushing his luck so soon, but he was having a great time with Krystal and dreaded the fact that their evening would be coming to an end. He was basically pushing his luck, but seemed unaware of it. The wild cards afford you the luxury of being able to push your luck with no risk. As Brendan was leaving the church, and by this time definitely pushing his luck, he spoke to the priest who had officiated at the service. On the other hand, you are pushing your luck if you try to pull off heroic endurance feats every day. He must always be out there, pushing his luck, trying new things, taking a carefully calculated risk. The tradition ended abruptly when he pushed his luck too far and alienated the avowedly nationalist group by telling them that they must support the principles of unionism. Your parents have agreed to let you go for the party, don't push your luck by asking them to let you stay late. Those girls pushed their luck though when they suggested we might feel more comfortable someplace quieter.when push comes to shoveinformal When one must commit oneself to an action or decisio", "n. when push came to shove, I always stood up for him Example sentencesExamples While we'll work as a team, ultimately, when push comes to shove, Michael will have the final say. They sometimes say they are, but in fact when push comes to shove, they are no more interested in the weaker clubs than they are in clubs that are not in Victoria. I think when push comes to shove, the young people of the United States will react the same as generations before them. But again, I've got to think when push comes to shove, he won't do it. But when push comes to shove, he sold out to preserve his place in the party, and all for a man whose campaign attacked his family to score political points only 4 years ago. But I think, when push comes to shove, he'll be there with us. Is it possible you're totally wrong about North Korea, that the country is in such terrible shape that when push comes to shove, its military is going to turn out to be in just that kind of shape as well? But when push comes to shove, my greatest enjoyment can be summed up in one word: shopping. The good characters are decidedly saintly, and the bad guys aren't really all that bad when push comes to shove. But, two, I think it really helped when push comes to shove. Synonymseventually, in the end, in the long run, at length, finally, sooner or later, in time, in the fullness of time, after some time, in the final analysis, when all is said and done, one day, some day, sometime, at last, at long lastPhrasal Verbspush aheadProceed with or continue a course of actio", "n. he promised to push ahead with economic reform Example sentencesExamples She questioned the wisdom of the U.S. pushing ahead with a programme for which there is little or no scientific basis that it will be successful and which would be astronomically expensive. The county council is pushing ahead with plans to introduce by-laws increasing the speed limit on its section of the same road from 80 kmph to 100 kmph. As for the future, En Foco will continue to push ahead with more emphasis on the journal. He said that it was important to establish a new use for the site quickly, but this would not inhibit the council from pushing ahead with plans to help the 260 Thrall workers find new jobs. Coca-Cola continues to push ahead with the establishment of more local bottling plants. Instead of pushing ahead with a compulsory scheme in the short term, the Government will introduce draft legislation in the Queen's speech this month as the first step towards a voluntary system. But with China pushing ahead with development on its side, and near the border, Japan worries that the resources on its side will be affected. The Scottish Executive, however, attracted the bulk of criticism for increasing stress on teachers by pushing ahead with a policy of reducing the number of pupils being excluded from school. Since then the Town has continued to push ahead with the project on its ow", "n. Now the Food Standards Agency Scotland is pushing ahead with legislation that will force manufacturers to disclose any traces of the most dangerous dozen ingredients of food.push alongGo away; dep", "art.push someone around (or about)Treat someone roughly or inconsiderately. he was annoyed by their arrogance in thinking they could push him around whenever they wished Example sentencesExamples Nobody is pushing us around or has ever pushed us around on West Indian wickets. All those years he made fun of me, bullied me, pushed me around, I think that it was his cry for help. Maura pushed her around, Dinah had pushed her around, Chase pushed her around, everyone pushed her around, but Piper was going to stand up her decision this time. It appears that perhaps unconsciously you are attracting partners who push you around and treat you badly because at a deeper level you may still carry negative belief patterns from your childhood. You must hold your head up high and not allow those bullies to push you around. It means that part of what you should develop about your life is not letting people push you around. Sing along, now dad, dad, why did you let that man push you around like that? Nobody has succeeded in pushing me around before and now I'm even freer and in a better position to do my best for Bradley ward and Nelso", "n. They are going to push you around as much as a big corporate client. Everyone pushes us around, but the minute we get just a little bit of power, we exercise it to the fullest without prudence or thoughts on what it is doing to us in the bigger picture. Synonymsbully, domineer, boss about, boss around, ride roughshod over, trample on, tread on, bulldoze, abuse, mistreat, maltreat, kick about, kick around, browbeat, lean on, tyrannize, intimidate, threaten, torment, terrorize, victimize, pick onpush inGo in front of people who are already queuing. they scowled at him because they thought he was trying to push in at the head of the queue Example sentencesExamples I have ", "also witnessed the elderly pushing in the queue for the bus at the interchange, but if children dare do this, they get a mouthful of abuse. Was it a war against French and Dutch skiers trying to push in front of you in the queues for lifts? Seething with suppressed fury when someone cuts you up in traffic or pushes in front of you in a shop queue is a sure way to develop a raging headache, says a US researcher. I myself hate getting on the train and always stand at the back as I watch people get pushed in front of and people darting in-between people. It seems that while I have been happily queuing, others have been pushing in and sneaking ahead. She then pushed in front of me in the queue, demanded a discount and got it. Please, no pushing in the queue, we are all civilised and cultured people, your turn too shall come. You find yourself rubbing shoulders with some household names and being a little in awe of the whole thing, but by about day three you don't care who you're pushing in front of in the canteen queue. To start with, I was quite offended by people pushing in front of me as if I didn't exist. The woman pushed in front of her daughter until she was face to face with Isabelle.push off1Use an oar, boathook, etc. to exert pressure so as to move a boat out from a bank. we pushed off and rowed out into midstream Example sentencesExamples They pushed off the shore, rowing through the ice of the wide Delaware. Shapovalov pushes off for Ukraine in the men's four repechage. Push the ball behind your back toward your left hand as you push off your right foot to start moving to your left. Come right up to the bank to let her out, push off and be back again as soon as she was. Finally, it did, and though the orders that followed were to return to ship, a squall blew up and the boats could not push off. He helped me into the boat, then pushed off and jumped in himself. Once in the boat she ‘gets possession of an oar’ and pushes off. She too had got possession of an oar, and had pushed off, so as to release the boat from the overhanging window-frame. But when he tried to push off the block to get moving again, the block slid across the floor too. The water was shallow enough, and the bottom varied enough, that they often touched up against a rock of bit of sandbar, and when they did, they reacted instantly, pushing off against it to move laterally.2Go away. I've got to push off and get to work Synonymsgo away, depart, leave, take oneself off, take off, get out, get out of my sightpush onContinue on a journey. the light was already fading, but she pushed on Example sentencesExamples The middle westerner pushes on, endures, and finally finds a place that looks like home. A short photo stop soon cooled us down, before we pushed on up the hill carrying the weighty bags of tackle and camera gear. After a week and a half of catching up on sleep and drinking enough wine to prop up the economy, we begin thinking about pushing on to the island of Faial. Two gunmen were arrested and, as heavy fire could still be heard ahead, Major Hollister pushed on with just two of his me", "n. We acclimatise with two nights in Namche before pushing o", "n. By now, both were very fatigued, but they both pushed o", "n. Pace yourself with a pause at a cafe, in a square or park, before pushing o", "n. They advanced some two to three miles to a roundabout Capt Cosby described as the gates of the city before pushing o", "n. The pair pushed on first to Lion-sur-Mer, then Hermanville-sur-Mer, before they set up their station in Cae", "n. It would be a lovely journey, so people kept pushing o", "n. Synonymscontinue one's journey, continue on one's way, carry on, advance, press on, progress, make progress, proceed, go on, make headway, gain ground, push forward, forge ahead, go aheadpush something throughGet a proposed measure completed or accepted quickly. the government is trying to push through a package of measures to combat organized crime Example sentencesExamples Local authorities are creating problems for themselves in trying to push such ventures through so quickly. More than 100 of the party's MPs have signed motions criticising the government's plans and he faces a bruising battle to push the measure through the Commons. The company strategy is about teamwork and pushing good ideas through the system as quickly as possible, with superior dedication from all divisions within the company. Surely a chicane system should be considered before the proposed measures are pushed through. Abbott's package was the government's third attempt in a year to push its measures through parliament. In part, school-to-work manifests itself as a desire to push students through universities and colleges quickly, to train rather than educate them. If justice can be done, I have no objections - and provided the defence have got time to prepare a proper defence and the cases are not pushed through too quickly. She's really focussed on looking outwards rather than inward and she's prepared to push innovative measures through the Scottish parliament. But in the years ahead, as the fiscal squeeze tightens, the sense that some politicians took advantage of our trauma to push this measure through will not help our new-found sense of national unity. Indeed, these laws have been pushed through as silently and quickly as possible precisely so as to avoid such a discussio", "n.OriginMiddle English (as a verb): from Old French pousser, from Latin pulsare 'to push, beat, pulse' (see pulse1). The early sense was 'exert force on', giving rise later to 'make a strenuous effort, endeavour'.appeal from Middle English:Recorded first in legal contexts, appeal comes via Old French from Latin appellare ‘to address, accost, call upon’. Peal (Late Middle English) is a shortening of appeal, perhaps from the call to prayers of a ringing bell. The base of appeal is Latin pellere ‘to drive’, found ", "also in compel ‘drive together’; dispel ‘drive apart’; expel ‘drive out’; impel ‘drive towards’; and impulsive; propel ‘drive forwards’; repel ‘drive back’, all Late Middle English. It is ", "also the source of the pulse (Middle English) that you can feel on your wrist and is related to push (Middle English). The other kind of pulse, an edible seed, is a different word, which comes via Old French from Latin puls ‘porridge of meal or pulse’, related to the sources of both pollen and powder.RhymesHindu Kush, kurus, mush, whoosh, woosh bellverb.1 phr. phr.", "v.Definition of push in US English: push verbpʊʃpo͝oSH1with object, usually with adverbial Exert force on (someone or something), typically with one's hand, in order to move them away from oneself or the origin of the force. she pushed her glass toward himwith object and complement Lydia pushed the door shutno object he pushed at the skylight, but it wouldn't budge Example sentencesExamples He felt sunshine on his face, but it was quickly torn away from him as a sack was ruthlessly shoved onto his head and he was pushed away. Another woman budded in, pushing her way in front of the group. The winds pressed against my back and forced me upright, pushed me toward the side yard, then into the front. Being the chivalrous idiot that I am, I kept pushing the person in front up, and the inevitable happened. With his leg Marcus pushed one of the boys off of him and then he took his arm and hit the other boy. The guard announced, gently pushing the boy in front of him. Ryo stood to walk out of the house, but Kunshi moved toward him and pushed him back into a seat. The boy who had pushed Jaime earlier was now walking with Gwion, gesturing wildly as his voice rose to new heights. In one case the workers were pushed away by federal and military police squads. Akasha and Jessie were able to get threw because a large boy in front of them was pushing people out the way. Then the mass of boys began pushing Hyrum down the street. When he was about to take Winston's hand I found myself blocking the way, gently pushing the distressed little boy behind me. I started pushing the people in front of me to get in the front ", "also. Immediately she was pushed away and the ground would have cushion her fall except that would have hurt, but she was cushion by a warm body instead. Lora, who was well under four feet tall, easily pushed the larger boy away and slipped into the room without a sound. Embarassedly Kris pushed the older boy away, and tried to hide his blush. Rira managed to get in front of me and pushed the girl out of the way. I slam the brakes and the force of the car pushes us toward the windshield. He sat up, pushing the younger boy up as well, as he reached over to the table and grabbed a textbook. She said in exasperation, pushing her way in front of them once agai", "n. Synonymsshove, thrust, propel, impel1.1with object Hold and exert force on (something) so as to cause it to move along in front of one. a woman was pushing a stroller Example sentencesExamples she asked, helping me into the wheelchair as she pushed the cart in front of me. ‘He started running away pushing the pushchair in front of him,’ said Mr Butterworth. Gasping for air, I scramble towards the raft and, with my four bobbing companions, swim to the safety of the shore pushing the raft in front of us. Two young mums pushing their children in front of them walk along the narrow pavement by the pub as we stand watching the traffic. A few months ago, I was walking down the main street in my home town when two women in front, pushing their children in strollers, stopped dead on the pavement and started talking. After a couple, you'll be ready to emulate Byron, who liked to swim across the Grand Canal pushing a candle in front of him. And wisely, unlike so many of her opponents, she had elected not to run with that stall on her back or push it in front of her on a trolley. As everyone looked to the door, a plump nurse appeared around the curtain pushing a cart in front of her. She glared and started pushing her cart in front of mine. I made my way around one defense man but skating between them and pushing the puck in front of me.1.2 Move one's body or a part of it into a specified position, especially forcefully or with effort. she pushed her hands into her pockets Example sentencesExamples How is hands slowly would grip my hips as we pushed our ever decaying bodies closer to each other as the night died young. He gently began pushing himself against her body, she frightful that he might fall on top of her. After a moment or two to focus his effort, he pushed himself away from the wall. She drew close to him and pushed herself against his body, wrapping her arms around him. I ease myself quietly from the entanglement of his body and push myself up into a sitting positio", "n. Bend your elbows so that your arms are at 90 degrees to your body, then push back up to the start positio", "n. When you push yourself, your body makes endorphins which give you a natural high. She used what body parts she could to push herself into sitting positio", "n. It is a strong move in which you are pushing your lower body down into the ground and using the ground to enhance your resistance and stability. His brown eyes lingered on her body, as she pushed herself against him. She pushed herself against his body, against his chest where there was no heartbeat. So he pushed himself in an effort to get better every day, so he could start and be prepared for that first game. I pushed his nearly limp body up to a sitting position and got up from the couch. James grinned and pushed himself from his position with the muscles in his back. Stand up slowly to a straight leg position, then push yourself on to your toes.1.3with object Press (a part of a machine or other device) he pushed the button for the twentieth floor Example sentencesExamples Over the next few hours, I experiment with pushing the little attendant button occasionally to see if anyone cares, but they don't. She pushed a small blue button on the side of the device, and it lit up. Then I discovered I could keep my left leg elevated, whilst pushing the sewing machine pedal with my right foot. The size of a watch, the DRS device is activated by pushing the Panic Button or when the device senses you haven't moved around in a while. When everything was frozen in place again, he pushed the Unpause butto", "n. He picked up the cell phone and turned it around, pushing a small gray button at the back which opened up a slot for the tape. He picks up the presentation/computer remote and pushes the top left butto", "n. Staff activate the alarms by pushing an easily accessible butto", "n. She pushes the down button on the one next to it, hoping it would hurry up. Cameron knelt down quickly, pushing one more butto", "n. They have reached the elevator and he pushes the down butto", "n. Ally took the keys and pushed the unlock button on the keyless entry remote. By pushing a few ATM buttons, they can transfer their cash directly into Citibank vaults. They were instructed to quickly push one of two buttons depending on the arrow's directio", "n. ‘I want to hear,’ she said, pushing the small black button on the phone's cradle. They walked silently to the elevator and Bridget pushed the down butto", "n. She dementedly begins cackling as she pulls out an antenna and pushes a big red butto", "n. The man in the coat turned around to his desk, pushing a big red butto", "n. After pushing the last button a soft breeze washed over everyone and they all turned around to find its source. He laughed pushing the up button and the elevator doors swung ope", "n. Synonymspress, press down, push down, depress, exert pressure on, bear down on, hold down, squeeze1.4with adverbial Cause to reach a particular level or state. the political chaos could push the country into recession they expect that the huge crop will push down prices2no object, with adverbial Move forward by using force to pass people or cause them to move aside. she pushed her way through the crowded streets he pushed past an old woman in his haste Example sentencesExamples shouted the boy suddenly, pushing the two ladies out of the way. After pushing past him they passed through the curtains and suddenly were in a big, warmly lit room. The security forces were aggressive, pushing forward until an elderly demonstrator suffered a heart attack. At once, the torch end erupted into flame, and he began to move forward, pushing roughly through the crowd. ‘Oh Sam, stop being such a drama queen,’ Bryant rolled his eyes and moved to push past her to step into the house. Forward ranks pushed back, darting past the elite guards at their backs as they fled for their own lines. To chat to him your options are to push aside young, excited children, or rush to an enclosed area such as the corridor of staff toilets. He motioned for me to stay, then walked forward, pushed past his father and stepped into the study. I even had to push aside a few nurses and their flag-waving kiddies because the protest moved too slowly and the market was nearly closing. Her male colleague approached and took hold of the defendant's arm but was hit in the arm and the other officer was pushed away, she said. Mark jumped aside as Grace pushed past him and made a watch out kind of whistle. The soldier in the front, the one who I had cut, growled in rage as I passed and tried to push past Rama", "n. With more and more force, he pushed aside anyone that stood in his way, with his hands and soon with his blade. Teran made a move to push past Hayato, but found him unmoving. Mihra moved, pushing past him, making for the entrance in the rock through which her guide had disappeared. Then Sally was racing forward, pushing past the others, and diving head-first into the murky water. Synonymsforce, force one's way, shove, thrust, squeeze, jostle, elbow, shoulder2.1 (of an army) advance over territory. the guerrillas have pushed south to within 100 miles of the capital Example sentencesExamples It was now October 1917 and the Allied advance pushed towards a feature known as Broodseinde Ridge. All of the vehicles push through the kill zone as quickly as possible, advancing approximately 300 meters. Ayutthaya pushed into Khmer territory and sacked the capital of Angkor. With our nation at war, the Army is pushing toward more rapid, immediately relevant change in the Current and Future Force. It is a third of the way to their destination, and the US army's 3rd Infantry Division is already pushing towards the city from further north. As the Elf army pushed forward, a sea of blood, bodies and gore was left behind. With the enemy reception proving nothing like they had anticipated, troops pushed inland. By August 1944, the U.S. VI Corps landed in the south of France and began pushing to the northeast, Prieur said. In January 1945 Montgomery's forces pushed forward to the Rhine. Israeli armour and infantry pushed into Jordan capturing the West Bank, deep into Sinai up to the Suez Canal and into the Golan Heights in Syria. Troops of the 101st, pushing deeper into Najaf, are greeted by cheering crowds. Thereafter, Twenty-first Army Group pushed steadily towards the Rhine. In the late autumn of 1950, UN forces pushed forward up the peninsula towards the Chinese border. As the Union army pushed into the South, a young soldier from the south, but committed to the Union cause, was assigned guard duty. In 1941 Germany pushed deep into Soviet territory, when the Soviet air-force hit back. The Huddersfield Second Battalion, and the rest of the Regiment, were pushing down to the south in the next phase of attack. The war began when colonists from Massachusetts Bay began pushing into territory claimed by these people. We must not weaken as we strike again and again, probing and pushing to exploit the enemy's vulnerabilities. Right now, they were pushing through enemy territory in France. Gaede's Army Detachment pushed forward into the French lines near Obersept on the 13th of February.2.2 Exert oneself to attain something or surpass others. I was pushing hard until about 10 laps from the finish Example sentencesExamples With Montrose pushing hard for an equaliser and Peterhead admirably trying to double their tally, it was no surprise when the home side struck on the break after 75 minutes. We were pushing hard to include the costs of the road-over-rail but the Government said it didn't want it to be included. The event, 54 holes of it anyway, was played on the Torrey Pines course near San Diego, which is pushing hard for a US Open in 2008. He really wanted this and has been pushing hard for it. He spent the lead-up to the G8 summit pushing hard for a deal on climate change, yet this deal caught Downing Street completely by surprise. I made a clean start from pole and was pushing really hard until the first pitstop when I saw how big the gap actually was. Will he be pushing hard for hate crimes legislation? The former young driver of the year finalist still has an outside chance of the Irish title this season and will be pushing hard to continue his winning ways on home soil. They're pushing very hard for a conviction for murder. Currently, the group is pushing hard to become highly cost efficient and has entered into processing arrangements with Gambia in order to create a highly competitive base. When there's no nation pushing hard, the UN drifts like a beachball. It is the one he is pushing hardest, although he admits that no possible reorganization can keep up the current levels of service. After that the car was so consistent the whole race that I was really able to push hard, until the last 15 laps. What they don't want is to lose their jobs and educational opportunities by pushing too hard at the restrictions their government has placed on their ability to speak. Coelho, who turned down an interview request, saying it might jeopardise his chance of election, has always rejected such assessments and is pushing hard for recognitio", "n. With billions of dollars in foreign aid at stake, the United Nations, sponsors of the talks, were pushing hard for a conclusion yesterday. The fact that lots of Wall Streeters will get rich racking up fees on these tiny accounts only serves to show why they're pushing so hard for it. We're pushing very hard to get that to happen as soon as possible. Six months ago they cautioned against being too aggressive on the corporate scandals; now they censure Democrats for not pushing harder. A dancer is always trying to tough it out a little longer, hoping to earn a few more bucks, pushing just a little harder. Synonymsstrive, struggle, endeavour, work, try hard, make every effort, do one's best, do one's utmost, do all one can, give one's all, give it one's all, give something one's all, go all out, fight, be at pains, put oneself out, apply oneself, exert oneself2.3be pushinginformalBe nearly (a particular age) she must be pushing forty, but she's still a good looker Example sentencesExamples I'm pushing forty, though forty seems to be doing most of the pushing. I was surprised to find out, however, that the boys are actually a bit older than myself (I'm pushing fifty). Synonymsroughly, about, around, just about, round about, or so, or thereabouts, more or less, in the neighbourhood of, in the region of, in the area of, in the vicinity of, of the order of, something like, give or take, give or take a few, in round numbers, rounded down, rounded up3with object Compel or urge (someone) to do something, especially to work hard. she believed he was pushing their daughter too hard Example sentencesExamples He was only 6 then, and I felt they were just pushing the kids too hard. All of a sudden the public want journalists to get the truth out of him, and the public backs them when they push Howard hard. The need for Ottawa to push the U.S. harder to reopen the border to live cattle is a common refrain from producers across the country. Gus pushes me hard to not just automatically do everything the accepted way. Parents who push their children hard always focus on examples they like, successes such as Lang and Ding. Years of tests have pushed him hard physically and mentally. Do you think the government is trying to push voters even harder than it's pushed them already? An unnamable urge was pushing me to drive harder, and for once, I didn't struggle to put words around it. Although she didn't do anything sporty, she always wants to do her job well and she pushed us quite hard to get the potential out of us. I've been pushing her too hard, asking too much of her. On the subject of fitness, Black rejected Dawson's claims that Henry had pushed the players too hard. Tiburce always believed in me, and always pushed me to work hard. Michael's father was a military man with a strong sense of order, and he pushed his sons hard in athletics. The problem with that is that if you push a witness too hard too fast, they are going to take the Fifth Amendment or tell you to walk away. They were pushing me so hard I presumed I must have been in the top three. I only remember one teacher pushing me to work harder on my academic pursuits. But I have to say if he was available for Northern Ireland, I would be pushing him very hard. Afraid of losing a big customer, Mo didn't push him too hard. That's why we'll push him hard to come around to the beliefs that mean the most to us. Significantly, she left her job as a schools coach amid allegations that she pushed the kids too hard. Synonymsassertive, thrusting, pushing, ambitious, driven, aggressive, forceful, forward, obtrusive, bold, brash, bumptious, arrogant, officious, bossy, presumptuous, full of oneself, self-assertive, overbearing, domineering, confident, overconfident, cocksureurge, press, pressure, put pressure on, pressurize, force, drive, impel, coerce, nagassertive, thrusting, pushy, ambitious, aggressive, forceful, forward, obtrusive, bold, brash, bumptious, arrogant, officious, bossy, presumptuous, full of oneself, self-assertive, over-assertive, overbearing, domineering, confident, overconfident, cocksure3.1push for Demand persistently. the council continued to push for the better management of water resources Example sentencesExamples Unions and safety campaigners have been pushing for the law to be extended. Mrs Beatty has contacted the town council to help her push for more road safety improvements. York are pushing for the second promotion place after they sealed Poppleton's relegatio", "n. I will continue to push for policies that put ordinary members first and fight for a rank and file strategy. The Green Party will continue to push for more attractive alternatives to the car and lorry. We ", "also work with housing associations and will push for families to be evicted if they continue to misbehave. Campaigners at the school are still pushing for the decision to be halted until more information can be given to the members. Consumer campaigners have been pushing for a Europe-wide clothing size scale in a bid to make shopping easier. Some union chiefs are pushing for campaigns focusing on how families will be affected. They must now regroup and continue their push for promotion to the senior ranks. Their fall from grace appears to have levelled off and they are now pushing for promotion and ultimately a return to the top. He is the one who pushed for campaign spending limits in this race; he rather insisted on them. There have been calls for the council to try to push for a second railway station in the Swindon area. She was the founder and former director of both the Center for Responsive Politics, which tracks electoral spending, and Public Campaign, which pushes for campaign finance reform. Any campaign pushing for a name change has to begin with our own media, officials and the people on the street. That party will continue to push for a softening of the law around cannabis. He said the campaign group was still pushing for more controls on the manufacture and sale of fireworks. Green campaigners are pushing for recycling facilities in Thundersley to be given an upgrade. So we should welcome and push for a leadership election campaign as soon as it's feasible. They have a successful side pushing for promotion from the Third Divisio", "n. Synonymsdemand, insist on, clamour for, ask for, call for, request, press for, campaign for, work for, lobby for, speak for, drum up support for, sponsor, urge, promote, advocate, recommend, champion, espouse3.2be pushedinformalHave very little of something, especially time. I'm a bit pushed for time at the moment4informal with object Promote the use, sale, or acceptance of. the company is pushing a $500 asking price Example sentencesExamples Global sales have pushed Hyundai to seventh place, ahead of both Honda and Nissa", "n. Froggatt has been using some of the cost savings to invest in a series of marketing campaigns, which appears to be pushing up profits and sales of some of S&amp;N's core brands. Strong memory sales helped push AMD to a solid second quarter, the company reported today. Nevertheless, he mentioned that promotion activities that usually push up the sales figures had been stopped because of the strike. He's pushed the Yell sale - which has been in limbo for years. I know America keeps pushing Europe to accept Turkey. Public sympathy pushed the Sorbonne to promote her to her dead husband's professorship. Dr Dorothy Faulkner, an expert in the social and intellectual development of children, says that publicity about bad forms of play could be pushing up traditional toy sales. One upcoming promotion will push the redesigned CNN Headline News to the local ad sales community. He thinks Sindi pushed Stuart into accepting and that he only said yes because he doesn't really trust her. Synonymsadvertise, publicize, promote, give publicity to, bang the drum for, beat the drum for, popularize4.1 Sell (a narcotic drug) illegally. Example sentencesExamples Their example has fostered the establishment of another woman to pushing drugs in another area and to prosper. Ah, the shadowy evil dealer, pushing drugs outside the school gate. We want to know who, what, where, when and if possible, how they know someone is pushing drugs. As a result she ended up in the law courts for pushing drugs via her ever-popular soups and casseroles. Users should not be jailed, unless they were pushing others into the habit. While he adapts himself to life in the slums, he ", "also finds out there is money to be made in black-marketing false passports, pushing drugs and doing countless other small jobs. Once cannabis is legalised, the dealers will be taken out of the equation and the risk of them pushing harder drugs and the availability of harder drugs to the cannabis smoker is eliminated. But Shadow Home Secretary Ann Widdecombe said legalising cannabis would lead drug barons to push even more hard drugs. Police today declared war on drug dealers from London pushing cocaine, heroin and crack to children as young as 13. One kind of crime the former drugs squad officer is determined to come down on heavily, he warned, is the pushing of illegal drugs. Since they can't keep him in the designer sneakers he wants, young Marcus starts pushing drugs himself. Police sources said he had been arrested for pushing drugs. Side-effects and unforeseen deaths are part of the deal when you're pushing drugs. Cllr Wright said he was not an informer, but where drugs were concerned, he would have no problem informing on those pushing, selling and taking drugs. Of these junk messages, half are pushing drugs, a fifth promote porn and another fifth promote cheap software. They lie, rob, cheat, push hard drugs, intimidate innocent people and run protection rackets. Synonymssell, put on sale, put up for sale, offer for sale, vend, retail, trade in, deal in, traffic in, peddle, hawk, advertise5Computing with object Prepare (a stack) to receive a piece of data on the top.5.1 Transfer (data) to the top of a stack.6Photography with object Develop (a film) so as to compensate for deliberate underexposure.nounpʊʃpo͝oSH1An act of exerting force on someone or something in order to move them away from oneself. he closed the door with a push Example sentencesExamples Jess gave the door a slight push and it swung ope", "n. She sees the skin of her hand and pushes Neil out the door, ending the seduction for now. If it means more critics or voters seeing films in the theater, it's a terrific outcome, even if the push behind the move is incredibly faulty. Then he tried to push Alice away gently trying not to hurt her bruises from the previous night but she wouldn't move with his gentle push. With a gentle push from another locomotive from behind, Flying Scotsman broke through a banner declaring Railfest open to the sound of the City of York Pipe Band. There is a push now to move the drugs over the counter. I pushed the handle down and gave a gentle push upon the door. Not so much as a push - absolutely no physical contact - just words. Mark said, giving her a small push through the door and closing it behind her. Just push open the door and walk straight up to the bar. The corporation is fighting a push by creditors to move the former energy trading giant's bankruptcy case from New York to its hometown of Housto", "n. Michaels shoved me into the backseat with a harsh push and slammed the door in my face, and I realized it has been a while since a cop has done that to me. There was a push, a punch and another blow then a complaint to the police. The move follows a government push to recruit 3,000 matrons across the country as part of a major plan for the National Health Service. The move is the latest push by baseball to increase its marketing to younger fans - and make money along the way. Instead, though, I gave Anna a little push, and they moved sideways to the locker beside me. The Chinese are reportedly already a slight majority but new plans indicate a big push to move more settlers i", "n. He patted me on the back and gave me a slight push to the door as if I should do it right now. Finally I gave him a push and slammed the door in front of his face. Spitz looked back at the wisecracking Kai and with a little push, Kai was knocked out agai", "n. Synonymsshove, thrust, ram, bump, knock, hit, jolt, butt, prod, poke, elbow, nudge, shoulder, jostle1.1 An act of pressing a part of a machine or device. the door locks at the push of a button Example sentencesExamples In just 20 seconds, the fully automatic, insulated roof retracts at the push of a button - and back again should the weather tur", "n. The air-taxi service's telephone number, programmed into Len's sat phone, is no more than the push of a memory button away. Then, with the push of a button, I erased the number from memory. Printing great quality images is now possible directly from the Gallery with just a few pushes of a butto", "n. The work suggests a metal contraption, perhaps an explosive device that could be detonated with a push of the beige butto", "n. This is handy, but the machine does not remove them with a push of the button - you have to do the prewash treatment yourself. You can make tactical heads-up navigational displays for your vehicles with the push of a butto", "n. The push of a button should reconnect power automatically when power is restored. The electric beds, which can be raised and lowered at the push of a button, will help give patients more control and independence. And then, with a push of a single button, the drink will be concocted before his very eyes within a matter of seconds. With the push of a button, the narrow barrel of his device glowed and a beam of light issued from where blasts usually came. The rest push completely into the device and are ejected with a small eject button to the right of the slot. The sound can usually be turned off by a button push. Two short pushes of a button enable the operator to direct the system manually, and zoom in on the strange object, which has almost vanished between the waves. The computer is turned on by a long push of either butto", "n. With the push of a button the hatch swung open immediately reducing the million pigeons to just under a million with a wet feathery splat. With a single push of a button, you can replay the last incoming transmission and up to 16 messages. They had an automatic phone fitted in his office, preprogrammed to enable him to reach other numbers at the push of a single butto", "n. Go from the acoustic response of a baroque concert hall to that of a 10,000-seat arena or a gothic cathedral with the push of a butto", "n. Information is limited to only that which is host often used and is accessible with only a few pushes of the butto", "n.1.2 Something that encourages or assists something else. the fall in prices was given a push by official policy2A vigorous effort to do or obtain something. many clubs are joining in the fund-raising push he determined to make one last push for success Example sentencesExamples This push into music is the start of a daring effort to reinvent one of the world's best-known brands. Tindal Street Press gives the genre a push onto the bookshelves. The Yorkshire Dales National Park Authority is revitalising its network of information points and is urging local shops, pubs and cafes to join in the promotion push. They were amazing during our promotion push last seaso", "n. The Lartigue Monorail Restoration project has started its final fundraising push at a special press briefing in Listowel. He says the decision would ", "also complement the current push to regulate the labour hire industry and ensure employers did not use labour hire to undercut the award system. It attributes this growth to more affluent online shoppers, an ecommerce push by traditional retailers and the aggressive promotion of online stores. As reported in Monday's Evening Press, York Police have launched a new push to remove beggars from York's streets. Nevertheless, the triumph gave York their first double of the league campaign and it could yet prove crucial in both side's promotion pushes. The push into the enterprise space makes sense. Jerry Gill is already looking forward to a promotion push with Cheltenham next season as he reckons their young bucks will be even better next term. He noted that the TV station's ratings have responded to recent programming changes, and a strong push of promotion will help even more. In an effort to maintain the push, Operation Impact has forged a partnership with Crimestoppers. So was the long push to get the case before a jury worth the effort? The company's ambitious push to drive the brand upmarket risks hurting its existing premium marque, Audi. A series of events is ", "also planned as part of the fund-raising push. The visitors were denied a third goal on 69 minutes when Sills crashed a powerful volley into the roof of the net but his effort was ruled out for an innocuous push. That it continues to provide solace to readers long after the initial marketing push. The weekend's traffic effort from the Gardai was part of a national push to clamp down on dangerous and drunken driving. However, over the last month the manager has noticed a marked improvement in their standards and he now believes that his side are ready to embark on a serious promotion push. It's part of a fundraising push that will ", "also see an internationally renowned pianist play the £11,000 grand piano at Swindon's New College. The nonpartisan effort, sponsored by a coalition of local groups, pushes registration at venues such as clubs and restaurants. A leading campaigner in the push to reopen Rochdale Canal has called on Rochdale Council to act swiftly to create a boatyard in Littleborough. Synonymsendeavour, striving, effort, exertion, labour, work, toiling, pains2.1 A military attack in force. the army was engaged in a push against guerrilla strongholds Example sentencesExamples American forces then embarked on the long push to Tokyo. The Allied forces co-ordinated a major push from the spring and, in April, the British pushed forward in the battle of Arras. The Marines need a divisional push to seize Fallujah and they don't have the me", "n. A Communist push from the highlands to the sea to cut South Vietnam in half and isolate Saigon appeared in the offing. The allies had concentrated the bulk of their troops to the north in advance of the push towards Germany, and this had left the US forces at the Ardennes thinly spread. The push to downsize the military and privatize functions means government contracts are a growth industry. The push of the main group of forces should be directed at exploiting success and thwarting the enemy's attempts to restore its defenses. Once Morocco was secure, it served as a major base for U.S. bombers and as a logistics center for the push toward Tunisia and Sicily. It was too easy for some units we saw to take a final break before the big push into Iraq. The Biafran army then went on the offensive in a push towards Lagos. Now, all this comes on the heels of what was the deadliest attack here since the they ended their push, their offensive near the coast. The re-election of the president is expected to be followed in short order by a massive US military push into the desert city. The Pentagon is making a serious push to pull US forces out of Balkans altogether. It is the latest U.S. military push against the insurgency. He was convinced that a major US military push into Najaf was not far away. We hit the targets at night in a final push against the terrorist's stronghold near the airport. Now, these attacks come, as you say, amid day three of the military's latest push against insurgents in the western desert. With the rapid push to Baghdad, our mission changed often, as did the CSB's task organizatio", "n. In Iraq, the military has launched another push against insurgents in the region where the rebellion continues to rage. Despite the military push, a rocket which was fired from Gaza landed in an open area of Israel's Negev Desert overnight, causing no damage or injuries. Synonymsadvance, drive, thrust, charge, attack, assault, onslaught, onrush, offensive, sortie, foray, raid, sally, invasion, incursion, blitz, campaign2.2 Forcefulness and enterprise. an investor with the necessary money and push Example sentencesExamples These men, who ‘do not let the grass grow under their feet’, are clearly all push and enterprise. Synonymsdrive, initiative, enterprise, enthusiasm, eagerness, ambition, motivation, go, dynamism, energy, gusto, vigour, vitality, verve, fire, fervourPhrasesget the push (or shove)1informal Be dismissed from a job. four PR people are getting the push Example sentencesExamples What does John Tamihere have to do to get the push from Labour? Yet the committee-bound European elite, with their ludicrous consensus-based politicking, will almost assuredly be unable to muster up the courage to give him the push. This was compounded further when Ronnie Burns was given the shove, and headed to Adelaide to join national uber scapegoat-in-the-making Wayne Carey. ‘You've done as much as you can with the paper,’ declared Ken Cowley, the News Corp managing director, when he gave me the shove. When Colonel Lourake came to visit me here, he gave me the push. Eisner's position is not all that secure, and if his going was the difference between the renewal of the Pixar deal, or the loss of the Pixar deal, then conceivably the board might give him the shove. John Smith, the £205,000 a year chief executive of the Post Office, is getting the push for not being ruthless enough. The luminescent bruises on that aggrieved ego are so obvious, the Professor can't help wondering if the column was penned within minutes of Farmer Phil learning that he was set to get the shove. They want pointy end fighters, and that is why DC got the shove from McLaren, and why I think Sir Frank Williams will give him the cold shoulder too. If he cannot back up such madness, and there isn't a hope in hell he will be able to, then Ladbrokes have to give him the shove. Synonymsthrow out, remove, eject, expel, turn out, turf out, fling out, force out, drive out, evict, dislodge, oust1.1Be rejected in a relationship. Example sentencesExamples I just hoped Rebecca wouldn't give him the shove, like she does with most of the guys that showed interest in her. As Gloria, his fiancée of five years who gets the push, Jessica Walker is a perfect screech, with a classic mother to match in Carol Wilso", "n.give someone the push (or shove)1informal Dismiss someone from a job. it's hard to psych yourself up to get another job after you've been given the push1.1End a relationship with someone.push one's luckinformal Take a risk on the assumption that one will continue to be successful or in favor. Example sentencesExamples On the other hand, you are pushing your luck if you try to pull off heroic endurance feats every day. The wild cards afford you the luxury of being able to push your luck with no risk. He was basically pushing his luck, but seemed unaware of it. Sure it was a risk to be pushing his luck so soon, but he was having a great time with Krystal and dreaded the fact that their evening would be coming to an end. As Brendan was leaving the church, and by this time definitely pushing his luck, he spoke to the priest who had officiated at the service. Those girls pushed their luck though when they suggested we might feel more comfortable someplace quieter. ‘You could be great, along with my help,’ he continued, pushing his luck. Your parents have agreed to let you go for the party, don't push your luck by asking them to let you stay late. He must always be out there, pushing his luck, trying new things, taking a carefully calculated risk. The tradition ended abruptly when he pushed his luck too far and alienated the avowedly nationalist group by telling them that they must support the principles of unionism.when push comes to shoveinformal When one must commit oneself to an action or decisio", "n. when push came to shove, I always stood up for him Example sentencesExamples Is it possible you're totally wrong about North Korea, that the country is in such terrible shape that when push comes to shove, its military is going to turn out to be in just that kind of shape as well? But I think, when push comes to shove, he'll be there with us. The good characters are decidedly saintly, and the bad guys aren't really all that bad when push comes to shove. But when push comes to shove, my greatest enjoyment can be summed up in one word: shopping. But, two, I think it really helped when push comes to shove. But when push comes to shove, he sold out to preserve his place in the party, and all for a man whose campaign attacked his family to score political points only 4 years ago. I think when push comes to shove, the young people of the United States will react the same as generations before them. While we'll work as a team, ultimately, when push comes to shove, Michael will have the final say. They sometimes say they are, but in fact when push comes to shove, they are no more interested in the weaker clubs than they are in clubs that are not in Victoria. But again, I've got to think when push comes to shove, he won't do it. Synonymseventually, in the end, in the long run, at length, finally, sooner or later, in time, in the fullness of time, after some time, in the final analysis, when all is said and done, one day, some day, sometime, at last, at long lastPhrasal Verbspush aheadProceed with or continue a course of action or policy. he promised to push ahead with economic reform Example sentencesExamples Instead of pushing ahead with a compulsory scheme in the short term, the Government will introduce draft legislation in the Queen's speech this month as the first step towards a voluntary system. Coca-Cola continues to push ahead with the establishment of more local bottling plants. He said that it was important to establish a new use for the site quickly, but this would not inhibit the council from pushing ahead with plans to help the 260 Thrall workers find new jobs. As for the future, En Foco will continue to push ahead with more emphasis on the journal. The county council is pushing ahead with plans to introduce by-laws increasing the speed limit on its section of the same road from 80 kmph to 100 kmph. Now the Food Standards Agency Scotland is pushing ahead with legislation that will force manufacturers to disclose any traces of the most dangerous dozen ingredients of food. But with China pushing ahead with development on its side, and near the border, Japan worries that the resources on its side will be affected. Since then the Town has continued to push ahead with the project on its ow", "n. The Scottish Executive, however, attracted the bulk of criticism for increasing stress on teachers by pushing ahead with a policy of reducing the number of pupils being excluded from school. She questioned the wisdom of the U.S. pushing ahead with a programme for which there is little or no scientific basis that it will be successful and which would be astronomically expensive.push alongGo away; dep", "art.push someone around (or about)Treat someone roughly or inconsiderately. Example sentencesExamples It appears that perhaps unconsciously you are attracting partners who push you around and treat you badly because at a deeper level you may still carry negative belief patterns from your childhood. Maura pushed her around, Dinah had pushed her around, Chase pushed her around, everyone pushed her around, but Piper was going to stand up her decision this time. You must hold your head up high and not allow those bullies to push you around. Sing along, now dad, dad, why did you let that man push you around like that? Nobody is pushing us around or has ever pushed us around on West Indian wickets. Nobody has succeeded in pushing me around before and now I'm even freer and in a better position to do my best for Bradley ward and Nelso", "n. Everyone pushes us around, but the minute we get just a little bit of power, we exercise it to the fullest without prudence or thoughts on what it is doing to us in the bigger picture. It means that part of what you should develop about your life is not letting people push you around. All those years he made fun of me, bullied me, pushed me around, I think that it was his cry for help. They are going to push you around as much as a big corporate client. Synonymsbully, domineer, boss about, boss around, ride roughshod over, trample on, tread on, bulldoze, abuse, mistreat, maltreat, kick about, kick around, browbeat, lean on, tyrannize, intimidate, threaten, torment, terrorize, victimize, pick onpush offUse an oar, boathook, etc., to exert pressure so as to move a boat out from shore or away from another vessel. Example sentencesExamples But when he tried to push off the block to get moving again, the block slid across the floor too. Finally, it did, and though the orders that followed were to return to ship, a squall blew up and the boats could not push off. Once in the boat she ‘gets possession of an oar’ and pushes off. She too had got possession of an oar, and had pushed off, so as to release the boat from the overhanging window-frame. Shapovalov pushes off for Ukraine in the men's four repechage. The water was shallow enough, and the bottom varied enough, that they often touched up against a rock of bit of sandbar, and when they did, they reacted instantly, pushing off against it to move laterally. He helped me into the boat, then pushed off and jumped in himself. Come right up to the bank to let her out, push off and be back again as soon as she was. Push the ball behind your back toward your left hand as you push off your right foot to start moving to your left. They pushed off the shore, rowing through the ice of the wide Delaware.push onContinue on a journey. the light was already fading, but she pushed on Example sentencesExamples By now, both were very fatigued, but they both pushed o", "n. Pace yourself with a pause at a cafe, in a square or park, before pushing o", "n. After a week and a half of catching up on sleep and drinking enough wine to prop up the economy, we begin thinking about pushing on to the island of Faial. Two gunmen were arrested and, as heavy fire could still be heard ahead, Major Hollister pushed on with just two of his me", "n. They advanced some two to three miles to a roundabout Capt Cosby described as the gates of the city before pushing o", "n. It would be a lovely journey, so people kept pushing o", "n. The pair pushed on first to Lion-sur-Mer, then Hermanville-sur-Mer, before they set up their station in Cae", "n. We acclimatise with two nights in Namche before pushing o", "n. The middle westerner pushes on, endures, and finally finds a place that looks like home. A short photo stop soon cooled us down, before we pushed on up the hill carrying the weighty bags of tackle and camera gear. Synonymscontinue one's journey, continue on one's way, carry on, advance, press on, progress, make progress, proceed, go on, make headway, gain ground, push forward, forge ahead, go aheadpush something throughGet a proposed measure completed or accepted quickly. Example sentencesExamples If justice can be done, I have no objections - and provided the defence have got time to prepare a proper defence and the cases are not pushed through too quickly. Abbott's package was the government's third attempt in a year to push its measures through parliament. Indeed, these laws have been pushed through as silently and quickly as possible precisely so as to avoid such a discussio", "n. She's really focussed on looking outwards rather than inward and she's prepared to push innovative measures through the Scottish parliament. The company strategy is about teamwork and pushing good ideas through the system as quickly as possible, with superior dedication from all divisions within the company. But in the years ahead, as the fiscal squeeze tightens, the sense that some politicians took advantage of our trauma to push this measure through will not help our new-found sense of national unity. Surely a chicane system should be considered before the proposed measures are pushed through. In part, school-to-work manifests itself as a desire to push students through universities and colleges quickly, to train rather than educate them. Local authorities are creating problems for themselves in trying to push such ventures through so quickly. More than 100 of the party's MPs have signed motions criticising the government's plans and he faces a bruising battle to push the measure through the Commons.OriginMiddle English (as a verb): from Old French pousser, from Latin pulsare ‘to push, beat, pulse’ (see pulse). The early sense was ‘exert force on’, giving rise later to ‘make a strenuous effort, endeavor’.verb.1 phr. phr.", "v."]}], "usphone": "", "ukphone": ""}