{"name": "hang on to", "trans": [{"dict": "English_II", "values": ["紧紧握住", "依靠", "求助于"]}, {"dict": "Oxford5000", "values": ["a peg to hang something onSee peg1peg1 nounPlural pegs pɛɡpɛɡ1A short pin or bolt, typically tapered at one end, that is used for securing something in place, hanging things on, or marking a positio", "n. she put her mac on a peg in the hall Example sentencesExamples On each end of the board, tack a peg with one end pointed. Non-ferrous jointing methods include simple timber pegs and cord or rope bindings. It was a pretty rough climb, I didn't get even half way down when I decided I needed to come back with ropes, pegs and a harness. Overlap the edges by a few inches and anchor the fabric to the ground with wire or plastic pegs made for the job. They ", "also had to place pegs in the ground with the letters ‘C’ and ‘F’ painted on them to mark the survey. There he stops, sticking a peg into the ground, and tells his companions to start digging at that spot. The surveyors hammered a peg into the ground which was removed by campaigners prompting Mr Bradbury to claim that his party was being obstructed in its legal work. Hand-carved wooden pegs - never nails, screws, or anything else metal - are driven in with stone hammers. These openings in the rock were an ideal place to hammer in ‘pitons,’ spikes or pegs used for safety and sometimes support. Wooden pegs and hand-made nails held everything together. Part of the installation process was to pound some pegs into the ground to secure the swing set. A few extra pegs for the changing room are undoubtedly already on order. It's helpful to stand back from the ball and survey the terrain before you put your peg in the ground. After looking around the ground floor they removed the coat from a peg in the main corridor and walked out of the club through the front. We rode to the lake where I saw 3 more horses tied to a peg stuck in the ground. He proceeded to rush up and down the line of pegs, throwing the members' hats on to the floor. Instead it's all held together with dowels and pegs. Use pegs or hooks to store towels as well as coats. While his partner had been busy with that job, Haig had driven pegs into the ground, marked out a grid and plotted the positions of the signals from his metal detector. In addition to cutting beams to length, it's often necessary to drill holes for bolts, pegs and other fasteners, as well as for wiring and plumbing. Synonymsspike, pin, nail, dowel, skewer, rivet, brad, screw, bolt, hook, stick, nog, spigotNautical fidCurling hackQuoits hobMountaineering pitonGolf teeRowing thole (pin)rare knag, spile1.1 A pin or bolt driven into the ground to hold one of the ropes or corners of a tent in positio", "n. Example sentencesExamples Darryl hummed inscrutably and looked back down at the tent peg he was trying to hammer into the ground. The action is not unlike pushing a tent peg into the ground. Claire sat in her traditional spot behind the tent peg. She put her hand to the tent peg and her right hand to the workmen's mallet. There was a barely noticeable thump, and then a scratchy sort of noise as a peg landed on the ground. Her opponent slipped on a patch of ice, and fell, cracking his head on a tent peg. Three hours later, we discovered that we were six pegs and two rods short of a tent. Close kin, brothers, and fathers position their tents so that the tent pegs overlap and the guide ropes of the tents cross one another. Taylor's Soy Works Corporation is ", "also considering prototypes for future beanware: biodegradable camping equipment, such as cups, tent pegs, and ground sheets. We covered up the skidoos with their nylon covers and secured them by anchoring them with tent pegs and guy ropes. The structure holding the chamber top is fixed to the ground in four locations with 30 cm steel tent pegs (not shown). Judges are looking for taught guy ropes and all tent pegs where they should be, otherwise time penalties are imposed. A brolly is owned by most anglers but not as many take guide ropes and tent pegs. The up-and-down swinging arms are on a plane to drive a tent peg into the ground. He carefully spread out a ground-sheet and began hammering pegs into the ground.1.2British short for clothes peg Example sentencesExamples Half-hidden by the billowing linen, there was a half-full tub of laundry and a handful of pegs scattered on the ground. The washed garments are rinsed in a little fresh water and hung outside with pegs over the tent ropes to freeze solid. Number two and three has to be a clothes line and pegs. If my laundry hadn't dried and the sun was out, with a string round the panniers and a couple of pegs he was a clothes horse as literal as any you'll find.1.3 A bung for stoppering a cask. Example sentencesExamples Period pieces show a fire polished finish on the peg of the stopper. Synonymsstopper, stop, plug, bung, spigot, spile, seal1.4informalA footrest on a motorbike. Example sentencesExamples Your feet rests on pegs, your back is flat on the board and your head is slightly elevated so you are able to see where you are going.2A point or limit on a scale, especially of exchange rates. the Mexican peso, linked to the dollar by a crawling peg, was distinctly too high Example sentencesExamples For now, the government wants to keep the peg and see what happens next. ‘There is very little chance that the peg will be maintained forever,’ Chung, a director for ratings, said from Shanghai. In between Japan and the U.S. are European views that there is no ideal exchange rate regime for all countries and that currency pegs can only be useful in certain circumstances. It is obviously not always feasible to operate with tight exchange rate pegs, such as the currency board, and larger economies find it particularly difficult to maintain such constructions. We suspect that the Chinese peg has had a major impact here. This exchange rate peg with gold remained a major political issue until McKinley's election in 1896. The peg will limit the powers of the central banks. So long as countries were committed to defending their exchange rate pegs, there was no possibility that they would succumb to policies of sustained inflatio", "n. Labor unions supported the exchange-rate peg as a means to control prices and the inflationary pressure on salaries. The Bush administration wants it to end the peg eventually. Perhaps this announces a new swing of the policy pendulum back in favor of pegs? The exchange rate peg is gone, and the peso is trading at substantially depreciated exchange rates against the dollar. Now, the government has admitted it can't sustain its old policies, of which the dollar peg is the last vestige. Indeed, as Rogoff suggests, abandoning the peg to the dollar could be seen as abandoning China's commitment to stable and sustainable macroeconomic growth. These crises had compellingly shown that holding on to a preannounced peg of the exchange rate does not increase the credibility of the announced policy. Under flexible rates, central banks need not use interest rates to preserve an exchange-rate peg. The peg has served us very well for more than 21 years and given us the stability we needed over the Asian financial crisis. The IMF ploughed money into the country to help it sustain the peg, pledging an extra $22 billion as late as the end of 2000. To be credible, a peg requires tight fiscal and monetary control. Here, the clearest policy conclusion is to abandon the dollar peg for good, especially since hyperinflation fears appear unwarranted.3Indian A measure of spirits. have a peg of whisky Example sentencesExamples I stopped smoking eight months ago and alcohol is reduced to two pegs once a week. Most drinking scenes in films start with the dialogue ‘you drink two pegs and forget all worries.’ He went and told Grierson about the bet that he had with Barua - a peg of whisky, which would knock a mule over. He had settled himself comfortably as if he had all the time in the world, ordered a large peg of his favorite Scotch whisky, and then, things just went out of control. Then it's over to flashy dance floors and fast pulsating music that becomes all the more stirring after quaffing a few mugs of chilled beer or a few pegs of booze.4A place marked by a peg and allotted to a competitor to fish or shoot from. Example sentencesExamples There are four good pegs on this short stretch and on their day they are amongst the best on the river. There are some ten to fifteen fishable pegs here, over a distance of about half a mile. Virginia fished on peg 8 whilst I fished next door in peg 7 casting out to the island to my left. The chosen venue was the far bank, below the dam, and we fished pegs three and four. Often miles of river will be almost devoid of decent fish, whilst a few hot pegs will be flogged to death.5informal A person's leg. I have a good right peg and the ball ended up in the back of the net Example sentencesExamples Chic is idly caressing the ball with his left peg. I'd like Southwell to use his left peg more to drive the ball deep into the opposition's half. Synonymslower limb, shank6Baseball A strong throw. Example sentencesExamples Meanwhile, Santa rounded third and headed for home, as the shortstop finally came to his senses and threw a perfect peg to catcher Yunir Garcia, who held the ball in a collision at the plate. The peg from shortstop required unimaginable effort. Conine scored easily, but as Encarnacion headed home, Boone cut off a strong peg from Matsui and fired across the diamond to try to hold Pierre, conceding the ru", "n. Karim Garcia's strong peg off the carom nearly nailed Manny as he nonchalanted his way to second base. Miraculously, Posada managed to find the ball, whirl and throw a perfect peg down to second to impale the Impaler.verbpegs, pegged, pegging pɛɡpɛɡ1with object and adverbial Fix, secure, or mark with a peg or pegs. drape plants with nets, pegging down the edges Example sentencesExamples The lines on the docks were basic things: narrow gauge steel tracks pegged directly to the ties. Propagate strawberry plants once the crop is finished by pegging down a couple of runners from your best plants. Synonymsfix, pin, attach, fasten, secure, make fast1.1 Hang (washing) on a line with clothes pegs. clothes were pegged out on a line Example sentencesExamples Mum, who had been a nurse, seemed to be endlessly pegging nappies on the line, and I always had a small sister on one hip. Each time I reached up to peg my wet clothes out in the hot sun, I thought of homes where this is the last thing they are thinking about. Looking at them pegged on the line they look somewhat exiguous in nature. When you wash the sheets and when you reach up to peg them on the clothesline, you can feel the wet cotton against your skin and it's all cool like slipping into a swimming pool. Greying women potter in flower beds across the fence from pregnant mums pegging washing.1.2 Allot a specified place to (a competitor) in a fishing or shooting competition by means of a marker. we've been pegged next to the winning team2with object Fix (a price, rate, or amount) at a particular level. the dividend was pegged at 23.59p Example sentencesExamples The only saving grace for the moment is that mortgage rates are pegged at reasonable levels, thanks to the EU Bank. Prices of 110 items, all wages and salaries, and transport rates were pegged at the 15 December 1942 level. In response for their support, rates were pegged at their present level for three years in return for keeping its peak-time audience at last year's level. The exact wage varies, but is usually pegged at the amount needed to keep a working family off welfare and other government subsidies. Wage levels were pegged but prices were rising. Its price, currently $20, is pegged to the market price of black truffles. A second rate, recently 2.88%, is pegged to the inflation rate. Its design capacity was pegged at 25 million to 30 million passengers annually. For decades, the yuan has been pegged at a low rate to the US dollar. Officially, the unemployment rate is pegged at 16 percent, but many observers say it is closer to 30 or 35 percent. If this happens, the impact of the price cut will be immediately wiped out, because Australian petrol prices are pegged to world oil prices, measured in US dollars. The publishing industry defends its pricing policies, saying that foreign sales would be impossible if book prices were not pegged to local market conditions. Charges would only rise to £2 an hour if the council tax rise was pegged to five per cent. Tracker mortgages go up automatically because they are pegged to base rate. A student loan starts accruing interest from the moment it is borrowed, but the interest rate is pegged to the retail price index. If your rate was pegged at 6%, for example, it cannot go higher than that, but it can go lower if rates slide. On an average, the annual growth rate is pegged at 8 per cent but this is not guaranteed. But the most significant gap is with China, whose currency is pegged at a rate of about 8.3 yuan to the dollar. The exchange rate was greatly appreciated when it was pegged to the dollar in 1991. The rate is pegged at 0.99% above base rates for the life of the loan and redemption penalties apply for three years. Synonymshold down, keep down, fix, set, hold, control, freeze, limit2.1North American informalForm a fixed opinion of; categorize. the officer probably has us pegged as anarchists Example sentencesExamples I'd been interviewed by the police countless times since I'd found the body… but deep down I knew they had me pegged as a suspect. He has him pegged as a bad guy, and has no interest in trying to sway his opinio", "n. Or if your peers have you pegged as hopelessly dull, shock them. It doesn't come with the glamorous hernia ‘bulge,’ so my HMO's team of medical geniuses had it pegged as an abdominal strain for three months. Potential recruits from out-of-state may have it pegged as isolated, provincial, and homogeneous - not to mention awfully cold in winter. Until recently, the vast majority of telecoms investment professionals had Africa pegged as simply too risky to warrant serious attentio", "n. Most of Canada has him pegged as an ethically challenged dirtball. I had you pegged as weak-minded and subservient - Plinn's little puppet. You will ", "also take a letter home to your parents that they will sign, or I'll make sure the school board has you pegged as a troublemaker for the rest of your high school career, am I understood? He is being pegged as the organization's best defensive center fielder. While they uncovered many interesting things, such as one of the females they'd pegged as a likely target actually being a transvestite, they came no closer to identifying their quarry. One of the latter was a comment that immediately pegged the reviewer as someone from academia. If Jessica was right, she definitely had Michael pegged as a perfectionist, no doubt that carried over into his career as a choreographer as well. You know, I never pegged you as the clubbing sort. For one thing, both artists and athletes are usually pegged at a young age as gifted or talented. In case anyone has me pegged as a reliable apologist for the pharmaceutical industry, I'd like to direct you to this article in the Sunday New York Times. That's another printmaker that has me pegged as a lunatic. ‘Right from the beginning I had myself pegged as a poor liar,’ she says. When one of the dealers is arrested, the gang pegs the new convert as an informer and administers a vicious beating.3Baseball with object Throw (a ball) hard and low. the catcher pegs the ball to the first baseman Example sentencesExamples You know sometimes when the pitcher sees the guy on first inching his way towards second and pegs the ball to the first baseman, in a feeble attempt to get the fella out? Molly pegged the ball and it hit her in the face. Jamie backed away and pegged the ball, which Brian missed. Synonymsthrow, toss, fling, pitch, cast, lob, launch, flip, catapult, shy, dash, send, bowl, aim, direct, project, propel, fire, let flyPhrasesoff the peg(of clothes) ready-made.as modifier budget off-the-peg outfitsNorth American term off the rack Example sentencesExamples The former can be bought more or less off the peg; the latter have to be tailored to fit. Oh, it's off the peg, rather than designer, but, well, a girl has to do what a girl has to do. The woman in the former dressed off the peg and came from an ordinary family. You can order your dream garment or buy off the peg. Mr Smith goes on: ‘At this time there was not a lot of choice for women buying off the peg, so Poppy's business was in high demand.’ It's not about going into a shop, buying an item off the peg and taking it home. They had a choice of suits that fitted me off the peg (including 1 under £100)! I used to get most of my good suits and jackets off the peg from Simpson's. I doubt they'd be able to get a uniform off the peg for me. They can be bought off the peg or made-to-measure and are in demand for all kinds of events including weddings, parties and a day at the races. Synonymsready to wear, off the shelfa peg to hang something onSomething used as a pretext or occasion for the treatment of a wider subject. he is used as a peg on which to hang the intricate meshwork of diplomatic relationsa square peg in a round holeA person in a situation unsuited to their abilities or character. low self-esteem can be exacerbated by a sense of being a square peg in a round hole Example sentencesExamples Despite her obvious sophistication today, she spent much of her life as a ‘rebel without a cause’ or even perhaps a square peg in a round hole! He's still a bit of a square peg in a round hole here, which I'm sure is at least somewhat intentional, but it proves to be somewhat detrimental this time around. She was still a square peg in a round hole, trying to get her head around a system, timetables, a rigid curriculum and attitudes that didn't take into consideration her particular needs. He admits to having concerns that he may have become a square peg in a round hole. Asked to play out of position and he looked like a square peg in a round hole in the first half. She said: ‘I was like a square peg in a round hole.’ But far from being the final piece in the jigsaw, Veron has looked more like a square peg in a round hole. Whatever other charges may be levelled at him, he cannot be accused of having been a square peg in a round hole. He said, you look like a square peg in a round hole. She was not prepared to be a square peg in a round hole.take (or bring) someone down a peg or twoMake someone realize that they are less talented or important than they think they are. good to see United taken down a peg or two last evening Example sentencesExamples I might take him down a peg or two, you know, as a Christmas present. Well if we take him down a peg or two, then at least they'll get the chance to do what they want instead of him telling them what to do all the time. No matter how good you think you are, horses will always take you down a peg or two. That's when you want to take him down a peg or two. But having puffed us up to bursting point the agency then decided to take us down a peg or two. Nothing makes for taking you down a peg or two like public humiliatio", "n. But in the long run, it's a good hurt, because it takes you down a peg or two and reminds you what you're supposed to be doing in the first place. These things, no matter how awful or how great, can really take us down a peg or two. And Davis, who is back in the world's top 16 after an absence of some years, has his own personal reason for wanting to take Williams down a peg or two. She wanted to know what this boy was all about, and take him down a peg or two, if at all possible. Synonymshumble, humiliate, mortify, bring down, take down, bring low, demean, show up, shame, put to shame, make ashamed, discomfit, disgrace, discredit, downgrade, debase, degrade, devalue, dishonour, embarrass, put someone in their place, make a fool of, chasten, subdue, get the better of, have the last laugh on, abash, abase, crush, squash, quash, deflate, flatten, make someone eat humble piePhrasal Verbspeg awayWork hard at or try to achieve something over a long period. the South African attack kept pegging away Example sentencesExamples The bottom of their post must have been square, but we kept pegging away and in the second half we got the goal and I think we deserved to share the points. But I just kept pegging away hoping something would work out for me as the race went on, and thank God it did. The West Indies bowlers pegged away determinedly, while the Sri Lankan batsmen were in no mood to throw away their wickets before the showers came. This opened up the game for Port Trust who kept pegging away consistently at the net. McGrath, Lee and Gillespie will be back, and of course Bichel, Williams and Bracken will ", "also be pegging away. Poppleton kept pegging away and deservedly equalised when a through ball found Christopher Green, who gave Harry Wright in the Real Cliffe goal no chance. In contrast, they kept pegging away and, with cooler finishing and a dash of the luck that has deserted them in recent weeks, that 50-point barrier would now be breachable at the weekend. But John pegged away at it for a long time, though he never got his way. Well done, boys, but keep pegging away and the results will come against teams not as clinical as the Aussies (everybody else). With that attitude, we'll just have to keep pegging away. Synonymswork hard, work away, hammer away, grind awaypeg someone backReduce or eradicate the lead of an opponent in a contest. they were pegged back by an equalizer from Jameson Example sentencesExamples Andrews pegged Stockport back to 10-12 with a well taken penalty from 30 yards out. It is the third time we have been pegged back and gone on to win at home and it was a tough game today. It was a good point for us against Norwich pegging them back like that. They pegged us back and then we drove back in an old set-piece move to get a bit of focus back. Within three minutes West Leeds had their first meaningful attack and they had a chance to peg Skipton back with a penalty, but the kick went wide. Just before half time Keighley were pegged back agai", "n. Failing to take their chances, they had been pegged back to a three-point lead by a side which they had outmuscled and outfought for the opening 40 minutes. However, by the time the field turned into the home straight, he had been pegged back by the chasing pack. Whenever Cambridge made an excursion into Sutton's half, he pegged them back with long, accurate kicks. We scored a goal, pegged them back as far as possible and created lots of chances.peg out1Die. she looked as if she might peg out any moment Example sentencesExamples The man grinding the flour suggested this activity was healthier than a modern gym workout (not that healthy, we decided: half of all Viking women pegged out at 35). After such a marathon 64 years on top, it was scarcely surprising when the Empress of India finally pegged out almost 100 years ago today. Chekhov pegged out while taking a cure in Badenweiler. I'll likely peg out in front of the tv on Friday night with the tension of it all. Synonymspass away, pass on, lose one's life, depart this life, expire, breathe one's last, draw one's last breath, meet one's end, meet one's death, lay down one's life, be no more, perish, be lost, go the way of the flesh, go the way of all flesh, go to glory, go to one's last resting place, go to meet one's maker, cross the great divide, cross the styx2Score the winning point at cribbage. Example sentencesExamples It is not necessary to reach 121 exactly - you can peg out by scoring 2 more when you were on 120 and still wi", "n.3Croquet Hit the peg with the ball as the final stroke in a game.peg something outMark the boundaries of an area of land. I went out to peg out our assembly area Example sentencesExamples It was expected to remain a small town and as a result only twenty-four townblocks were pegged out. The new kitchen is pegged out and a safety fence is going up tomorrow! Rex Watkins the siting coordinator said most of the site had been pegged out and numbered and he is confident the registration process will go smoothly. The first opal claims were pegged out but, as a result of the unbearable heat and the lack of water, work was abandoned within three weeks. Within a few days claims were pegged out, tents went up and a blacksmith opened up for business. It is essential the site is pegged out before the planning committee visits it, to eliminate any confusio", "n.OriginLate Middle English: probably of Low German origin; compare with Dutch dialect peg 'plug, peg'. The verb dates from the mid 16th century.Rhymesbeg, cleg, egg, Eigg, Greg, keg, leg, Meg, skeg, teg, yegg PEG2abbreviationPolyethylene glycol.nou", "n.1 phr. phr.", "v. abbr.1peg1 nounpɛɡpeɡ1A short cylindrical piece of wood, metal, or plastic, typically tapered at one end, that is used for holding things together, hanging things on, or marking a positio", "n. Example sentencesExamples These openings in the rock were an ideal place to hammer in ‘pitons,’ spikes or pegs used for safety and sometimes support. He proceeded to rush up and down the line of pegs, throwing the members' hats on to the floor. Instead it's all held together with dowels and pegs. On each end of the board, tack a peg with one end pointed. Hand-carved wooden pegs - never nails, screws, or anything else metal - are driven in with stone hammers. There he stops, sticking a peg into the ground, and tells his companions to start digging at that spot. Non-ferrous jointing methods include simple timber pegs and cord or rope bindings. Overlap the edges by a few inches and anchor the fabric to the ground with wire or plastic pegs made for the job. The surveyors hammered a peg into the ground which was removed by campaigners prompting Mr Bradbury to claim that his party was being obstructed in its legal work. It's helpful to stand back from the ball and survey the terrain before you put your peg in the ground. In addition to cutting beams to length, it's often necessary to drill holes for bolts, pegs and other fasteners, as well as for wiring and plumbing. We rode to the lake where I saw 3 more horses tied to a peg stuck in the ground. A few extra pegs for the changing room are undoubtedly already on order. It was a pretty rough climb, I didn't get even half way down when I decided I needed to come back with ropes, pegs and a harness. After looking around the ground floor they removed the coat from a peg in the main corridor and walked out of the club through the front. They ", "also had to place pegs in the ground with the letters ‘C’ and ‘F’ painted on them to mark the survey. Use pegs or hooks to store towels as well as coats. Wooden pegs and hand-made nails held everything together. Part of the installation process was to pound some pegs into the ground to secure the swing set. While his partner had been busy with that job, Haig had driven pegs into the ground, marked out a grid and plotted the positions of the signals from his metal detector. Synonymsspike, pin, nail, dowel, skewer, rivet, brad, screw, bolt, hook, stick, nog, spigot1.1 A pin or bolt driven into the ground to hold one of the ropes or corners of a tent in positio", "n. Example sentencesExamples Darryl hummed inscrutably and looked back down at the tent peg he was trying to hammer into the ground. She put her hand to the tent peg and her right hand to the workmen's mallet. Claire sat in her traditional spot behind the tent peg. Judges are looking for taught guy ropes and all tent pegs where they should be, otherwise time penalties are imposed. A brolly is owned by most anglers but not as many take guide ropes and tent pegs. Taylor's Soy Works Corporation is ", "also considering prototypes for future beanware: biodegradable camping equipment, such as cups, tent pegs, and ground sheets. Her opponent slipped on a patch of ice, and fell, cracking his head on a tent peg. There was a barely noticeable thump, and then a scratchy sort of noise as a peg landed on the ground. Close kin, brothers, and fathers position their tents so that the tent pegs overlap and the guide ropes of the tents cross one another. He carefully spread out a ground-sheet and began hammering pegs into the ground. Three hours later, we discovered that we were six pegs and two rods short of a tent. The structure holding the chamber top is fixed to the ground in four locations with 30 cm steel tent pegs (not shown). The up-and-down swinging arms are on a plane to drive a tent peg into the ground. The action is not unlike pushing a tent peg into the ground. We covered up the skidoos with their nylon covers and secured them by anchoring them with tent pegs and guy ropes.1.2 A bung for stoppering a cask. Example sentencesExamples Period pieces show a fire polished finish on the peg of the stopper. Synonymsstopper, stop, plug, bung, spigot, spile, seal2A point or limit on a scale, especially of exchange rates. Example sentencesExamples The Bush administration wants it to end the peg eventually. The IMF ploughed money into the country to help it sustain the peg, pledging an extra $22 billion as late as the end of 2000. Perhaps this announces a new swing of the policy pendulum back in favor of pegs? The peg has served us very well for more than 21 years and given us the stability we needed over the Asian financial crisis. The exchange rate peg is gone, and the peso is trading at substantially depreciated exchange rates against the dollar. ‘There is very little chance that the peg will be maintained forever,’ Chung, a director for ratings, said from Shanghai. So long as countries were committed to defending their exchange rate pegs, there was no possibility that they would succumb to policies of sustained inflatio", "n. Indeed, as Rogoff suggests, abandoning the peg to the dollar could be seen as abandoning China's commitment to stable and sustainable macroeconomic growth. For now, the government wants to keep the peg and see what happens next. To be credible, a peg requires tight fiscal and monetary control. Here, the clearest policy conclusion is to abandon the dollar peg for good, especially since hyperinflation fears appear unwarranted. Under flexible rates, central banks need not use interest rates to preserve an exchange-rate peg. This exchange rate peg with gold remained a major political issue until McKinley's election in 1896. We suspect that the Chinese peg has had a major impact here. These crises had compellingly shown that holding on to a preannounced peg of the exchange rate does not increase the credibility of the announced policy. In between Japan and the U.S. are European views that there is no ideal exchange rate regime for all countries and that currency pegs can only be useful in certain circumstances. Labor unions supported the exchange-rate peg as a means to control prices and the inflationary pressure on salaries. Now, the government has admitted it can't sustain its old policies, of which the dollar peg is the last vestige. It is obviously not always feasible to operate with tight exchange rate pegs, such as the currency board, and larger economies find it particularly difficult to maintain such constructions. The peg will limit the powers of the central banks.3Indian A measure of liquor. have a peg of whiskey Example sentencesExamples He went and told Grierson about the bet that he had with Barua - a peg of whisky, which would knock a mule over. Most drinking scenes in films start with the dialogue ‘you drink two pegs and forget all worries.’ He had settled himself comfortably as if he had all the time in the world, ordered a large peg of his favorite Scotch whisky, and then, things just went out of control. I stopped smoking eight months ago and alcohol is reduced to two pegs once a week. Then it's over to flashy dance floors and fast pulsating music that becomes all the more stirring after quaffing a few mugs of chilled beer or a few pegs of booze.4informal A person's leg. Example sentencesExamples I'd like Southwell to use his left peg more to drive the ball deep into the opposition's half. Chic is idly caressing the ball with his left peg. Synonymslower limb, shank5Baseball A strong throw, especially in baseball. Example sentencesExamples Meanwhile, Santa rounded third and headed for home, as the shortstop finally came to his senses and threw a perfect peg to catcher Yunir Garcia, who held the ball in a collision at the plate. Conine scored easily, but as Encarnacion headed home, Boone cut off a strong peg from Matsui and fired across the diamond to try to hold Pierre, conceding the ru", "n. Miraculously, Posada managed to find the ball, whirl and throw a perfect peg down to second to impale the Impaler. Karim Garcia's strong peg off the carom nearly nailed Manny as he nonchalanted his way to second base. The peg from shortstop required unimaginable effort.verbpɛɡpeɡ1with object and adverbial Fix or make fast with a peg or pegs. drape individual plants with nets, pegging down the edges Example sentencesExamples The lines on the docks were basic things: narrow gauge steel tracks pegged directly to the ties. Propagate strawberry plants once the crop is finished by pegging down a couple of runners from your best plants. Synonymsfix, pin, attach, fasten, secure, make fast2with object Fix (a price, rate, or amount) at a particular level. Example sentencesExamples Charges would only rise to £2 an hour if the council tax rise was pegged to five per cent. In response for their support, rates were pegged at their present level for three years in return for keeping its peak-time audience at last year's level. The exact wage varies, but is usually pegged at the amount needed to keep a working family off welfare and other government subsidies. Its design capacity was pegged at 25 million to 30 million passengers annually. Officially, the unemployment rate is pegged at 16 percent, but many observers say it is closer to 30 or 35 percent. Its price, currently $20, is pegged to the market price of black truffles. Wage levels were pegged but prices were rising. Tracker mortgages go up automatically because they are pegged to base rate. If your rate was pegged at 6%, for example, it cannot go higher than that, but it can go lower if rates slide. The rate is pegged at 0.99% above base rates for the life of the loan and redemption penalties apply for three years. A student loan starts accruing interest from the moment it is borrowed, but the interest rate is pegged to the retail price index. The publishing industry defends its pricing policies, saying that foreign sales would be impossible if book prices were not pegged to local market conditions. A second rate, recently 2.88%, is pegged to the inflation rate. Prices of 110 items, all wages and salaries, and transport rates were pegged at the 15 December 1942 level. For decades, the yuan has been pegged at a low rate to the US dollar. The only saving grace for the moment is that mortgage rates are pegged at reasonable levels, thanks to the EU Bank. If this happens, the impact of the price cut will be immediately wiped out, because Australian petrol prices are pegged to world oil prices, measured in US dollars. On an average, the annual growth rate is pegged at 8 per cent but this is not guaranteed. The exchange rate was greatly appreciated when it was pegged to the dollar in 1991. But the most significant gap is with China, whose currency is pegged at a rate of about 8.3 yuan to the dollar. Synonymshold down, keep down, fix, set, hold, control, freeze, limit2.1North American informalForm a fixed opinion of; categorize. the officer probably has us pegged as anarchists Example sentencesExamples You know, I never pegged you as the clubbing sort. ‘Right from the beginning I had myself pegged as a poor liar,’ she says. One of the latter was a comment that immediately pegged the reviewer as someone from academia. Most of Canada has him pegged as an ethically challenged dirtball. Potential recruits from out-of-state may have it pegged as isolated, provincial, and homogeneous - not to mention awfully cold in winter. He has him pegged as a bad guy, and has no interest in trying to sway his opinio", "n. It doesn't come with the glamorous hernia ‘bulge,’ so my HMO's team of medical geniuses had it pegged as an abdominal strain for three months. That's another printmaker that has me pegged as a lunatic. I had you pegged as weak-minded and subservient - Plinn's little puppet. Or if your peers have you pegged as hopelessly dull, shock them. I'd been interviewed by the police countless times since I'd found the body… but deep down I knew they had me pegged as a suspect. In case anyone has me pegged as a reliable apologist for the pharmaceutical industry, I'd like to direct you to this article in the Sunday New York Times. When one of the dealers is arrested, the gang pegs the new convert as an informer and administers a vicious beating. Until recently, the vast majority of telecoms investment professionals had Africa pegged as simply too risky to warrant serious attentio", "n. You will ", "also take a letter home to your parents that they will sign, or I'll make sure the school board has you pegged as a troublemaker for the rest of your high school career, am I understood? If Jessica was right, she definitely had Michael pegged as a perfectionist, no doubt that carried over into his career as a choreographer as well. While they uncovered many interesting things, such as one of the females they'd pegged as a likely target actually being a transvestite, they came no closer to identifying their quarry. For one thing, both artists and athletes are usually pegged at a young age as gifted or talented. He is being pegged as the organization's best defensive center fielder.3Baseball Throw (a ball) hard and low, especially in baseball. the catcher pegs the ball to the first baseman Example sentencesExamples Jamie backed away and pegged the ball, which Brian missed. Molly pegged the ball and it hit her in the face. You know sometimes when the pitcher sees the guy on first inching his way towards second and pegs the ball to the first baseman, in a feeble attempt to get the fella out? Synonymsthrow, toss, fling, pitch, cast, lob, launch, flip, catapult, shy, dash, send, bowl, aim, direct, project, propel, fire, let flyPhrasesoff the peg(of clothes) ready-made; off the rack.as modifier budget off-the-peg outfits Example sentencesExamples You can order your dream garment or buy off the peg. Mr Smith goes on: ‘At this time there was not a lot of choice for women buying off the peg, so Poppy's business was in high demand.’ The former can be bought more or less off the peg; the latter have to be tailored to fit. They can be bought off the peg or made-to-measure and are in demand for all kinds of events including weddings, parties and a day at the races. The woman in the former dressed off the peg and came from an ordinary family. They had a choice of suits that fitted me off the peg (including 1 under £100)! I used to get most of my good suits and jackets off the peg from Simpson's. It's not about going into a shop, buying an item off the peg and taking it home. Oh, it's off the peg, rather than designer, but, well, a girl has to do what a girl has to do. I doubt they'd be able to get a uniform off the peg for me. Synonymsready to wear, off the shelfa square peg in a round holeA person in a situation unsuited to their abilities or character. Example sentencesExamples Despite her obvious sophistication today, she spent much of her life as a ‘rebel without a cause’ or even perhaps a square peg in a round hole! He said, you look like a square peg in a round hole. She was still a square peg in a round hole, trying to get her head around a system, timetables, a rigid curriculum and attitudes that didn't take into consideration her particular needs. She said: ‘I was like a square peg in a round hole.’ Whatever other charges may be levelled at him, he cannot be accused of having been a square peg in a round hole. He's still a bit of a square peg in a round hole here, which I'm sure is at least somewhat intentional, but it proves to be somewhat detrimental this time around. Asked to play out of position and he looked like a square peg in a round hole in the first half. She was not prepared to be a square peg in a round hole. But far from being the final piece in the jigsaw, Veron has looked more like a square peg in a round hole. He admits to having concerns that he may have become a square peg in a round hole.take (or bring) someone down a peg or twoMake someone realize that they are less talented or important than they think are. Example sentencesExamples No matter how good you think you are, horses will always take you down a peg or two. And Davis, who is back in the world's top 16 after an absence of some years, has his own personal reason for wanting to take Williams down a peg or two. Well if we take him down a peg or two, then at least they'll get the chance to do what they want instead of him telling them what to do all the time. Nothing makes for taking you down a peg or two like public humiliatio", "n. That's when you want to take him down a peg or two. I might take him down a peg or two, you know, as a Christmas present. These things, no matter how awful or how great, can really take us down a peg or two. She wanted to know what this boy was all about, and take him down a peg or two, if at all possible. But in the long run, it's a good hurt, because it takes you down a peg or two and reminds you what you're supposed to be doing in the first place. But having puffed us up to bursting point the agency then decided to take us down a peg or two. Synonymshumble, humiliate, mortify, bring down, take down, bring low, demean, show up, shame, put to shame, make ashamed, discomfit, disgrace, discredit, downgrade, debase, degrade, devalue, dishonour, embarrass, put someone in their place, make a fool of, chasten, subdue, get the better of, have the last laugh on, abash, abase, crush, squash, quash, deflate, flatten, make someone eat humble piea peg to hang a matter onSomething used as a pretext or occasion for the discussion or treatment of a wider subject.Phrasal Verbspeg awayContinue working hard at or trying to achieve something, especially over a long period. Example sentencesExamples Poppleton kept pegging away and deservedly equalised when a through ball found Christopher Green, who gave Harry Wright in the Real Cliffe goal no chance. The bottom of their post must have been square, but we kept pegging away and in the second half we got the goal and I think we deserved to share the points. But I just kept pegging away hoping something would work out for me as the race went on, and thank God it did. In contrast, they kept pegging away and, with cooler finishing and a dash of the luck that has deserted them in recent weeks, that 50-point barrier would now be breachable at the weekend. The West Indies bowlers pegged away determinedly, while the Sri Lankan batsmen were in no mood to throw away their wickets before the showers came. But John pegged away at it for a long time, though he never got his way. This opened up the game for Port Trust who kept pegging away consistently at the net. McGrath, Lee and Gillespie will be back, and of course Bichel, Williams and Bracken will ", "also be pegging away. Well done, boys, but keep pegging away and the results will come against teams not as clinical as the Aussies (everybody else). With that attitude, we'll just have to keep pegging away. Synonymswork hard, work away, hammer away, grind awaypeg out1Die. Example sentencesExamples Chekhov pegged out while taking a cure in Badenweiler. After such a marathon 64 years on top, it was scarcely surprising when the Empress of India finally pegged out almost 100 years ago today. The man grinding the flour suggested this activity was healthier than a modern gym workout (not that healthy, we decided: half of all Viking women pegged out at 35). I'll likely peg out in front of the tv on Friday night with the tension of it all. Synonymspass away, pass on, lose one's life, depart this life, expire, breathe one's last, draw one's last breath, meet one's end, meet one's death, lay down one's life, be no more, perish, be lost, go the way of the flesh, go the way of all flesh, go to glory, go to one's last resting place, go to meet one's maker, cross the great divide, cross the styx2Score the winning point at cribbage. Example sentencesExamples It is not necessary to reach 121 exactly - you can peg out by scoring 2 more when you were on 120 and still wi", "n.3Croquet Hit the peg with the ball as the final stroke in a game.peg something outMark the boundaries of an area of land. I went out to peg out our assembly area Example sentencesExamples Rex Watkins the siting coordinator said most of the site had been pegged out and numbered and he is confident the registration process will go smoothly. The first opal claims were pegged out but, as a result of the unbearable heat and the lack of water, work was abandoned within three weeks. It is essential the site is pegged out before the planning committee visits it, to eliminate any confusio", "n. Within a few days claims were pegged out, tents went up and a blacksmith opened up for business. The new kitchen is pegged out and a safety fence is going up tomorrow! It was expected to remain a small town and as a result only twenty-four townblocks were pegged out.OriginLate Middle English: probably of Low German origin; compare with Dutch dialect peg ‘plug, peg’. The verb dates from the mid 16th century. PEG2abbreviationPolyethylene glycol.nou", "n.1 phr. phr.", "v. abbr.1"]}, {"dict": "Oxford5000", "values": ["a peg to hang something onSee peg1peg1 nounPlural pegs pɛɡpɛɡ1A short pin or bolt, typically tapered at one end, that is used for securing something in place, hanging things on, or marking a positio", "n. she put her mac on a peg in the hall Example sentencesExamples On each end of the board, tack a peg with one end pointed. Non-ferrous jointing methods include simple timber pegs and cord or rope bindings. It was a pretty rough climb, I didn't get even half way down when I decided I needed to come back with ropes, pegs and a harness. Overlap the edges by a few inches and anchor the fabric to the ground with wire or plastic pegs made for the job. They ", "also had to place pegs in the ground with the letters ‘C’ and ‘F’ painted on them to mark the survey. There he stops, sticking a peg into the ground, and tells his companions to start digging at that spot. The surveyors hammered a peg into the ground which was removed by campaigners prompting Mr Bradbury to claim that his party was being obstructed in its legal work. Hand-carved wooden pegs - never nails, screws, or anything else metal - are driven in with stone hammers. These openings in the rock were an ideal place to hammer in ‘pitons,’ spikes or pegs used for safety and sometimes support. Wooden pegs and hand-made nails held everything together. Part of the installation process was to pound some pegs into the ground to secure the swing set. A few extra pegs for the changing room are undoubtedly already on order. It's helpful to stand back from the ball and survey the terrain before you put your peg in the ground. After looking around the ground floor they removed the coat from a peg in the main corridor and walked out of the club through the front. We rode to the lake where I saw 3 more horses tied to a peg stuck in the ground. He proceeded to rush up and down the line of pegs, throwing the members' hats on to the floor. Instead it's all held together with dowels and pegs. Use pegs or hooks to store towels as well as coats. While his partner had been busy with that job, Haig had driven pegs into the ground, marked out a grid and plotted the positions of the signals from his metal detector. In addition to cutting beams to length, it's often necessary to drill holes for bolts, pegs and other fasteners, as well as for wiring and plumbing. Synonymsspike, pin, nail, dowel, skewer, rivet, brad, screw, bolt, hook, stick, nog, spigotNautical fidCurling hackQuoits hobMountaineering pitonGolf teeRowing thole (pin)rare knag, spile1.1 A pin or bolt driven into the ground to hold one of the ropes or corners of a tent in positio", "n. Example sentencesExamples Darryl hummed inscrutably and looked back down at the tent peg he was trying to hammer into the ground. The action is not unlike pushing a tent peg into the ground. Claire sat in her traditional spot behind the tent peg. She put her hand to the tent peg and her right hand to the workmen's mallet. There was a barely noticeable thump, and then a scratchy sort of noise as a peg landed on the ground. Her opponent slipped on a patch of ice, and fell, cracking his head on a tent peg. Three hours later, we discovered that we were six pegs and two rods short of a tent. Close kin, brothers, and fathers position their tents so that the tent pegs overlap and the guide ropes of the tents cross one another. Taylor's Soy Works Corporation is ", "also considering prototypes for future beanware: biodegradable camping equipment, such as cups, tent pegs, and ground sheets. We covered up the skidoos with their nylon covers and secured them by anchoring them with tent pegs and guy ropes. The structure holding the chamber top is fixed to the ground in four locations with 30 cm steel tent pegs (not shown). Judges are looking for taught guy ropes and all tent pegs where they should be, otherwise time penalties are imposed. A brolly is owned by most anglers but not as many take guide ropes and tent pegs. The up-and-down swinging arms are on a plane to drive a tent peg into the ground. He carefully spread out a ground-sheet and began hammering pegs into the ground.1.2British short for clothes peg Example sentencesExamples Half-hidden by the billowing linen, there was a half-full tub of laundry and a handful of pegs scattered on the ground. The washed garments are rinsed in a little fresh water and hung outside with pegs over the tent ropes to freeze solid. Number two and three has to be a clothes line and pegs. If my laundry hadn't dried and the sun was out, with a string round the panniers and a couple of pegs he was a clothes horse as literal as any you'll find.1.3 A bung for stoppering a cask. Example sentencesExamples Period pieces show a fire polished finish on the peg of the stopper. Synonymsstopper, stop, plug, bung, spigot, spile, seal1.4informalA footrest on a motorbike. Example sentencesExamples Your feet rests on pegs, your back is flat on the board and your head is slightly elevated so you are able to see where you are going.2A point or limit on a scale, especially of exchange rates. the Mexican peso, linked to the dollar by a crawling peg, was distinctly too high Example sentencesExamples For now, the government wants to keep the peg and see what happens next. ‘There is very little chance that the peg will be maintained forever,’ Chung, a director for ratings, said from Shanghai. In between Japan and the U.S. are European views that there is no ideal exchange rate regime for all countries and that currency pegs can only be useful in certain circumstances. It is obviously not always feasible to operate with tight exchange rate pegs, such as the currency board, and larger economies find it particularly difficult to maintain such constructions. We suspect that the Chinese peg has had a major impact here. This exchange rate peg with gold remained a major political issue until McKinley's election in 1896. The peg will limit the powers of the central banks. So long as countries were committed to defending their exchange rate pegs, there was no possibility that they would succumb to policies of sustained inflatio", "n. Labor unions supported the exchange-rate peg as a means to control prices and the inflationary pressure on salaries. The Bush administration wants it to end the peg eventually. Perhaps this announces a new swing of the policy pendulum back in favor of pegs? The exchange rate peg is gone, and the peso is trading at substantially depreciated exchange rates against the dollar. Now, the government has admitted it can't sustain its old policies, of which the dollar peg is the last vestige. Indeed, as Rogoff suggests, abandoning the peg to the dollar could be seen as abandoning China's commitment to stable and sustainable macroeconomic growth. These crises had compellingly shown that holding on to a preannounced peg of the exchange rate does not increase the credibility of the announced policy. Under flexible rates, central banks need not use interest rates to preserve an exchange-rate peg. The peg has served us very well for more than 21 years and given us the stability we needed over the Asian financial crisis. The IMF ploughed money into the country to help it sustain the peg, pledging an extra $22 billion as late as the end of 2000. To be credible, a peg requires tight fiscal and monetary control. Here, the clearest policy conclusion is to abandon the dollar peg for good, especially since hyperinflation fears appear unwarranted.3Indian A measure of spirits. have a peg of whisky Example sentencesExamples I stopped smoking eight months ago and alcohol is reduced to two pegs once a week. Most drinking scenes in films start with the dialogue ‘you drink two pegs and forget all worries.’ He went and told Grierson about the bet that he had with Barua - a peg of whisky, which would knock a mule over. He had settled himself comfortably as if he had all the time in the world, ordered a large peg of his favorite Scotch whisky, and then, things just went out of control. Then it's over to flashy dance floors and fast pulsating music that becomes all the more stirring after quaffing a few mugs of chilled beer or a few pegs of booze.4A place marked by a peg and allotted to a competitor to fish or shoot from. Example sentencesExamples There are four good pegs on this short stretch and on their day they are amongst the best on the river. There are some ten to fifteen fishable pegs here, over a distance of about half a mile. Virginia fished on peg 8 whilst I fished next door in peg 7 casting out to the island to my left. The chosen venue was the far bank, below the dam, and we fished pegs three and four. Often miles of river will be almost devoid of decent fish, whilst a few hot pegs will be flogged to death.5informal A person's leg. I have a good right peg and the ball ended up in the back of the net Example sentencesExamples Chic is idly caressing the ball with his left peg. I'd like Southwell to use his left peg more to drive the ball deep into the opposition's half. Synonymslower limb, shank6Baseball A strong throw. Example sentencesExamples Meanwhile, Santa rounded third and headed for home, as the shortstop finally came to his senses and threw a perfect peg to catcher Yunir Garcia, who held the ball in a collision at the plate. The peg from shortstop required unimaginable effort. Conine scored easily, but as Encarnacion headed home, Boone cut off a strong peg from Matsui and fired across the diamond to try to hold Pierre, conceding the ru", "n. Karim Garcia's strong peg off the carom nearly nailed Manny as he nonchalanted his way to second base. Miraculously, Posada managed to find the ball, whirl and throw a perfect peg down to second to impale the Impaler.verbpegs, pegged, pegging pɛɡpɛɡ1with object and adverbial Fix, secure, or mark with a peg or pegs. drape plants with nets, pegging down the edges Example sentencesExamples The lines on the docks were basic things: narrow gauge steel tracks pegged directly to the ties. Propagate strawberry plants once the crop is finished by pegging down a couple of runners from your best plants. Synonymsfix, pin, attach, fasten, secure, make fast1.1 Hang (washing) on a line with clothes pegs. clothes were pegged out on a line Example sentencesExamples Mum, who had been a nurse, seemed to be endlessly pegging nappies on the line, and I always had a small sister on one hip. Each time I reached up to peg my wet clothes out in the hot sun, I thought of homes where this is the last thing they are thinking about. Looking at them pegged on the line they look somewhat exiguous in nature. When you wash the sheets and when you reach up to peg them on the clothesline, you can feel the wet cotton against your skin and it's all cool like slipping into a swimming pool. Greying women potter in flower beds across the fence from pregnant mums pegging washing.1.2 Allot a specified place to (a competitor) in a fishing or shooting competition by means of a marker. we've been pegged next to the winning team2with object Fix (a price, rate, or amount) at a particular level. the dividend was pegged at 23.59p Example sentencesExamples The only saving grace for the moment is that mortgage rates are pegged at reasonable levels, thanks to the EU Bank. Prices of 110 items, all wages and salaries, and transport rates were pegged at the 15 December 1942 level. In response for their support, rates were pegged at their present level for three years in return for keeping its peak-time audience at last year's level. The exact wage varies, but is usually pegged at the amount needed to keep a working family off welfare and other government subsidies. Wage levels were pegged but prices were rising. Its price, currently $20, is pegged to the market price of black truffles. A second rate, recently 2.88%, is pegged to the inflation rate. Its design capacity was pegged at 25 million to 30 million passengers annually. For decades, the yuan has been pegged at a low rate to the US dollar. Officially, the unemployment rate is pegged at 16 percent, but many observers say it is closer to 30 or 35 percent. If this happens, the impact of the price cut will be immediately wiped out, because Australian petrol prices are pegged to world oil prices, measured in US dollars. The publishing industry defends its pricing policies, saying that foreign sales would be impossible if book prices were not pegged to local market conditions. Charges would only rise to £2 an hour if the council tax rise was pegged to five per cent. Tracker mortgages go up automatically because they are pegged to base rate. A student loan starts accruing interest from the moment it is borrowed, but the interest rate is pegged to the retail price index. If your rate was pegged at 6%, for example, it cannot go higher than that, but it can go lower if rates slide. On an average, the annual growth rate is pegged at 8 per cent but this is not guaranteed. But the most significant gap is with China, whose currency is pegged at a rate of about 8.3 yuan to the dollar. The exchange rate was greatly appreciated when it was pegged to the dollar in 1991. The rate is pegged at 0.99% above base rates for the life of the loan and redemption penalties apply for three years. Synonymshold down, keep down, fix, set, hold, control, freeze, limit2.1North American informalForm a fixed opinion of; categorize. the officer probably has us pegged as anarchists Example sentencesExamples I'd been interviewed by the police countless times since I'd found the body… but deep down I knew they had me pegged as a suspect. He has him pegged as a bad guy, and has no interest in trying to sway his opinio", "n. Or if your peers have you pegged as hopelessly dull, shock them. It doesn't come with the glamorous hernia ‘bulge,’ so my HMO's team of medical geniuses had it pegged as an abdominal strain for three months. Potential recruits from out-of-state may have it pegged as isolated, provincial, and homogeneous - not to mention awfully cold in winter. Until recently, the vast majority of telecoms investment professionals had Africa pegged as simply too risky to warrant serious attentio", "n. Most of Canada has him pegged as an ethically challenged dirtball. I had you pegged as weak-minded and subservient - Plinn's little puppet. You will ", "also take a letter home to your parents that they will sign, or I'll make sure the school board has you pegged as a troublemaker for the rest of your high school career, am I understood? He is being pegged as the organization's best defensive center fielder. While they uncovered many interesting things, such as one of the females they'd pegged as a likely target actually being a transvestite, they came no closer to identifying their quarry. One of the latter was a comment that immediately pegged the reviewer as someone from academia. If Jessica was right, she definitely had Michael pegged as a perfectionist, no doubt that carried over into his career as a choreographer as well. You know, I never pegged you as the clubbing sort. For one thing, both artists and athletes are usually pegged at a young age as gifted or talented. In case anyone has me pegged as a reliable apologist for the pharmaceutical industry, I'd like to direct you to this article in the Sunday New York Times. That's another printmaker that has me pegged as a lunatic. ‘Right from the beginning I had myself pegged as a poor liar,’ she says. When one of the dealers is arrested, the gang pegs the new convert as an informer and administers a vicious beating.3Baseball with object Throw (a ball) hard and low. the catcher pegs the ball to the first baseman Example sentencesExamples You know sometimes when the pitcher sees the guy on first inching his way towards second and pegs the ball to the first baseman, in a feeble attempt to get the fella out? Molly pegged the ball and it hit her in the face. Jamie backed away and pegged the ball, which Brian missed. Synonymsthrow, toss, fling, pitch, cast, lob, launch, flip, catapult, shy, dash, send, bowl, aim, direct, project, propel, fire, let flyPhrasesoff the peg(of clothes) ready-made.as modifier budget off-the-peg outfitsNorth American term off the rack Example sentencesExamples The former can be bought more or less off the peg; the latter have to be tailored to fit. Oh, it's off the peg, rather than designer, but, well, a girl has to do what a girl has to do. The woman in the former dressed off the peg and came from an ordinary family. You can order your dream garment or buy off the peg. Mr Smith goes on: ‘At this time there was not a lot of choice for women buying off the peg, so Poppy's business was in high demand.’ It's not about going into a shop, buying an item off the peg and taking it home. They had a choice of suits that fitted me off the peg (including 1 under £100)! I used to get most of my good suits and jackets off the peg from Simpson's. I doubt they'd be able to get a uniform off the peg for me. They can be bought off the peg or made-to-measure and are in demand for all kinds of events including weddings, parties and a day at the races. Synonymsready to wear, off the shelfa peg to hang something onSomething used as a pretext or occasion for the treatment of a wider subject. he is used as a peg on which to hang the intricate meshwork of diplomatic relationsa square peg in a round holeA person in a situation unsuited to their abilities or character. low self-esteem can be exacerbated by a sense of being a square peg in a round hole Example sentencesExamples Despite her obvious sophistication today, she spent much of her life as a ‘rebel without a cause’ or even perhaps a square peg in a round hole! He's still a bit of a square peg in a round hole here, which I'm sure is at least somewhat intentional, but it proves to be somewhat detrimental this time around. She was still a square peg in a round hole, trying to get her head around a system, timetables, a rigid curriculum and attitudes that didn't take into consideration her particular needs. He admits to having concerns that he may have become a square peg in a round hole. Asked to play out of position and he looked like a square peg in a round hole in the first half. She said: ‘I was like a square peg in a round hole.’ But far from being the final piece in the jigsaw, Veron has looked more like a square peg in a round hole. Whatever other charges may be levelled at him, he cannot be accused of having been a square peg in a round hole. He said, you look like a square peg in a round hole. She was not prepared to be a square peg in a round hole.take (or bring) someone down a peg or twoMake someone realize that they are less talented or important than they think they are. good to see United taken down a peg or two last evening Example sentencesExamples I might take him down a peg or two, you know, as a Christmas present. Well if we take him down a peg or two, then at least they'll get the chance to do what they want instead of him telling them what to do all the time. No matter how good you think you are, horses will always take you down a peg or two. That's when you want to take him down a peg or two. But having puffed us up to bursting point the agency then decided to take us down a peg or two. Nothing makes for taking you down a peg or two like public humiliatio", "n. But in the long run, it's a good hurt, because it takes you down a peg or two and reminds you what you're supposed to be doing in the first place. These things, no matter how awful or how great, can really take us down a peg or two. And Davis, who is back in the world's top 16 after an absence of some years, has his own personal reason for wanting to take Williams down a peg or two. She wanted to know what this boy was all about, and take him down a peg or two, if at all possible. Synonymshumble, humiliate, mortify, bring down, take down, bring low, demean, show up, shame, put to shame, make ashamed, discomfit, disgrace, discredit, downgrade, debase, degrade, devalue, dishonour, embarrass, put someone in their place, make a fool of, chasten, subdue, get the better of, have the last laugh on, abash, abase, crush, squash, quash, deflate, flatten, make someone eat humble piePhrasal Verbspeg awayWork hard at or try to achieve something over a long period. the South African attack kept pegging away Example sentencesExamples The bottom of their post must have been square, but we kept pegging away and in the second half we got the goal and I think we deserved to share the points. But I just kept pegging away hoping something would work out for me as the race went on, and thank God it did. The West Indies bowlers pegged away determinedly, while the Sri Lankan batsmen were in no mood to throw away their wickets before the showers came. This opened up the game for Port Trust who kept pegging away consistently at the net. McGrath, Lee and Gillespie will be back, and of course Bichel, Williams and Bracken will ", "also be pegging away. Poppleton kept pegging away and deservedly equalised when a through ball found Christopher Green, who gave Harry Wright in the Real Cliffe goal no chance. In contrast, they kept pegging away and, with cooler finishing and a dash of the luck that has deserted them in recent weeks, that 50-point barrier would now be breachable at the weekend. But John pegged away at it for a long time, though he never got his way. Well done, boys, but keep pegging away and the results will come against teams not as clinical as the Aussies (everybody else). With that attitude, we'll just have to keep pegging away. Synonymswork hard, work away, hammer away, grind awaypeg someone backReduce or eradicate the lead of an opponent in a contest. they were pegged back by an equalizer from Jameson Example sentencesExamples Andrews pegged Stockport back to 10-12 with a well taken penalty from 30 yards out. It is the third time we have been pegged back and gone on to win at home and it was a tough game today. It was a good point for us against Norwich pegging them back like that. They pegged us back and then we drove back in an old set-piece move to get a bit of focus back. Within three minutes West Leeds had their first meaningful attack and they had a chance to peg Skipton back with a penalty, but the kick went wide. Just before half time Keighley were pegged back agai", "n. Failing to take their chances, they had been pegged back to a three-point lead by a side which they had outmuscled and outfought for the opening 40 minutes. However, by the time the field turned into the home straight, he had been pegged back by the chasing pack. Whenever Cambridge made an excursion into Sutton's half, he pegged them back with long, accurate kicks. We scored a goal, pegged them back as far as possible and created lots of chances.peg out1Die. she looked as if she might peg out any moment Example sentencesExamples The man grinding the flour suggested this activity was healthier than a modern gym workout (not that healthy, we decided: half of all Viking women pegged out at 35). After such a marathon 64 years on top, it was scarcely surprising when the Empress of India finally pegged out almost 100 years ago today. Chekhov pegged out while taking a cure in Badenweiler. I'll likely peg out in front of the tv on Friday night with the tension of it all. Synonymspass away, pass on, lose one's life, depart this life, expire, breathe one's last, draw one's last breath, meet one's end, meet one's death, lay down one's life, be no more, perish, be lost, go the way of the flesh, go the way of all flesh, go to glory, go to one's last resting place, go to meet one's maker, cross the great divide, cross the styx2Score the winning point at cribbage. Example sentencesExamples It is not necessary to reach 121 exactly - you can peg out by scoring 2 more when you were on 120 and still wi", "n.3Croquet Hit the peg with the ball as the final stroke in a game.peg something outMark the boundaries of an area of land. I went out to peg out our assembly area Example sentencesExamples It was expected to remain a small town and as a result only twenty-four townblocks were pegged out. The new kitchen is pegged out and a safety fence is going up tomorrow! Rex Watkins the siting coordinator said most of the site had been pegged out and numbered and he is confident the registration process will go smoothly. The first opal claims were pegged out but, as a result of the unbearable heat and the lack of water, work was abandoned within three weeks. Within a few days claims were pegged out, tents went up and a blacksmith opened up for business. It is essential the site is pegged out before the planning committee visits it, to eliminate any confusio", "n.OriginLate Middle English: probably of Low German origin; compare with Dutch dialect peg 'plug, peg'. The verb dates from the mid 16th century.Rhymesbeg, cleg, egg, Eigg, Greg, keg, leg, Meg, skeg, teg, yegg PEG2abbreviationPolyethylene glycol.nou", "n.1 phr. phr.", "v. abbr.1peg1 nounpɛɡpeɡ1A short cylindrical piece of wood, metal, or plastic, typically tapered at one end, that is used for holding things together, hanging things on, or marking a positio", "n. Example sentencesExamples These openings in the rock were an ideal place to hammer in ‘pitons,’ spikes or pegs used for safety and sometimes support. He proceeded to rush up and down the line of pegs, throwing the members' hats on to the floor. Instead it's all held together with dowels and pegs. On each end of the board, tack a peg with one end pointed. Hand-carved wooden pegs - never nails, screws, or anything else metal - are driven in with stone hammers. There he stops, sticking a peg into the ground, and tells his companions to start digging at that spot. Non-ferrous jointing methods include simple timber pegs and cord or rope bindings. Overlap the edges by a few inches and anchor the fabric to the ground with wire or plastic pegs made for the job. The surveyors hammered a peg into the ground which was removed by campaigners prompting Mr Bradbury to claim that his party was being obstructed in its legal work. It's helpful to stand back from the ball and survey the terrain before you put your peg in the ground. In addition to cutting beams to length, it's often necessary to drill holes for bolts, pegs and other fasteners, as well as for wiring and plumbing. We rode to the lake where I saw 3 more horses tied to a peg stuck in the ground. A few extra pegs for the changing room are undoubtedly already on order. It was a pretty rough climb, I didn't get even half way down when I decided I needed to come back with ropes, pegs and a harness. After looking around the ground floor they removed the coat from a peg in the main corridor and walked out of the club through the front. They ", "also had to place pegs in the ground with the letters ‘C’ and ‘F’ painted on them to mark the survey. Use pegs or hooks to store towels as well as coats. Wooden pegs and hand-made nails held everything together. Part of the installation process was to pound some pegs into the ground to secure the swing set. While his partner had been busy with that job, Haig had driven pegs into the ground, marked out a grid and plotted the positions of the signals from his metal detector. Synonymsspike, pin, nail, dowel, skewer, rivet, brad, screw, bolt, hook, stick, nog, spigot1.1 A pin or bolt driven into the ground to hold one of the ropes or corners of a tent in positio", "n. Example sentencesExamples Darryl hummed inscrutably and looked back down at the tent peg he was trying to hammer into the ground. She put her hand to the tent peg and her right hand to the workmen's mallet. Claire sat in her traditional spot behind the tent peg. Judges are looking for taught guy ropes and all tent pegs where they should be, otherwise time penalties are imposed. A brolly is owned by most anglers but not as many take guide ropes and tent pegs. Taylor's Soy Works Corporation is ", "also considering prototypes for future beanware: biodegradable camping equipment, such as cups, tent pegs, and ground sheets. Her opponent slipped on a patch of ice, and fell, cracking his head on a tent peg. There was a barely noticeable thump, and then a scratchy sort of noise as a peg landed on the ground. Close kin, brothers, and fathers position their tents so that the tent pegs overlap and the guide ropes of the tents cross one another. He carefully spread out a ground-sheet and began hammering pegs into the ground. Three hours later, we discovered that we were six pegs and two rods short of a tent. The structure holding the chamber top is fixed to the ground in four locations with 30 cm steel tent pegs (not shown). The up-and-down swinging arms are on a plane to drive a tent peg into the ground. The action is not unlike pushing a tent peg into the ground. We covered up the skidoos with their nylon covers and secured them by anchoring them with tent pegs and guy ropes.1.2 A bung for stoppering a cask. Example sentencesExamples Period pieces show a fire polished finish on the peg of the stopper. Synonymsstopper, stop, plug, bung, spigot, spile, seal2A point or limit on a scale, especially of exchange rates. Example sentencesExamples The Bush administration wants it to end the peg eventually. The IMF ploughed money into the country to help it sustain the peg, pledging an extra $22 billion as late as the end of 2000. Perhaps this announces a new swing of the policy pendulum back in favor of pegs? The peg has served us very well for more than 21 years and given us the stability we needed over the Asian financial crisis. The exchange rate peg is gone, and the peso is trading at substantially depreciated exchange rates against the dollar. ‘There is very little chance that the peg will be maintained forever,’ Chung, a director for ratings, said from Shanghai. So long as countries were committed to defending their exchange rate pegs, there was no possibility that they would succumb to policies of sustained inflatio", "n. Indeed, as Rogoff suggests, abandoning the peg to the dollar could be seen as abandoning China's commitment to stable and sustainable macroeconomic growth. For now, the government wants to keep the peg and see what happens next. To be credible, a peg requires tight fiscal and monetary control. Here, the clearest policy conclusion is to abandon the dollar peg for good, especially since hyperinflation fears appear unwarranted. Under flexible rates, central banks need not use interest rates to preserve an exchange-rate peg. This exchange rate peg with gold remained a major political issue until McKinley's election in 1896. We suspect that the Chinese peg has had a major impact here. These crises had compellingly shown that holding on to a preannounced peg of the exchange rate does not increase the credibility of the announced policy. In between Japan and the U.S. are European views that there is no ideal exchange rate regime for all countries and that currency pegs can only be useful in certain circumstances. Labor unions supported the exchange-rate peg as a means to control prices and the inflationary pressure on salaries. Now, the government has admitted it can't sustain its old policies, of which the dollar peg is the last vestige. It is obviously not always feasible to operate with tight exchange rate pegs, such as the currency board, and larger economies find it particularly difficult to maintain such constructions. The peg will limit the powers of the central banks.3Indian A measure of liquor. have a peg of whiskey Example sentencesExamples He went and told Grierson about the bet that he had with Barua - a peg of whisky, which would knock a mule over. Most drinking scenes in films start with the dialogue ‘you drink two pegs and forget all worries.’ He had settled himself comfortably as if he had all the time in the world, ordered a large peg of his favorite Scotch whisky, and then, things just went out of control. I stopped smoking eight months ago and alcohol is reduced to two pegs once a week. Then it's over to flashy dance floors and fast pulsating music that becomes all the more stirring after quaffing a few mugs of chilled beer or a few pegs of booze.4informal A person's leg. Example sentencesExamples I'd like Southwell to use his left peg more to drive the ball deep into the opposition's half. Chic is idly caressing the ball with his left peg. Synonymslower limb, shank5Baseball A strong throw, especially in baseball. Example sentencesExamples Meanwhile, Santa rounded third and headed for home, as the shortstop finally came to his senses and threw a perfect peg to catcher Yunir Garcia, who held the ball in a collision at the plate. Conine scored easily, but as Encarnacion headed home, Boone cut off a strong peg from Matsui and fired across the diamond to try to hold Pierre, conceding the ru", "n. Miraculously, Posada managed to find the ball, whirl and throw a perfect peg down to second to impale the Impaler. Karim Garcia's strong peg off the carom nearly nailed Manny as he nonchalanted his way to second base. The peg from shortstop required unimaginable effort.verbpɛɡpeɡ1with object and adverbial Fix or make fast with a peg or pegs. drape individual plants with nets, pegging down the edges Example sentencesExamples The lines on the docks were basic things: narrow gauge steel tracks pegged directly to the ties. Propagate strawberry plants once the crop is finished by pegging down a couple of runners from your best plants. Synonymsfix, pin, attach, fasten, secure, make fast2with object Fix (a price, rate, or amount) at a particular level. Example sentencesExamples Charges would only rise to £2 an hour if the council tax rise was pegged to five per cent. In response for their support, rates were pegged at their present level for three years in return for keeping its peak-time audience at last year's level. The exact wage varies, but is usually pegged at the amount needed to keep a working family off welfare and other government subsidies. Its design capacity was pegged at 25 million to 30 million passengers annually. Officially, the unemployment rate is pegged at 16 percent, but many observers say it is closer to 30 or 35 percent. Its price, currently $20, is pegged to the market price of black truffles. Wage levels were pegged but prices were rising. Tracker mortgages go up automatically because they are pegged to base rate. If your rate was pegged at 6%, for example, it cannot go higher than that, but it can go lower if rates slide. The rate is pegged at 0.99% above base rates for the life of the loan and redemption penalties apply for three years. A student loan starts accruing interest from the moment it is borrowed, but the interest rate is pegged to the retail price index. The publishing industry defends its pricing policies, saying that foreign sales would be impossible if book prices were not pegged to local market conditions. A second rate, recently 2.88%, is pegged to the inflation rate. Prices of 110 items, all wages and salaries, and transport rates were pegged at the 15 December 1942 level. For decades, the yuan has been pegged at a low rate to the US dollar. The only saving grace for the moment is that mortgage rates are pegged at reasonable levels, thanks to the EU Bank. If this happens, the impact of the price cut will be immediately wiped out, because Australian petrol prices are pegged to world oil prices, measured in US dollars. On an average, the annual growth rate is pegged at 8 per cent but this is not guaranteed. The exchange rate was greatly appreciated when it was pegged to the dollar in 1991. But the most significant gap is with China, whose currency is pegged at a rate of about 8.3 yuan to the dollar. Synonymshold down, keep down, fix, set, hold, control, freeze, limit2.1North American informalForm a fixed opinion of; categorize. the officer probably has us pegged as anarchists Example sentencesExamples You know, I never pegged you as the clubbing sort. ‘Right from the beginning I had myself pegged as a poor liar,’ she says. One of the latter was a comment that immediately pegged the reviewer as someone from academia. Most of Canada has him pegged as an ethically challenged dirtball. Potential recruits from out-of-state may have it pegged as isolated, provincial, and homogeneous - not to mention awfully cold in winter. He has him pegged as a bad guy, and has no interest in trying to sway his opinio", "n. It doesn't come with the glamorous hernia ‘bulge,’ so my HMO's team of medical geniuses had it pegged as an abdominal strain for three months. That's another printmaker that has me pegged as a lunatic. I had you pegged as weak-minded and subservient - Plinn's little puppet. Or if your peers have you pegged as hopelessly dull, shock them. I'd been interviewed by the police countless times since I'd found the body… but deep down I knew they had me pegged as a suspect. In case anyone has me pegged as a reliable apologist for the pharmaceutical industry, I'd like to direct you to this article in the Sunday New York Times. When one of the dealers is arrested, the gang pegs the new convert as an informer and administers a vicious beating. Until recently, the vast majority of telecoms investment professionals had Africa pegged as simply too risky to warrant serious attentio", "n. You will ", "also take a letter home to your parents that they will sign, or I'll make sure the school board has you pegged as a troublemaker for the rest of your high school career, am I understood? If Jessica was right, she definitely had Michael pegged as a perfectionist, no doubt that carried over into his career as a choreographer as well. While they uncovered many interesting things, such as one of the females they'd pegged as a likely target actually being a transvestite, they came no closer to identifying their quarry. For one thing, both artists and athletes are usually pegged at a young age as gifted or talented. He is being pegged as the organization's best defensive center fielder.3Baseball Throw (a ball) hard and low, especially in baseball. the catcher pegs the ball to the first baseman Example sentencesExamples Jamie backed away and pegged the ball, which Brian missed. Molly pegged the ball and it hit her in the face. You know sometimes when the pitcher sees the guy on first inching his way towards second and pegs the ball to the first baseman, in a feeble attempt to get the fella out? Synonymsthrow, toss, fling, pitch, cast, lob, launch, flip, catapult, shy, dash, send, bowl, aim, direct, project, propel, fire, let flyPhrasesoff the peg(of clothes) ready-made; off the rack.as modifier budget off-the-peg outfits Example sentencesExamples You can order your dream garment or buy off the peg. Mr Smith goes on: ‘At this time there was not a lot of choice for women buying off the peg, so Poppy's business was in high demand.’ The former can be bought more or less off the peg; the latter have to be tailored to fit. They can be bought off the peg or made-to-measure and are in demand for all kinds of events including weddings, parties and a day at the races. The woman in the former dressed off the peg and came from an ordinary family. They had a choice of suits that fitted me off the peg (including 1 under £100)! I used to get most of my good suits and jackets off the peg from Simpson's. It's not about going into a shop, buying an item off the peg and taking it home. Oh, it's off the peg, rather than designer, but, well, a girl has to do what a girl has to do. I doubt they'd be able to get a uniform off the peg for me. Synonymsready to wear, off the shelfa square peg in a round holeA person in a situation unsuited to their abilities or character. Example sentencesExamples Despite her obvious sophistication today, she spent much of her life as a ‘rebel without a cause’ or even perhaps a square peg in a round hole! He said, you look like a square peg in a round hole. She was still a square peg in a round hole, trying to get her head around a system, timetables, a rigid curriculum and attitudes that didn't take into consideration her particular needs. She said: ‘I was like a square peg in a round hole.’ Whatever other charges may be levelled at him, he cannot be accused of having been a square peg in a round hole. He's still a bit of a square peg in a round hole here, which I'm sure is at least somewhat intentional, but it proves to be somewhat detrimental this time around. Asked to play out of position and he looked like a square peg in a round hole in the first half. She was not prepared to be a square peg in a round hole. But far from being the final piece in the jigsaw, Veron has looked more like a square peg in a round hole. He admits to having concerns that he may have become a square peg in a round hole.take (or bring) someone down a peg or twoMake someone realize that they are less talented or important than they think are. Example sentencesExamples No matter how good you think you are, horses will always take you down a peg or two. And Davis, who is back in the world's top 16 after an absence of some years, has his own personal reason for wanting to take Williams down a peg or two. Well if we take him down a peg or two, then at least they'll get the chance to do what they want instead of him telling them what to do all the time. Nothing makes for taking you down a peg or two like public humiliatio", "n. That's when you want to take him down a peg or two. I might take him down a peg or two, you know, as a Christmas present. These things, no matter how awful or how great, can really take us down a peg or two. She wanted to know what this boy was all about, and take him down a peg or two, if at all possible. But in the long run, it's a good hurt, because it takes you down a peg or two and reminds you what you're supposed to be doing in the first place. But having puffed us up to bursting point the agency then decided to take us down a peg or two. Synonymshumble, humiliate, mortify, bring down, take down, bring low, demean, show up, shame, put to shame, make ashamed, discomfit, disgrace, discredit, downgrade, debase, degrade, devalue, dishonour, embarrass, put someone in their place, make a fool of, chasten, subdue, get the better of, have the last laugh on, abash, abase, crush, squash, quash, deflate, flatten, make someone eat humble piea peg to hang a matter onSomething used as a pretext or occasion for the discussion or treatment of a wider subject.Phrasal Verbspeg awayContinue working hard at or trying to achieve something, especially over a long period. Example sentencesExamples Poppleton kept pegging away and deservedly equalised when a through ball found Christopher Green, who gave Harry Wright in the Real Cliffe goal no chance. The bottom of their post must have been square, but we kept pegging away and in the second half we got the goal and I think we deserved to share the points. But I just kept pegging away hoping something would work out for me as the race went on, and thank God it did. In contrast, they kept pegging away and, with cooler finishing and a dash of the luck that has deserted them in recent weeks, that 50-point barrier would now be breachable at the weekend. The West Indies bowlers pegged away determinedly, while the Sri Lankan batsmen were in no mood to throw away their wickets before the showers came. But John pegged away at it for a long time, though he never got his way. This opened up the game for Port Trust who kept pegging away consistently at the net. McGrath, Lee and Gillespie will be back, and of course Bichel, Williams and Bracken will ", "also be pegging away. Well done, boys, but keep pegging away and the results will come against teams not as clinical as the Aussies (everybody else). With that attitude, we'll just have to keep pegging away. Synonymswork hard, work away, hammer away, grind awaypeg out1Die. Example sentencesExamples Chekhov pegged out while taking a cure in Badenweiler. After such a marathon 64 years on top, it was scarcely surprising when the Empress of India finally pegged out almost 100 years ago today. The man grinding the flour suggested this activity was healthier than a modern gym workout (not that healthy, we decided: half of all Viking women pegged out at 35). I'll likely peg out in front of the tv on Friday night with the tension of it all. Synonymspass away, pass on, lose one's life, depart this life, expire, breathe one's last, draw one's last breath, meet one's end, meet one's death, lay down one's life, be no more, perish, be lost, go the way of the flesh, go the way of all flesh, go to glory, go to one's last resting place, go to meet one's maker, cross the great divide, cross the styx2Score the winning point at cribbage. Example sentencesExamples It is not necessary to reach 121 exactly - you can peg out by scoring 2 more when you were on 120 and still wi", "n.3Croquet Hit the peg with the ball as the final stroke in a game.peg something outMark the boundaries of an area of land. I went out to peg out our assembly area Example sentencesExamples Rex Watkins the siting coordinator said most of the site had been pegged out and numbered and he is confident the registration process will go smoothly. The first opal claims were pegged out but, as a result of the unbearable heat and the lack of water, work was abandoned within three weeks. It is essential the site is pegged out before the planning committee visits it, to eliminate any confusio", "n. Within a few days claims were pegged out, tents went up and a blacksmith opened up for business. The new kitchen is pegged out and a safety fence is going up tomorrow! It was expected to remain a small town and as a result only twenty-four townblocks were pegged out.OriginLate Middle English: probably of Low German origin; compare with Dutch dialect peg ‘plug, peg’. The verb dates from the mid 16th century. PEG2abbreviationPolyethylene glycol.nou", "n.1 phr. phr.", "v. abbr.1"]}, {"dict": "self-study_English3", "values": ["坚持住"]}], "usphone": "", "ukphone": ""}