{"name": "be left over", "trans": [{"dict": "Oxford5000", "values": ["be overSee overDefinition of over in English: over preposition ˈəʊvəˈoʊvər1Extending directly upwards from. I saw flames over Berlin cook the sauce over a moderate heat Example sentencesExamples Cook over a high heat until just wilted, cool a bit, then squeeze out most of the moisture. Put the yolk in a metal bowl, held close to a flame but not over it, and mix until it turns white. Melt the fat in a pan, beat the egg and milk together, add to the fat in the pan, season well and cook over a gentle heat. Let it cook over a relatively low heat till the bottom has formed a golden crust. They were meant to be cooked the rest of the way by the diners over a flame that was brought in for that purpose. For a more reliable source, you need to be directly over the clay seam where the fossils are buried. If you position your eyes directly over the ball then your eyes will always be aligned with the hole. Cook over a gentle heat for five minutes, and then add the chopped anchovies and the olives. This occurred when a new building was built directly over the top of the remains of its predecessor. This brings the centre of gravity directly over the right foot, which supports her weight. In a large heavy pan, melt half the butter with the oil over a moderate heat. Soaring directly over our heads, she disappears back into the main current and is gone. We are welcomed in with open arms and hearts, and they prepare beautiful food, cooked over an open fire. Lift the fish out onto warm plates and place the baking dish over a moderate flame. Add olives to the pan and cook over a moderate heat until they begin to wrinkle. Heat the oil in a large saucepan, add the leeks and bay leaves, and fry over a high heat until the leeks have some colour. Continue to cook over a low heat until vegetables are submerged in their own liquid. The meat is seared over the hottest flames, then moved to a cooler part of the fire to cook gently through. Keep mixing the roux over the flame until the mixture comes off the sides of the pot. Cook over a fairly high heat for two to three minutes, then add the tomatoes and juices. Synonymsabove, on top of, higher than, higher up than, atop1.1 Above so as to cover or protect. an oxygen tent over the bed ladle this sauce over fresh pasta Example sentencesExamples The blast from the bomb had blown out all the windows but my mother had pulled the covers over us. In case of cold weather, it would be a good idea to apply a layer of mulch over the bulbs. It was only when the council put a thick layer of clay over it that this flora was lost. She then ran into the bedroom where her husband finally poured water over the flames. He was on his bed with the covers over him and she thought he was asleep. They have looked into loaning some covers to put over the pitch tomorrow night in case of overnight frost. A kind of invisible bell jar had been dropped over it, protecting it from change. Sprinkle cracker crumbs evenly over the bottom and sides, then pour in the ricotta mixture. The kettle had boiled so Don poured the water over the coffee powder in the mug. Many of you suggested laying small lengths of holly over the damaged area of garde", "n. Scatter the fresh coriander over the curry and serve with plain boiled rice. I turned up to the theatre in the costume and a couple of people threw coffee over me. Place a layer of tomato slices over the pesto then top with crumbled cheese. Mix well and spray thoroughly over both sides of the foliage and onto the offending pest. They had set up a shelter over their fire. The cloths were laid on the ground directly over the plants and fixed with spikes. He innocently assumed that a steel cover placed over a drainpipe was safe to walk o", "n. When I stop the car for a while and switch off the engine, the silence falls like a cloak over the countryside. Mix together the salt and sugar, and rub evenly over both sides of the salmo", "n. Two engineers were then able to pull up the two covers over the damaged cable.1.2 Extending above (an area) from a vantage point. views over Hyde Park Example sentencesExamples This area has great views over the rear garden through large windows and a set of patio doors. Still wearing her pajamas she went onto the balcony and looked over the front lawns. He walked to the single window looking out over the front lawn and road and opened it. Looking over the side you would expect to see a treasure chest full of gold. This is a gracious and welcoming house with spectacular views over open countryside. She looks out of the window over the parking lot and slides the tray of untouched fries away. Even on the stormy day that we visited, the vista over some of the uninhabited islands was magical. A sunroom looks out over the vegetable garde", "n. There's a large outside balcony area which faces South over the city centre rooftops. Synonymsacross, on to, around, throughout, all through, throughout the extent of, everywhere in, in all parts of2At a higher level or layer tha", "n. his flat was over the shop Example sentencesExamples At the other end, a speculative lob from Ian Duncan dipped just over the bar. Sherry had another excellent chance after 27 minutes but he sent his header over the bar. His powerful shot was just over the bar. His sweet right shot looked destined for the net but just sailed over the bar. Then they must either transfer it quickly either over the bar or to a player in a better positio", "n. This was done from the rear of the ranks in most circumstances, and over the heads of the shield wall of the thrower. Just to make sure, I now usually use a second layer of bandage over the first. Byatt almost doubled his tally seven minutes later after a fine run ended with his shot whistling over the bar. The volley sailed over the front rank of soldiers and fell among the battle leaders beyond. He thumped a chance over the bar. He whipped in a viciously dipping shot that spun just a foot over the bar. After a long delay, he stepped up to sky the spot-kick over the bar. The drysuit can be worn over a layer of clothing and it keeps its wearer completely dry and warm. A pair of tame shots by Ben Thornley that floated up and over the bar were as much as they could muster in the first half. He then had an opportunity to put the visitors level but he flicked the shot just over the cross bar. They were used and enjoyed by townsfolk who lived over their businesses and were unable to escape to a garde", "n. The ball eventually came into the possession of Mike Cooper and he stuck it over the bar. The office was over a newsagent's shop in the centre of Manchester. Synonymsabove, on top of, higher than, higher up than, atop2.1 Higher in rank tha", "n. over him is the financial director Example sentencesExamples The first-level manager, of course, has another manager over him. John had two levels of management over him. He had six senior officers over him. Synonymssuperior to, above, higher up than, more powerful than, in charge of, responsible for, commanding2.2 Expressing authority or control. editorial control over what is included Example sentencesExamples Britain retains sovereign rights over two areas to be used as military bases. At this time there was little or no control over speed boats by the authorities. He is concerned about the local education authority losing some control over the school. This structure is one which allows the spectator a degree of power over what is see", "n. They ", "also insist local authorities will still have some control over their own waste policies. They seemed less stressed and they acted as if they had real control over what they were doing. What they will not put up with, however, is a lack of control over other people. This time they will choose a government that will have real power over the direction of the country. Also, I always feel as though I have a certain measure of control over the situatio", "n. The membership of the party have no say over the policy and direction of the party. Family doctors in England are being given control over the budgets which buy hospital services. However, the ship was teeming with children whose parents had absolutely no control over them. Second, it centralises that information and gives you control over what is visible to others. Let's hope it is just a first step in giving back people control over their own lives. Help them to regain a sense of control over their life by offering choices and options. However, a Ministry of Defence official says his department has no control over the plant. The charity said that women who had babies at home tended to have greater privacy and more control over the birth. Instead, the locals enjoy their town and impose some control over the speed of motor vehicles using it. Those receiving benefits would be given control over their own training budgets. He is no longer the grim dictator with the power of life and death over his subjects.2.3 Expressing preference. I'd choose the well-known brand over that one Example sentencesExamples None of this persuades me that my preference for poetry over politics is a wrong choice. Do seed predators, floral herbivores and pollinators prefer one sex over the other? How could anyone prefer that over a real democracy that had evolved since the end of World War Two? In terms of manufacture and for aesthetic reasons, plastics are preferred over metal. The shares are best left for those who prefer hope over reality with their investments. Either way, give me this lot over a bunch of monosyllabic scowlers any day. In the old days, we used to prefer the wider good over personal convenience. It seems to be working as the family audience are slowly preferring it over other films. For long distances, he prefers the bus over airliners or rail because he likes the atmosphere. The choice of a sloping tiled roof over a flat roof had more to do with the local climatic conditions than with style. Since then the cartel has been attempting to show how responsible it is and has favoured price over volume. It is necessary to look at the grounds on which we are persuaded to prefer one theory over another. Is care and concern always to be preferred over more emotionally detached ways of relating to others? It ", "also reveals a preference for debt over equity as a means of providing external funding. For those hoping to stay, it should be noted that their manager considers attitude over ability. The evidence that the country's people would have preferred an invasion over other options is slight.2.4 Expressing majority. there was a slight predominance of boys over girls Example sentencesExamples Care was taken to attend showings at which the audience contained a predominance of adults over children There was an excess of men over wome", "n.2.5 Higher in volume or pitch tha", "n. he shouted over the noise of the taxis Example sentencesExamples The television screen was enormous, but I had to turn up the volume to hear it over the roar of Park Lane. I shouted over the noise. Hearing him shout over a rumbling beat is one of life's singular pleasures. People crowded round the bar frantically shouting their orders over the noise of the band. A confused babble of voices rose over the hubbub. Much of the night was spent shouting at increasing volumes over ear-splitting music. I loved it so much that I wanted to shout about it over the cacophony of the real world. The noise got so loud we had to shout over it. Rogers screamed over the noise of rifle shots ringing out through the cool, night air. There was some music playing in the background, which could barely be heard over the noise.3Higher or more than (a specified number or quantity) over 40 degrees C they've been married for over a year Example sentencesExamples He was trapped in the car, which burst into flames, for over an hour. In fact he supervised the production of over 30 volumes in his role as general editor. Pensions have fallen in value by over a third since the change was introduced. She was born in Oxford and has lived in Ireland for over twenty five years. Flood levels over three meters deep drowned cars and drove people from their homes. I have friends who have lived in Thailand for over thirty years and can't speak a work of Thai. We spent a lot of time together, well over two months, and so we really got to know each other. Most of the material is stuff we'd been playing in front of live audiences for over a year. The shores of these islands are often sandy but temperatures over 30 degrees are rare. Water in the house reached a level of over three feet and considerable damage was caused. As the globe warms and over a billion people live on less than one dollar a day, a global left is needed more than ever. We had been together for over a year, but I left him because everything he did seemed so boring and dull. In some areas of the county over half the number of fires reported are started deliberately. On that basis the unemployment levels of those over forty are not reasonable. The age of some of the rocks in the area has been a subject of debate by geologists for over 150 years. The house, the entrance lodge and garden of just over an acre comprise lot one. Applicants must be over 25 and have had a clean driving licence for more than five years. The house, which is very elegant, had not been lived in for over four years and was slowly crumbling away. We raise such a hue and cry when a tree is cut down, but with every heavy shower over a dozen trees fall. Mind you, I think it was probably over thirty degrees when this was filmed earlier today. Synonymsmore than, above, in excess of, exceeding, upwards of, beyond, greater than4Expressing passage or trajectory across. she trudged over the lawn Example sentencesExamples The pace picks up as the river flows swift and shallow over a rocky bed. The Act, creates a new legal right to roam over areas, mapped as open land and registered common land. The more obvious route goes directly up the ridge over steep, rocky ground, though there is a path to follow. Flying over vast areas of vegetation, the scale of the disaster caused by the floods begins to unfold. Together we bounded over a meadow and parked the car on the edge of a copse. It was possible that a big cat could roam over a huge area. A small climb up over a muddy slope gains a corner with some fine formations. Ignore side roads as you go up the hill and over a cross roads with traffic lights. Once changed we set off over the fell with the rain thankfully absent for the time being. Clamber over this, and follow the passage through a short canal to a rope climb up a rift. Some headed directly east: over the mountains and into the tribal areas of Pakista", "n. Ranks closed and the birds swept over the estuary, rising and falling, packed together. An injured climber walked for a mile over rocky terrain after falling off a cliff and breaking his arm and foot. Then it was time to go home and everyone started to drive over the newly fallen snow in their cars with the big fat tyres on them. We headed off down Pierce's Passage and over a muddy boulder slope until we reached some cascades. Police, including six armed officers, swarmed over the area and the gangsters fled. Synonymsacross, on to, around, throughout, all through, throughout the extent of, everywhere in, in all parts of4.1 Beyond and falling or hanging from. he toppled over the side of the boat Example sentencesExamples I scowled into the night, took a swig of my beer and dumped the rest over the side of the deck. They claimed they were breaching a crazy law that was forcing them to dump fish caught in their nets over the side. There are five people on board and you have to decide who to chuck over the side to save the rest. He is splashing fish heads over the side of the boat, looking sick and out of place. It drops over the side of the canoe as I try to store it away in a waterproof container. Many of the owners are given time frames of how long it will be before their homes topple over the cliff. Her long, brown legs were draped over the side of the boat. Bait and decoys keep the sharks close to the boats, and a cage can then be dropped over the side for a diver to get a much closer look. Working on a film in St Lucia, he almost crashes a bus over the side of a ravine. They wrapped the first bomb in a sack and carefully rolled it over the side, where it exploded. He left the pub alone at closing time and must have fallen over the wall on his walk home. As it is, any adult proposing to get comfortable back there is going to have to dangle their feet over the sides. He fell 25 feet over a ledge and suffered head injuries after crashing into rocks. On a perfect day, with someone on shark-watch, we had leapt over the side to go for a swim. They roll him over on his side and his arm flaps limply over the side of the gurney. Can I report a loss because I have dropped my wallet over the side of the boat on the way back from France? Six-foot waves crash over the sides of the landing craft and several are swamped. Cars had been crushed like balls of paper, and chucked over the side of the bridges. Wounded in the leg, he fell back over a ledge and was fortunate to be snagged by a tree. When we moved off and dropped over the hull side, however, we found the visibility was as good as 1m!4.2 At the other side of; beyond. over the hill is a small village Example sentencesExamples He sits next to his Personal Assistant, with his sales and marketing director over the partitio", "n. Over the river, King's College has an absolutely stunning Fellows' Garde", "n. Just over the other side of the mountain, on the other slope at 770 foot, is the weather statio", "n. There is a village over the river from Liverpool called Port Sunlight. She asks if he could give her a lift to a town over the border.5Expressing duratio", "n. you've given us a lot of heartache over the years she told me over coffee Example sentencesExamples With the fine weather there has been a huge increase in visitors to the area over the past month or so. The stones of the path had been polished by the passage of feet over hundreds, if not thousands, of years. I've been in a lot of interesting places over the past two years and worked with some really great people. Security forces were thought to have largely cleaned up the area over the past two years. The direction of the markets over the coming months will largely be down to American interest rates. The couple said they will be organising lots of fundraising events over the coming year. Attacks on staff have increased in almost all areas of the NHS over the last 10 years. In just over a month the area was evacuated and the village literally vanished off the map. We had a longer day care service, holiday cover and respite care over the weekend. The cost of generating electricity by wind power has fallen dramatically over the past few years. Police are ", "also linking the duo to two other attacks in the Nottinghamshire area over the past few days. We talk over coffee in his small Knightsbridge office, where he employs just one assistant. They will be able to pay £12 a month over three years to cover their end of the deal. Alan eventually broke the news to her over a cup of coffee when they got home. My memory of the entrance passages had faded over the years, so we took a few wrong turnings. However, a number of the York side have improved over the last year and a close result is forecast. Search teams have been combing the area over the weekend but have so far been unable to trace the murder weapo", "n. Collectors from the scheme will be calling to homes in the area over the coming two weeks. There has been an increase in firearm crime in the area over the last five years. To enjoy these bulbs year after year, they must be dug up in fall and stored indoors over the winter.6Expressing the medium by which something is done; by means of. a voice came over the loudspeaker Example sentencesExamples The almost robotic voice of the security office fizzed over the voice comm. Within a few moments a reply was clearly voiced over the small speaker in the headrest of the chair. Customers will get used to making free voice calls over the internet. Increasingly customers buy insurance direct over the phone, or on the internet. This month's Athens Olympics will become the first to be broadcast live over the Net. The Dominoes On Line web site enables you to play dominoes live over the Internet. These could be used to attract more sales, perhaps even direct sales over the internet. The lights began to dim out and then a voice was heard over the microphone. Although not available in Orkney, the station broadcasts live over the internet. My husband heard the shouts over the phone and called the police when he realised I was being robbed. The company ", "also put out Madonna's concert at Slane live over the internet last year. The crowd listened in silence as the service was broadcast over loudspeakers. The lights over the rink dimmed and flashed colors, and a slow song came on over the loudspeakers. This is usually much more expensive than buying direct over the telephone or internet. His or her face is illuminated with a soft red light, and white noise is played over headphones. She printed a map with instructions, but he insisted on giving directions over the phone.7On the subject of. a long and heated debate over unemployment Example sentencesExamples Publicans are falling out over new licensing laws allowing pubs to open much later. A fresh row has erupted over the thorny issue of a northern bypass for Witham. MPs said it was a straight fight between the two sides over who would win approval for a new medical school. The traffickers then had a gunbattle with a rival drug gang over drug selling areas. Protests were staged in Kew on Monday over fresh attempts by a phone company to put up a mast in North Road. There has been a strong feeling among rank and file workers to walk out over this issue. The next battles were over the first direct elections to the European Parliament. That has raised fresh concerns over the nation's ability to pull itself out of recessio", "n. We need joint union rallies over pensions and a serious campaign among rank and file members. There is a great deal of debate over the safety of buying on the internet. Many couples fall out over the house when they separate since it is usually the biggest asset. The protagonists are ex-college buddies who fell out over a girl called Betty Anne. This incident raises fresh concerns over safety, and public access to the water's edge. We argue all the time, whether it's over my driving or directions or anything really. New figures show that the highest number of complaints are made over domestic noise. The debate over the use of cannabis in medicine is controversial and emotive. After bringing the railways to the city, he fell from grace over dodgy financial dealings. Right now, the world is faced with a debate over how to deal with the water crisis. There were concerns over your level of alcohol consumption and its effect on your conduct. He has been getting a lot more aggressive recently over such trivial things as the housework and his dinner. Synonymson the subject of, about, concerning, apropos of, with reference to, speaking of, with regard/respect to, regarding, as regards, relating to, respecting, in connection with, as for, reLatin in readverb ˈəʊvəˈoʊvər1Expressing passage or trajectory across an area. he leant over and tapped me on the hand Example sentencesExamples I put it back to its original position and wandered over to the other side of the room. It was a delight to watch the bird in flight as it flew over in the direction of Rookfield village. He reached over and gently stroked the cat. He leaned over and sloppily kissed her, and she could smell liquor on his breath. As she went to climb over, she fell and clipped her feet on the wall and her whole body flipped and she landed on her head. Loud snores drifted over from one side of the room as someone had become so relaxed they'd fallen asleep. Then he bounded over to the opposite side of the busy pedestrian area to another target. She dunked her head under water and when she came up she swam over to my side of the pool. He crawled over to her side at once and picked up one of her hands, clenching it tightly in his grip. He lifted me over and then one of them grabbed my hand. I wander over to the opposite side of the arena. He immediately rushed over to the area, which was in a barren part of the forest. The gunman went directly over to him, and fired at least three shots.1.1 In or to the place indicated. I'm over here Example sentencesExamples Although the film is due out soon, she confessed she would prefer to have friends over for a visit than go to a premiere. I was drinking in the area so I popped over to have a quick look. As you reach the first curve, you put your arm over to the side and you feel the acceleratio", "n. World ranking points are lower over here, of course, but the standard of play isn't as good. As the ugly scenes on the pitch spilled over into the crowd, police were called to the Corbet Field ground. Nick will do a fantastic job in America because he has played a lot over there. He is sitting somewhere over on the far side of the room. The machine is right over on the other side of the house, and it has never woken us up before. The other side of town is a virtual no go area for us living over here. We've had a lot of fun over here in the last six years, but it's time to go home. I used to read the Craven Herald when I lived over here and always pick it up when back in the area. This is incredibly popular in America and would generate lots of interest over here. He's over in the kitchen area, wearing nothing but his hat and a baggy pair of Y-fronts. I ", "also have a friend who has lived over here for a while and he really sold the city to me as a great place to live. The scenery is brilliant, so why not take a trip west to see how we live over here. Isabel often has friends over for coffee in this room, as there is a playroom for children nearby. Drizzle the lemon juice over and then sprinkle each plate with a tablespoon of olive oil. The live scene over there is very active, but the geography doesn't make touring easy. She says she wishes to have me over for coffee. It is no use the Minister over there shouting across the floor of the House to me.2Beyond and falling or hanging from a point. she knocked the jug over Example sentencesExamples Some the stems of the flowers seem too weak to support the flower, so they bend over and sometimes break off. One of my parsley pots had fallen over, so I picked it up and put it down properly. The oil drum where the male monkey had been sitting began to wobble from side to side and finally toppled right over. It is designed to be difficult to knock over because of gyroscopes that work to keep it upright. In explanation the guard said that it had fallen over as the train was crossing the curve at Neville Hill. It was thought that a candle had fallen over and set alight the paperwork in an office in the garage. It had toppled itself so far over to one side that it had pulled its roots out of the soil. The two rear carriages tipped over on their sides before the train came to a halt.3Used to express action and result. the car flipped over hand the money over Example sentencesExamples It will be preserved and covered over by the floor slab of the new building. His shot from outside the area was just tipped over. Some of us are all too keen on putting our views over and not listening to what's being said. It should ", "also be the case that significant areas should be given over to free parking. She had recently taken over as manager, and decided instead to keep it ope", "n. Initially doubtful, Bird was eventually won over and took control of the project. He handed a small stack of bills over and soon Nathan found himself heading back to his own car. Why hand your cash over to a tout when you could work your passage, get a more secure sleeping area and get in for free? I rolled over and then it was as if someone had thrown a lot of grit into my eyes. The real eyesore was the derelict building we took over, which was covered in vandalism. The boot gets tossed, it teeters on its side then rolls over with the shoe laces facing up. The cards are turned back over and then the next turn begins with two more cards being chose", "n. I looked him over and quickly spotted a few cuts that had not been there the night before. Indeed, Henry became so afraid of the cult that he ordered that the tomb be covered over. It is about keeping the invader out, rather than allowing him in and winning him over to your side. He looked himself over; he was covered in a greenish substance that he did not recognize. Just watch the amiable face cloud over as the subject of passing years is raised. She wrapped it up in a piece of plastic and returned to the restaurant where she handed it over to the duty manager. They ", "also dug over an area of ground which will be used to grow herbs and tomatoes for the school kitche", "n. You have to hand it over to a director and allow them to do what they want to it.3.1 Finished. the match is over message understood, over and out Example sentencesExamples Any chance of further reform across other areas is now over. The Indian series is over and almost immediately in this crowded age it is time to focus on Australia. The question should be whether the halcyon days of direct foreign investment are over. This is comforting somehow; the phoney war is pretty much over and now the real fight begins. Our time together over, I shake hands, thank her for her candour and walk out the door. He waited until the game at Celtic Park was over and then phoned his so", "n. The crisis was over, but both sides were fully aware of how close they had come to nuclear annihilatio", "n. Fifty years of heartache is over for a former Rochdale man who has finally found the sister he has never met. The sterile and confrontational years should be declared over on all sides. Why do so many women think the battle is over? But the game was far from over and the home side were not going to go down without a fight. Now, our national game is in disarray, our World Cup is over and even the Tartan Army have had enough. Sunday evening we managed to come out of our homes, not knowing if it was over or not. Yet the action still wasn't over with the away side determined to rescue some lost pride. Do you know exactly what you want to do with yourself once your undergrad degree is over? Well, the UK General Election is over and not much has changed in the cold light of day. My long weekend is nearly over and then it is back to the drudgery of the workplace. Once this was over we were then subjected to more searches and much x-raying of luggage. I'm going to wait till it's over and then somehow talk to her. When mass was over and more prayers had been said, each body would be brought to its grave by clergy and mourners. Synonymsat an end, finished, concluded, terminated, no more, ended, extinct, gone, dead, a thing of the past, ancient history4Used to express repetition of a process. the jukebox plays every song twice over Example sentencesExamples If you could pick just one day of your life to live over again, which day would you choose? Of course we wouldn't live the same life over, that wouldn't be possible, would it? I loved the book so much that I have read it twice over. As a healthcare professional that is what I observe over and agai", "n. It was the longest sentence he said that day, but he repeated it several times over.noun ˈəʊvəˈoʊvərCricket A sequence of six balls bowled by a bowler from one end of the pitch, after which another bowler takes over from the other end. Example sentencesExamples At that stage, scoring at eight runs an over appeared to be a fantastic display. He would bowl six overs, take wickets and get taken off because he was so unfit. As on Saturday, play went on late because Worcestershire bowled their overs so slowly. His first eight overs yielded just 10 runs and included four wickets. In the Indian first innings, he bowled just six overs at a cost of 32 runs.Phrases(all) over againFrom the beginning for a second or subsequent time. the sums will have to be done over again I tore it up and started all over again Example sentencesExamples This was so good I wanted to start reading it all over again but I had to lend it to a friend to read first. He would have to endure the process all over agai", "n. It wouldn't be necessary to re-try the whole case all over again to determine the question of damages. Becoming world champions undoubtedly boosted our confidence, but now we have to prove we're capable of doing it all over agai", "n. He said the intense media coverage was victimising her all over agai", "n. This season, he has to prove himself all over agai", "n.be overNo longer be affected by. we were over the worst Example sentencesExamples He is now over his cold and is doing better everyday. Wendy has been advised to stay on HRT for only five years, when she should be over her symptoms. We seem to be over the stomach problems now. If I can keep it up right through the weekend I reckon I'll be over the worst of it. Please just strike me down here and now because I am just destined to never be over any of this.get something over withDo or undergo something unpleasant or difficult, so as to be rid of it. Example sentencesExamples I just confessed and pled guilty and got it over with. He wanted to get the whole thing over with. I think he got it over with quickly because he hated auditions, just like me. It was a case of just getting it over with and looking forward to next seaso", "n. Damage was minimal and despite my irritation and extreme annoyance, my only goal was to get the formalities over with, get back into my car and go home. I suppose it was a good idea to get it over with quickly. They made everyone stand up at staff meetings in order to get them over with quickly. We shopped at a leisurely pace in the supermarket, browsing and thinking rather than madly grabbing the same products as last week in order to get it over with. I am just looking forward to getting it over with. While this often seems like a good way of speeding up a painful process and getting it over with, it is certainly no aid to communication or good public speaking.over against1Adjacent to. over against the wall Example sentencesExamples A teacher who had joined the insurgents keeled over against him and whispered, ‘There is no god but God ‘, before dying.’ The bed that was in the center of the room was now over against the left wall. He spied three familiar figures hunched over against the wall. A voice called out, telling them to settle down, and they seated themselves on a mismatch of assorted chairs, a couple perching themselves on barrels and bales over against the wall. Instead it stands over against this process like a mirror held up to it.2In contrast with. over against heaven is hell Example sentencesExamples She is attempting to define herself over against the established powers. In fact, the New Testament is clearer and fuller on this than the Old Testament, as can be seen by looking at what Jesus, the incarnate Son of God, taught about Hell, over against the prophets, for example. She put her sixth-century royal French name and wealth to work for a safe and peaceful women's religious community over against the violence and brutality around her. The Commentary on the Song of Songs points much more in this direction, in that the synagogue and the church are set over against one another as the ‘old Eve’ and the ‘new Eve.’ The Report could have chosen to speak in the strident tone of the Apocalypse, defining the church over against the whore of Babylo", "n. They do not need to define Christianity as a religion of grace over against a religion of law, because they discover in the actual words of Paul that no such contrast exists in his letters. Evangelical Protestantism defines itself over against mainline Protestantism. He sets over against this his own clear spiritual positio", "n. From that perspective, a main problem in the book is its tendency to posit psychosocial explanations over against ecclesiastical, theological, and philosophical turns. But to find this a compelling argument, one must already be convinced of the inalienable sanctity of choice, over against every other social good.over and aboveIn addition to. exceptional service over and above what normally might be expected Example sentencesExamples Any money allows us to improve patient comfort or bring in new equipment that is over and above what we would normally buy for ourselves. He behaved as an employee but had an interest as shareholder over and above that of employee and stood to gain if the company prospered. A farmer may ", "also apply for an additional bond over and above his or her basic quota. The deal included a signing on bonus and an extra £85-a-day over and above their wages. Drill pay, while adequate, is over and above what they are paid on their civilian jobs. There are some locations where traffic calming, over and above that provided by the existing laws of the highway, may be desirable. In fact, he had made a new addition to his daily itinerary over and above what he had been doing before. Each target audience requires information that is unique to itself over and above the general informatio", "n. Any profit they make over and above the interest charges of the loan, increases the value of the fund for all participating investors. It is not envisaged that the proposal will lead to any increase in noise from the site over and above any that may be generated at present. Synonymsin addition to, on top of, over and beyond, plus, as well as, besides, not to mention, along with, let aloneover and done withCompletely finished. Example sentencesExamples My only hope at this point is that they get this wretched debacle over and done with as soon as possible, and preferably before it gets really messy. We go up and do our training, get it over and done with, and try not to be distracted by what people are saying about the match. I'm not too concerned about the exam, just looking forwards to getting it over and done with. It is a strange feeling to work on this project for a whole year, only for it to be over and done with in what feels like the blink of an eye. But all we want to do is get it over and done with and hope that our daughter can go on to lead a normal life. It was as if everyone was waiting for the official speeches to be over and done with. I'd like to get this over and done with as quickly as possible. The longer this fiasco goes on, then the more shareholders are going to be hurt, so let's get it over and done with as quickly as possible. Thank goodness that's all over and done with for another year. If I have to testify I ask that it be done as soon as possible, because I just want to get this over and done with and get on with my life. Synonymscompleted, concluded, consummated, finalized, terminated, over and done with, over, in the past, at an endover and overAgain and agai", "n. doing the same thing over and over again Example sentencesExamples Repeat this over and over at gradually lengthening intervals until your baby goes to sleep. There is this song repeating itself over and over in my head but I can't get further than a few words. She read the novel over and over. I liked The Jungle Book soundtrack which I used to play over and over on my tape player. It one of those movies you can watch over and over. Synonymsrepeatedly, again and again, over and over again, time and again, time and time again, many times over, on many occasions, on several occasions, often, frequently, recurrently, constantly, continually, persistently, regularly, habitually, ad nauseamover to youinformal Used to say that it is now your turn or responsibility. it's over to you, the people of Scotland, to decide who should win Example sentencesExamples The nominees have been suggested by our judging panel but it's over to you to decide who should wi", "n. Over to you to discuss whatever you want in the world of football transfers Over to you consumer: vote with your feet. We think this sums up things more eloquently than we ever could, so over to you Joh", "n. Anyway, it's over to you now to listen to five of our favorites and pick the one that you fancy the most!OriginOld English ofer, of Germanic origin; related to Dutch over and German über, from an Indo-European word (originally a comparative of the element represented by -ove in above) which is ", "also the base of Latin super and Greek huper.RhymesCanova, Casanova, clover, Dover, drover, Grsbover, Jehovah, left-over, Markova, Moldova, moreover, Navrátilová, nova, ova, Pavlova, rover, trover, up-and-over", "prep.1 phr.Definition of over in US English: over prepositionˈōvərˈoʊvər1Extending directly upward from. I saw flames over Berlin Example sentencesExamples Put the yolk in a metal bowl, held close to a flame but not over it, and mix until it turns white. Heat the oil in a large saucepan, add the leeks and bay leaves, and fry over a high heat until the leeks have some colour. Add olives to the pan and cook over a moderate heat until they begin to wrinkle. If you position your eyes directly over the ball then your eyes will always be aligned with the hole. Keep mixing the roux over the flame until the mixture comes off the sides of the pot. For a more reliable source, you need to be directly over the clay seam where the fossils are buried. We are welcomed in with open arms and hearts, and they prepare beautiful food, cooked over an open fire. Cook over a gentle heat for five minutes, and then add the chopped anchovies and the olives. Lift the fish out onto warm plates and place the baking dish over a moderate flame. They were meant to be cooked the rest of the way by the diners over a flame that was brought in for that purpose. Let it cook over a relatively low heat till the bottom has formed a golden crust. This brings the centre of gravity directly over the right foot, which supports her weight. The meat is seared over the hottest flames, then moved to a cooler part of the fire to cook gently through. Cook over a high heat until just wilted, cool a bit, then squeeze out most of the moisture. In a large heavy pan, melt half the butter with the oil over a moderate heat. This occurred when a new building was built directly over the top of the remains of its predecessor. Continue to cook over a low heat until vegetables are submerged in their own liquid. Cook over a fairly high heat for two to three minutes, then add the tomatoes and juices. Soaring directly over our heads, she disappears back into the main current and is gone. Melt the fat in a pan, beat the egg and milk together, add to the fat in the pan, season well and cook over a gentle heat. Synonymsabove, on top of, higher than, higher up than, atop1.1 Above so as to cover or protect. an oxygen tent over the bed ladle this sauce over fresh pasta Example sentencesExamples It was only when the council put a thick layer of clay over it that this flora was lost. Sprinkle cracker crumbs evenly over the bottom and sides, then pour in the ricotta mixture. Two engineers were then able to pull up the two covers over the damaged cable. He was on his bed with the covers over him and she thought he was asleep. Mix well and spray thoroughly over both sides of the foliage and onto the offending pest. I turned up to the theatre in the costume and a couple of people threw coffee over me. Mix together the salt and sugar, and rub evenly over both sides of the salmo", "n. He innocently assumed that a steel cover placed over a drainpipe was safe to walk o", "n. Many of you suggested laying small lengths of holly over the damaged area of garde", "n. They had set up a shelter over their fire. She then ran into the bedroom where her husband finally poured water over the flames. The blast from the bomb had blown out all the windows but my mother had pulled the covers over us. Scatter the fresh coriander over the curry and serve with plain boiled rice. When I stop the car for a while and switch off the engine, the silence falls like a cloak over the countryside. Place a layer of tomato slices over the pesto then top with crumbled cheese. The cloths were laid on the ground directly over the plants and fixed with spikes. They have looked into loaning some covers to put over the pitch tomorrow night in case of overnight frost. In case of cold weather, it would be a good idea to apply a layer of mulch over the bulbs. The kettle had boiled so Don poured the water over the coffee powder in the mug. A kind of invisible bell jar had been dropped over it, protecting it from change.1.2 Extending above (a general area) from a vantage point. views over Hyde Park Example sentencesExamples Looking over the side you would expect to see a treasure chest full of gold. He walked to the single window looking out over the front lawn and road and opened it. A sunroom looks out over the vegetable garde", "n. She looks out of the window over the parking lot and slides the tray of untouched fries away. Even on the stormy day that we visited, the vista over some of the uninhabited islands was magical. This area has great views over the rear garden through large windows and a set of patio doors. Still wearing her pajamas she went onto the balcony and looked over the front lawns. There's a large outside balcony area which faces South over the city centre rooftops. This is a gracious and welcoming house with spectacular views over open countryside. Synonymsacross, on to, around, throughout, all through, throughout the extent of, everywhere in, in all parts of2At a higher level or layer tha", "n. watching a television hanging over the bar Example sentencesExamples Just to make sure, I now usually use a second layer of bandage over the first. Sherry had another excellent chance after 27 minutes but he sent his header over the bar. A pair of tame shots by Ben Thornley that floated up and over the bar were as much as they could muster in the first half. He then had an opportunity to put the visitors level but he flicked the shot just over the cross bar. The ball eventually came into the possession of Mike Cooper and he stuck it over the bar. He whipped in a viciously dipping shot that spun just a foot over the bar. The volley sailed over the front rank of soldiers and fell among the battle leaders beyond. He thumped a chance over the bar. The drysuit can be worn over a layer of clothing and it keeps its wearer completely dry and warm. Byatt almost doubled his tally seven minutes later after a fine run ended with his shot whistling over the bar. Then they must either transfer it quickly either over the bar or to a player in a better positio", "n. At the other end, a speculative lob from Ian Duncan dipped just over the bar. This was done from the rear of the ranks in most circumstances, and over the heads of the shield wall of the thrower. After a long delay, he stepped up to sky the spot-kick over the bar. His sweet right shot looked destined for the net but just sailed over the bar. They were used and enjoyed by townsfolk who lived over their businesses and were unable to escape to a garde", "n. The office was over a newsagent's shop in the centre of Manchester. His powerful shot was just over the bar. Synonymsabove, on top of, higher than, higher up than, atop2.1 Higher in grade or rank tha", "n. over him is the financial director Example sentencesExamples John had two levels of management over him. He had six senior officers over him. The first-level manager, of course, has another manager over him. Synonymssuperior to, above, higher up than, more powerful than, in charge of, responsible for, commanding2.2 Expressing authority or control. editorial control over what is included Example sentencesExamples Britain retains sovereign rights over two areas to be used as military bases. Help them to regain a sense of control over their life by offering choices and options. Family doctors in England are being given control over the budgets which buy hospital services. This time they will choose a government that will have real power over the direction of the country. Second, it centralises that information and gives you control over what is visible to others. What they will not put up with, however, is a lack of control over other people. However, the ship was teeming with children whose parents had absolutely no control over them. At this time there was little or no control over speed boats by the authorities. They ", "also insist local authorities will still have some control over their own waste policies. Also, I always feel as though I have a certain measure of control over the situatio", "n. He is no longer the grim dictator with the power of life and death over his subjects. They seemed less stressed and they acted as if they had real control over what they were doing. This structure is one which allows the spectator a degree of power over what is see", "n. Let's hope it is just a first step in giving back people control over their own lives. Those receiving benefits would be given control over their own training budgets. However, a Ministry of Defence official says his department has no control over the plant. He is concerned about the local education authority losing some control over the school. The charity said that women who had babies at home tended to have greater privacy and more control over the birth. The membership of the party have no say over the policy and direction of the party. Instead, the locals enjoy their town and impose some control over the speed of motor vehicles using it.2.3 Expressing preference. I'd choose the well-known brand over that one Example sentencesExamples It ", "also reveals a preference for debt over equity as a means of providing external funding. The choice of a sloping tiled roof over a flat roof had more to do with the local climatic conditions than with style. The evidence that the country's people would have preferred an invasion over other options is slight. It is necessary to look at the grounds on which we are persuaded to prefer one theory over another. Either way, give me this lot over a bunch of monosyllabic scowlers any day. Do seed predators, floral herbivores and pollinators prefer one sex over the other? Since then the cartel has been attempting to show how responsible it is and has favoured price over volume. In terms of manufacture and for aesthetic reasons, plastics are preferred over metal. For those hoping to stay, it should be noted that their manager considers attitude over ability. The shares are best left for those who prefer hope over reality with their investments. In the old days, we used to prefer the wider good over personal convenience. For long distances, he prefers the bus over airliners or rail because he likes the atmosphere. How could anyone prefer that over a real democracy that had evolved since the end of World War Two? None of this persuades me that my preference for poetry over politics is a wrong choice. Is care and concern always to be preferred over more emotionally detached ways of relating to others? It seems to be working as the family audience are slowly preferring it over other films.2.4 Expressing greater number. there was a slight predominance of boys over girls Example sentencesExamples Care was taken to attend showings at which the audience contained a predominance of adults over children There was an excess of men over wome", "n.2.5 Higher in volume or pitch tha", "n. he shouted over the noise of the taxis Example sentencesExamples Rogers screamed over the noise of rifle shots ringing out through the cool, night air. The television screen was enormous, but I had to turn up the volume to hear it over the roar of Park Lane. The noise got so loud we had to shout over it. I shouted over the noise. I loved it so much that I wanted to shout about it over the cacophony of the real world. There was some music playing in the background, which could barely be heard over the noise. Much of the night was spent shouting at increasing volumes over ear-splitting music. A confused babble of voices rose over the hubbub. People crowded round the bar frantically shouting their orders over the noise of the band. Hearing him shout over a rumbling beat is one of life's singular pleasures.3Higher than or more than (a specified number or quantity) over 40 degrees C they have lived together for over a year Example sentencesExamples He was trapped in the car, which burst into flames, for over an hour. We raise such a hue and cry when a tree is cut down, but with every heavy shower over a dozen trees fall. As the globe warms and over a billion people live on less than one dollar a day, a global left is needed more than ever. Most of the material is stuff we'd been playing in front of live audiences for over a year. In some areas of the county over half the number of fires reported are started deliberately. She was born in Oxford and has lived in Ireland for over twenty five years. Applicants must be over 25 and have had a clean driving licence for more than five years. The house, which is very elegant, had not been lived in for over four years and was slowly crumbling away. I have friends who have lived in Thailand for over thirty years and can't speak a work of Thai. The shores of these islands are often sandy but temperatures over 30 degrees are rare. Water in the house reached a level of over three feet and considerable damage was caused. Mind you, I think it was probably over thirty degrees when this was filmed earlier today. Flood levels over three meters deep drowned cars and drove people from their homes. Pensions have fallen in value by over a third since the change was introduced. We spent a lot of time together, well over two months, and so we really got to know each other. The age of some of the rocks in the area has been a subject of debate by geologists for over 150 years. On that basis the unemployment levels of those over forty are not reasonable. The house, the entrance lodge and garden of just over an acre comprise lot one. We had been together for over a year, but I left him because everything he did seemed so boring and dull. In fact he supervised the production of over 30 volumes in his role as general editor. Synonymsmore than, above, in excess of, exceeding, upwards of, beyond, greater than4Expressing passage or trajectory across. she trudged over the lawn Example sentencesExamples We headed off down Pierce's Passage and over a muddy boulder slope until we reached some cascades. Flying over vast areas of vegetation, the scale of the disaster caused by the floods begins to unfold. Police, including six armed officers, swarmed over the area and the gangsters fled. Clamber over this, and follow the passage through a short canal to a rope climb up a rift. The pace picks up as the river flows swift and shallow over a rocky bed. Ranks closed and the birds swept over the estuary, rising and falling, packed together. A small climb up over a muddy slope gains a corner with some fine formations. Then it was time to go home and everyone started to drive over the newly fallen snow in their cars with the big fat tyres on them. Some headed directly east: over the mountains and into the tribal areas of Pakista", "n. An injured climber walked for a mile over rocky terrain after falling off a cliff and breaking his arm and foot. Together we bounded over a meadow and parked the car on the edge of a copse. The more obvious route goes directly up the ridge over steep, rocky ground, though there is a path to follow. It was possible that a big cat could roam over a huge area. Once changed we set off over the fell with the rain thankfully absent for the time being. Ignore side roads as you go up the hill and over a cross roads with traffic lights. The Act, creates a new legal right to roam over areas, mapped as open land and registered common land. Synonymsacross, on to, around, throughout, all through, throughout the extent of, everywhere in, in all parts of4.1 Beyond and falling or hanging from. it toppled over the cliff Example sentencesExamples He fell 25 feet over a ledge and suffered head injuries after crashing into rocks. It drops over the side of the canoe as I try to store it away in a waterproof container. When we moved off and dropped over the hull side, however, we found the visibility was as good as 1m! I scowled into the night, took a swig of my beer and dumped the rest over the side of the deck. There are five people on board and you have to decide who to chuck over the side to save the rest. Cars had been crushed like balls of paper, and chucked over the side of the bridges. Can I report a loss because I have dropped my wallet over the side of the boat on the way back from France? Six-foot waves crash over the sides of the landing craft and several are swamped. They wrapped the first bomb in a sack and carefully rolled it over the side, where it exploded. Bait and decoys keep the sharks close to the boats, and a cage can then be dropped over the side for a diver to get a much closer look. Many of the owners are given time frames of how long it will be before their homes topple over the cliff. On a perfect day, with someone on shark-watch, we had leapt over the side to go for a swim. They roll him over on his side and his arm flaps limply over the side of the gurney. As it is, any adult proposing to get comfortable back there is going to have to dangle their feet over the sides. They claimed they were breaching a crazy law that was forcing them to dump fish caught in their nets over the side. Her long, brown legs were draped over the side of the boat. He left the pub alone at closing time and must have fallen over the wall on his walk home. He is splashing fish heads over the side of the boat, looking sick and out of place. Working on a film in St Lucia, he almost crashes a bus over the side of a ravine. Wounded in the leg, he fell back over a ledge and was fortunate to be snagged by a tree.4.2 At the other side of; beyond. over the hill is a small village Example sentencesExamples Over the river, King's College has an absolutely stunning Fellows' Garde", "n. He sits next to his Personal Assistant, with his sales and marketing director over the partitio", "n. Just over the other side of the mountain, on the other slope at 770 foot, is the weather statio", "n. There is a village over the river from Liverpool called Port Sunlight. She asks if he could give her a lift to a town over the border.5Expressing duratio", "n. she told me over coffee inventories have been refined over many years Example sentencesExamples In just over a month the area was evacuated and the village literally vanished off the map. We talk over coffee in his small Knightsbridge office, where he employs just one assistant. They will be able to pay £12 a month over three years to cover their end of the deal. Security forces were thought to have largely cleaned up the area over the past two years. The couple said they will be organising lots of fundraising events over the coming year. I've been in a lot of interesting places over the past two years and worked with some really great people. We had a longer day care service, holiday cover and respite care over the weekend. Attacks on staff have increased in almost all areas of the NHS over the last 10 years. The cost of generating electricity by wind power has fallen dramatically over the past few years. My memory of the entrance passages had faded over the years, so we took a few wrong turnings. To enjoy these bulbs year after year, they must be dug up in fall and stored indoors over the winter. With the fine weather there has been a huge increase in visitors to the area over the past month or so. The direction of the markets over the coming months will largely be down to American interest rates. Collectors from the scheme will be calling to homes in the area over the coming two weeks. Police are ", "also linking the duo to two other attacks in the Nottinghamshire area over the past few days. Alan eventually broke the news to her over a cup of coffee when they got home. There has been an increase in firearm crime in the area over the last five years. The stones of the path had been polished by the passage of feet over hundreds, if not thousands, of years. Search teams have been combing the area over the weekend but have so far been unable to trace the murder weapo", "n. However, a number of the York side have improved over the last year and a close result is forecast.6By means of; by the medium of. a voice came over the loudspeaker Example sentencesExamples His or her face is illuminated with a soft red light, and white noise is played over headphones. The crowd listened in silence as the service was broadcast over loudspeakers. The company ", "also put out Madonna's concert at Slane live over the internet last year. The lights began to dim out and then a voice was heard over the microphone. Customers will get used to making free voice calls over the internet. Within a few moments a reply was clearly voiced over the small speaker in the headrest of the chair. My husband heard the shouts over the phone and called the police when he realised I was being robbed. The Dominoes On Line web site enables you to play dominoes live over the Internet. She printed a map with instructions, but he insisted on giving directions over the phone. Although not available in Orkney, the station broadcasts live over the internet. Increasingly customers buy insurance direct over the phone, or on the internet. These could be used to attract more sales, perhaps even direct sales over the internet. This is usually much more expensive than buying direct over the telephone or internet. The almost robotic voice of the security office fizzed over the voice comm. The lights over the rink dimmed and flashed colors, and a slow song came on over the loudspeakers. This month's Athens Olympics will become the first to be broadcast live over the Net.7On the subject of. a heated debate over unemployment Example sentencesExamples Many couples fall out over the house when they separate since it is usually the biggest asset. The traffickers then had a gunbattle with a rival drug gang over drug selling areas. He has been getting a lot more aggressive recently over such trivial things as the housework and his dinner. We need joint union rallies over pensions and a serious campaign among rank and file members. MPs said it was a straight fight between the two sides over who would win approval for a new medical school. This incident raises fresh concerns over safety, and public access to the water's edge. The protagonists are ex-college buddies who fell out over a girl called Betty Anne. The next battles were over the first direct elections to the European Parliament. New figures show that the highest number of complaints are made over domestic noise. We argue all the time, whether it's over my driving or directions or anything really. The debate over the use of cannabis in medicine is controversial and emotive. There is a great deal of debate over the safety of buying on the internet. Right now, the world is faced with a debate over how to deal with the water crisis. Protests were staged in Kew on Monday over fresh attempts by a phone company to put up a mast in North Road. That has raised fresh concerns over the nation's ability to pull itself out of recessio", "n. Publicans are falling out over new licensing laws allowing pubs to open much later. After bringing the railways to the city, he fell from grace over dodgy financial dealings. A fresh row has erupted over the thorny issue of a northern bypass for Witham. There has been a strong feeling among rank and file workers to walk out over this issue. There were concerns over your level of alcohol consumption and its effect on your conduct. Synonymson the subject of, about, concerning, apropos of, with reference to, speaking of, with regard to, with respect to, regarding, as regards, relating to, respecting, in connection with, as for, readverbˈōvərˈoʊvər1Expressing passage or trajectory across an area. he leaned over and tapped me on the hand Example sentencesExamples He leaned over and sloppily kissed her, and she could smell liquor on his breath. As she went to climb over, she fell and clipped her feet on the wall and her whole body flipped and she landed on her head. It was a delight to watch the bird in flight as it flew over in the direction of Rookfield village. He crawled over to her side at once and picked up one of her hands, clenching it tightly in his grip. Loud snores drifted over from one side of the room as someone had become so relaxed they'd fallen asleep. He reached over and gently stroked the cat. The gunman went directly over to him, and fired at least three shots. He lifted me over and then one of them grabbed my hand. He immediately rushed over to the area, which was in a barren part of the forest. I put it back to its original position and wandered over to the other side of the room. She dunked her head under water and when she came up she swam over to my side of the pool. Then he bounded over to the opposite side of the busy pedestrian area to another target. I wander over to the opposite side of the arena.1.1 In or to the place mentioned or indicated. over here come over and cheer us up Example sentencesExamples The machine is right over on the other side of the house, and it has never woken us up before. As you reach the first curve, you put your arm over to the side and you feel the acceleratio", "n. Isabel often has friends over for coffee in this room, as there is a playroom for children nearby. Drizzle the lemon juice over and then sprinkle each plate with a tablespoon of olive oil. He's over in the kitchen area, wearing nothing but his hat and a baggy pair of Y-fronts. He is sitting somewhere over on the far side of the room. Nick will do a fantastic job in America because he has played a lot over there. As the ugly scenes on the pitch spilled over into the crowd, police were called to the Corbet Field ground. The live scene over there is very active, but the geography doesn't make touring easy. We've had a lot of fun over here in the last six years, but it's time to go home. This is incredibly popular in America and would generate lots of interest over here. She says she wishes to have me over for coffee. I was drinking in the area so I popped over to have a quick look. World ranking points are lower over here, of course, but the standard of play isn't as good. The scenery is brilliant, so why not take a trip west to see how we live over here. Although the film is due out soon, she confessed she would prefer to have friends over for a visit than go to a premiere. It is no use the Minister over there shouting across the floor of the House to me. The other side of town is a virtual no go area for us living over here. I used to read the Craven Herald when I lived over here and always pick it up when back in the area. I ", "also have a friend who has lived over here for a while and he really sold the city to me as a great place to live.2Beyond and falling or hanging from a point. listing over at an acute angle Example sentencesExamples The two rear carriages tipped over on their sides before the train came to a halt. In explanation the guard said that it had fallen over as the train was crossing the curve at Neville Hill. One of my parsley pots had fallen over, so I picked it up and put it down properly. It was thought that a candle had fallen over and set alight the paperwork in an office in the garage. It is designed to be difficult to knock over because of gyroscopes that work to keep it upright. Some the stems of the flowers seem too weak to support the flower, so they bend over and sometimes break off. The oil drum where the male monkey had been sitting began to wobble from side to side and finally toppled right over. It had toppled itself so far over to one side that it had pulled its roots out of the soil.3Used to express action and result. the car flipped over hand the money over Example sentencesExamples The real eyesore was the derelict building we took over, which was covered in vandalism. Just watch the amiable face cloud over as the subject of passing years is raised. His shot from outside the area was just tipped over. It is about keeping the invader out, rather than allowing him in and winning him over to your side. Initially doubtful, Bird was eventually won over and took control of the project. He looked himself over; he was covered in a greenish substance that he did not recognize. It should ", "also be the case that significant areas should be given over to free parking. I looked him over and quickly spotted a few cuts that had not been there the night before. He handed a small stack of bills over and soon Nathan found himself heading back to his own car. They ", "also dug over an area of ground which will be used to grow herbs and tomatoes for the school kitche", "n. It will be preserved and covered over by the floor slab of the new building. The boot gets tossed, it teeters on its side then rolls over with the shoe laces facing up. The cards are turned back over and then the next turn begins with two more cards being chose", "n. I rolled over and then it was as if someone had thrown a lot of grit into my eyes. You have to hand it over to a director and allow them to do what they want to it. Why hand your cash over to a tout when you could work your passage, get a more secure sleeping area and get in for free? She wrapped it up in a piece of plastic and returned to the restaurant where she handed it over to the duty manager. Some of us are all too keen on putting our views over and not listening to what's being said. She had recently taken over as manager, and decided instead to keep it ope", "n. Indeed, Henry became so afraid of the cult that he ordered that the tomb be covered over.3.1 Finished. the match is over message understood, over and out Example sentencesExamples Well, the UK General Election is over and not much has changed in the cold light of day. Now, our national game is in disarray, our World Cup is over and even the Tartan Army have had enough. Our time together over, I shake hands, thank her for her candour and walk out the door. He waited until the game at Celtic Park was over and then phoned his so", "n. Why do so many women think the battle is over? Once this was over we were then subjected to more searches and much x-raying of luggage. When mass was over and more prayers had been said, each body would be brought to its grave by clergy and mourners. This is comforting somehow; the phoney war is pretty much over and now the real fight begins. Fifty years of heartache is over for a former Rochdale man who has finally found the sister he has never met. The sterile and confrontational years should be declared over on all sides. Yet the action still wasn't over with the away side determined to rescue some lost pride. I'm going to wait till it's over and then somehow talk to her. Any chance of further reform across other areas is now over. My long weekend is nearly over and then it is back to the drudgery of the workplace. The Indian series is over and almost immediately in this crowded age it is time to focus on Australia. Do you know exactly what you want to do with yourself once your undergrad degree is over? But the game was far from over and the home side were not going to go down without a fight. The question should be whether the halcyon days of direct foreign investment are over. Sunday evening we managed to come out of our homes, not knowing if it was over or not. The crisis was over, but both sides were fully aware of how close they had come to nuclear annihilatio", "n. Synonymsat an end, finished, concluded, terminated, no more, ended, extinct, gone, dead, a thing of the past, ancient history4Used to express repetition of a process. twice over the sums will have to be done over again Example sentencesExamples Of course we wouldn't live the same life over, that wouldn't be possible, would it? If you could pick just one day of your life to live over again, which day would you choose? I loved the book so much that I have read it twice over. As a healthcare professional that is what I observe over and agai", "n. It was the longest sentence he said that day, but he repeated it several times over.nounˈōvərˈoʊvərCricket A sequence of six balls bowled by a bowler from one end of the pitch. Example sentencesExamples In the Indian first innings, he bowled just six overs at a cost of 32 runs. As on Saturday, play went on late because Worcestershire bowled their overs so slowly. His first eight overs yielded just 10 runs and included four wickets. At that stage, scoring at eight runs an over appeared to be a fantastic display. He would bowl six overs, take wickets and get taken off because he was so unfit.Phrasesbe overNo longer be affected by. we were over the worst Example sentencesExamples We seem to be over the stomach problems now. Wendy has been advised to stay on HRT for only five years, when she should be over her symptoms. If I can keep it up right through the weekend I reckon I'll be over the worst of it. Please just strike me down here and now because I am just destined to never be over any of this. He is now over his cold and is doing better everyday.get something over withDo or undergo something unpleasant or difficult, so as to be rid of it. Example sentencesExamples I am just looking forward to getting it over with. They made everyone stand up at staff meetings in order to get them over with quickly. We shopped at a leisurely pace in the supermarket, browsing and thinking rather than madly grabbing the same products as last week in order to get it over with. I suppose it was a good idea to get it over with quickly. I think he got it over with quickly because he hated auditions, just like me. I just confessed and pled guilty and got it over with. While this often seems like a good way of speeding up a painful process and getting it over with, it is certainly no aid to communication or good public speaking. He wanted to get the whole thing over with. Damage was minimal and despite my irritation and extreme annoyance, my only goal was to get the formalities over with, get back into my car and go home. It was a case of just getting it over with and looking forward to next seaso", "n.over against1Adjacent to. over against the wall Example sentencesExamples The bed that was in the center of the room was now over against the left wall. He spied three familiar figures hunched over against the wall. A teacher who had joined the insurgents keeled over against him and whispered, ‘There is no god but God ‘, before dying.’ A voice called out, telling them to settle down, and they seated themselves on a mismatch of assorted chairs, a couple perching themselves on barrels and bales over against the wall. Instead it stands over against this process like a mirror held up to it.1.1In contrast with. over against heaven is hell Example sentencesExamples The Commentary on the Song of Songs points much more in this direction, in that the synagogue and the church are set over against one another as the ‘old Eve’ and the ‘new Eve.’ Evangelical Protestantism defines itself over against mainline Protestantism. She is attempting to define herself over against the established powers. The Report could have chosen to speak in the strident tone of the Apocalypse, defining the church over against the whore of Babylo", "n. They do not need to define Christianity as a religion of grace over against a religion of law, because they discover in the actual words of Paul that no such contrast exists in his letters. But to find this a compelling argument, one must already be convinced of the inalienable sanctity of choice, over against every other social good. She put her sixth-century royal French name and wealth to work for a safe and peaceful women's religious community over against the violence and brutality around her. From that perspective, a main problem in the book is its tendency to posit psychosocial explanations over against ecclesiastical, theological, and philosophical turns. In fact, the New Testament is clearer and fuller on this than the Old Testament, as can be seen by looking at what Jesus, the incarnate Son of God, taught about Hell, over against the prophets, for example. He sets over against this his own clear spiritual positio", "n.over and aboveIn addition to. exceptional service over and above what normally might be expected Example sentencesExamples Any profit they make over and above the interest charges of the loan, increases the value of the fund for all participating investors. Each target audience requires information that is unique to itself over and above the general informatio", "n. He behaved as an employee but had an interest as shareholder over and above that of employee and stood to gain if the company prospered. It is not envisaged that the proposal will lead to any increase in noise from the site over and above any that may be generated at present. Any money allows us to improve patient comfort or bring in new equipment that is over and above what we would normally buy for ourselves. In fact, he had made a new addition to his daily itinerary over and above what he had been doing before. There are some locations where traffic calming, over and above that provided by the existing laws of the highway, may be desirable. A farmer may ", "also apply for an additional bond over and above his or her basic quota. The deal included a signing on bonus and an extra £85-a-day over and above their wages. Drill pay, while adequate, is over and above what they are paid on their civilian jobs. Synonymsin addition to, on top of, over and beyond, plus, as well as, besides, not to mention, along with, let aloneover and done withCompletely finished. Example sentencesExamples Thank goodness that's all over and done with for another year. I'd like to get this over and done with as quickly as possible. If I have to testify I ask that it be done as soon as possible, because I just want to get this over and done with and get on with my life. But all we want to do is get it over and done with and hope that our daughter can go on to lead a normal life. The longer this fiasco goes on, then the more shareholders are going to be hurt, so let's get it over and done with as quickly as possible. We go up and do our training, get it over and done with, and try not to be distracted by what people are saying about the match. It is a strange feeling to work on this project for a whole year, only for it to be over and done with in what feels like the blink of an eye. My only hope at this point is that they get this wretched debacle over and done with as soon as possible, and preferably before it gets really messy. It was as if everyone was waiting for the official speeches to be over and done with. I'm not too concerned about the exam, just looking forwards to getting it over and done with. Synonymscompleted, concluded, consummated, finalized, terminated, over and done with, over, in the past, at an endover and overAgain and agai", "n. Example sentencesExamples I liked The Jungle Book soundtrack which I used to play over and over on my tape player. She read the novel over and over. There is this song repeating itself over and over in my head but I can't get further than a few words. It one of those movies you can watch over and over. Repeat this over and over at gradually lengthening intervals until your baby goes to sleep. Synonymsrepeatedly, again and again, over and over again, time and again, time and time again, many times over, on many occasions, on several occasions, often, frequently, recurrently, constantly, continually, persistently, regularly, habitually, ad nauseamover to youinformal Used to say that it is now your turn or responsibility. it's over to you, the people of Scotland, to decide who should win Example sentencesExamples Over to you to discuss whatever you want in the world of football transfers The nominees have been suggested by our judging panel but it's over to you to decide who should wi", "n. Anyway, it's over to you now to listen to five of our favorites and pick the one that you fancy the most! We think this sums up things more eloquently than we ever could, so over to you Joh", "n. Over to you consumer: vote with your feet.OriginOld English ofer, of Germanic origin; related to Dutch over and German über, from an Indo-European word (originally a comparative of the element represented by -ove in above) which is ", "also the base of Latin super and Greek huper.", "prep.1 phr.  Definition of over-under in US English: over-under(", "also over/under) noun US 1A bet on whether the outcome of an event (usually the combined score of a sports game) will be above or below a number established in advance by the bookmaker. the over-under in hockey gives you less chance of losing Example sentencesExamples I stayed away from the over-and-under on the winning score, which Sherman posted as 4 1/2 - under-par, because I think that's about the right number. He was more interested in crap games, the over-and-under, the horses, and selling sweaters out of the trunk of his car. There is a special index in the book rating ballparks for Total Number of Runs per game - if you're a Totals (Over-Under) bettor, this would be helpful material. In sports betting, there are just a few bets that are considered to be regular bets and the over/under is one of them.1.1 The number (usually the combined score of a sports game) on which bettors place wagers in an over-under bet. oddsmakers had set the over-under at 53, higher than any other game this week figurative what's the over-under on how many fanatics will camp out? Example sentencesExamples What is the over-under on Weaver? Now, if I were a slow writer, then that could present a problem, especially since I review a lot of adventures, and the over-under for adventures is in the neighborhood of eight hours. Is an over-under of 60 out of the question? What is the over-under on Weaver's arrival in the major leagues? I don't know what the over-under was on him grabbing himself just below the belt buckle (38?). I put the over-under on e-mails to you complaining about O'Brien today at an even four hundred. As Walters puts it, \"The over-under on me was 39 years old, and not many guys took the over.\" The site has set the over-under on Peyton Manning's completion percentage vs. New England at 67.5 percent. The Over-Under is in the 47-48 range.2A gun having barrels arranged one above the other rather than side by side. if shooting an over-under, have the upper barrel pointing over and the lower barrel under the bird Example sentencesExamples If I ever do display my gun (a very ornate over-under shotgun built for skeet and trap shooting), it's only to adults, and after I've pulled the case from the back of my closet, opened it, and broken the action to make sure its unloaded. The EAA/Baikal line includes the MP-233 over-and-under, which features hammer-forged barrels, chrome-lined bores, machined receivers, walnut stocks and internal screw chokes. It's tough to beat the Red Label over-and-under. Remington's only over-and-under, the Model 332 12 gauge has been enhanced with a \"dressed-up\" appearance and traditional engraving. Last year, Browning introduced the Citori 525 over-and-under. The over-under guns tend to be at the more expensive end of the spectrum. Beretta's upgraded S682 Gold E competition over-and-under features a low-profile receiver in a dual-color finish, new internal barrel configuration, Optima-Bore and new Optima-Choke tubes.Definition of over-under in US English: over-under(", "also over/under) nounUS 1A bet on whether the outcome of an event (usually the combined score of a sports game) will be above or below a number established in advance by the bookmaker. the over-under in hockey gives you less chance of losing Example sentencesExamples There is a special index in the book rating ballparks for Total Number of Runs per game - if you're a Totals (Over-Under) bettor, this would be helpful material. He was more interested in crap games, the over-and-under, the horses, and selling sweaters out of the trunk of his car. I stayed away from the over-and-under on the winning score, which Sherman posted as 4 1/2 - under-par, because I think that's about the right number. In sports betting, there are just a few bets that are considered to be regular bets and the over/under is one of them.1.1 The number (usually the combined score of a sports game) on which bettors place wagers in an over-under bet. oddsmakers had set the over-under at 53, higher than any other game this week figurative what's the over-under on how many fanatics will camp out? Example sentencesExamples I don't know what the over-under was on him grabbing himself just below the belt buckle (38?). I put the over-under on e-mails to you complaining about O'Brien today at an even four hundred. What is the over-under on Weaver? Is an over-under of 60 out of the question? What is the over-under on Weaver's arrival in the major leagues? The site has set the over-under on Peyton Manning's completion percentage vs. New England at 67.5 percent. As Walters puts it, \"The over-under on me was 39 years old, and not many guys took the over.\" Now, if I were a slow writer, then that could present a problem, especially since I review a lot of adventures, and the over-under for adventures is in the neighborhood of eight hours. The Over-Under is in the 47-48 range.2A gun having barrels arranged one above the other rather than side by side. if shooting an over-under, have the upper barrel pointing over and the lower barrel under the bird Example sentencesExamples If I ever do display my gun (a very ornate over-under shotgun built for skeet and trap shooting), it's only to adults, and after I've pulled the case from the back of my closet, opened it, and broken the action to make sure its unloaded. Last year, Browning introduced the Citori 525 over-and-under. Remington's only over-and-under, the Model 332 12 gauge has been enhanced with a \"dressed-up\" appearance and traditional engraving. It's tough to beat the Red Label over-and-under. The EAA/Baikal line includes the MP-233 over-and-under, which features hammer-forged barrels, chrome-lined bores, machined receivers, walnut stocks and internal screw chokes. Beretta's upgraded S682 Gold E competition over-and-under features a low-profile receiver in a dual-color finish, new internal barrel configuration, Optima-Bore and new Optima-Choke tubes. The over-under guns tend to be at the more expensive end of the spectrum."]}, {"dict": "Oxford5000", "values": ["be overSee overDefinition of over in English: over preposition ˈəʊvəˈoʊvər1Extending directly upwards from. I saw flames over Berlin cook the sauce over a moderate heat Example sentencesExamples Cook over a high heat until just wilted, cool a bit, then squeeze out most of the moisture. Put the yolk in a metal bowl, held close to a flame but not over it, and mix until it turns white. Melt the fat in a pan, beat the egg and milk together, add to the fat in the pan, season well and cook over a gentle heat. Let it cook over a relatively low heat till the bottom has formed a golden crust. They were meant to be cooked the rest of the way by the diners over a flame that was brought in for that purpose. For a more reliable source, you need to be directly over the clay seam where the fossils are buried. If you position your eyes directly over the ball then your eyes will always be aligned with the hole. Cook over a gentle heat for five minutes, and then add the chopped anchovies and the olives. This occurred when a new building was built directly over the top of the remains of its predecessor. This brings the centre of gravity directly over the right foot, which supports her weight. In a large heavy pan, melt half the butter with the oil over a moderate heat. Soaring directly over our heads, she disappears back into the main current and is gone. We are welcomed in with open arms and hearts, and they prepare beautiful food, cooked over an open fire. Lift the fish out onto warm plates and place the baking dish over a moderate flame. Add olives to the pan and cook over a moderate heat until they begin to wrinkle. Heat the oil in a large saucepan, add the leeks and bay leaves, and fry over a high heat until the leeks have some colour. Continue to cook over a low heat until vegetables are submerged in their own liquid. The meat is seared over the hottest flames, then moved to a cooler part of the fire to cook gently through. Keep mixing the roux over the flame until the mixture comes off the sides of the pot. Cook over a fairly high heat for two to three minutes, then add the tomatoes and juices. Synonymsabove, on top of, higher than, higher up than, atop1.1 Above so as to cover or protect. an oxygen tent over the bed ladle this sauce over fresh pasta Example sentencesExamples The blast from the bomb had blown out all the windows but my mother had pulled the covers over us. In case of cold weather, it would be a good idea to apply a layer of mulch over the bulbs. It was only when the council put a thick layer of clay over it that this flora was lost. She then ran into the bedroom where her husband finally poured water over the flames. He was on his bed with the covers over him and she thought he was asleep. They have looked into loaning some covers to put over the pitch tomorrow night in case of overnight frost. A kind of invisible bell jar had been dropped over it, protecting it from change. Sprinkle cracker crumbs evenly over the bottom and sides, then pour in the ricotta mixture. The kettle had boiled so Don poured the water over the coffee powder in the mug. Many of you suggested laying small lengths of holly over the damaged area of garde", "n. Scatter the fresh coriander over the curry and serve with plain boiled rice. I turned up to the theatre in the costume and a couple of people threw coffee over me. Place a layer of tomato slices over the pesto then top with crumbled cheese. Mix well and spray thoroughly over both sides of the foliage and onto the offending pest. They had set up a shelter over their fire. The cloths were laid on the ground directly over the plants and fixed with spikes. He innocently assumed that a steel cover placed over a drainpipe was safe to walk o", "n. When I stop the car for a while and switch off the engine, the silence falls like a cloak over the countryside. Mix together the salt and sugar, and rub evenly over both sides of the salmo", "n. Two engineers were then able to pull up the two covers over the damaged cable.1.2 Extending above (an area) from a vantage point. views over Hyde Park Example sentencesExamples This area has great views over the rear garden through large windows and a set of patio doors. Still wearing her pajamas she went onto the balcony and looked over the front lawns. He walked to the single window looking out over the front lawn and road and opened it. Looking over the side you would expect to see a treasure chest full of gold. This is a gracious and welcoming house with spectacular views over open countryside. She looks out of the window over the parking lot and slides the tray of untouched fries away. Even on the stormy day that we visited, the vista over some of the uninhabited islands was magical. A sunroom looks out over the vegetable garde", "n. There's a large outside balcony area which faces South over the city centre rooftops. Synonymsacross, on to, around, throughout, all through, throughout the extent of, everywhere in, in all parts of2At a higher level or layer tha", "n. his flat was over the shop Example sentencesExamples At the other end, a speculative lob from Ian Duncan dipped just over the bar. Sherry had another excellent chance after 27 minutes but he sent his header over the bar. His powerful shot was just over the bar. His sweet right shot looked destined for the net but just sailed over the bar. Then they must either transfer it quickly either over the bar or to a player in a better positio", "n. This was done from the rear of the ranks in most circumstances, and over the heads of the shield wall of the thrower. Just to make sure, I now usually use a second layer of bandage over the first. Byatt almost doubled his tally seven minutes later after a fine run ended with his shot whistling over the bar. The volley sailed over the front rank of soldiers and fell among the battle leaders beyond. He thumped a chance over the bar. He whipped in a viciously dipping shot that spun just a foot over the bar. After a long delay, he stepped up to sky the spot-kick over the bar. The drysuit can be worn over a layer of clothing and it keeps its wearer completely dry and warm. A pair of tame shots by Ben Thornley that floated up and over the bar were as much as they could muster in the first half. He then had an opportunity to put the visitors level but he flicked the shot just over the cross bar. They were used and enjoyed by townsfolk who lived over their businesses and were unable to escape to a garde", "n. The ball eventually came into the possession of Mike Cooper and he stuck it over the bar. The office was over a newsagent's shop in the centre of Manchester. Synonymsabove, on top of, higher than, higher up than, atop2.1 Higher in rank tha", "n. over him is the financial director Example sentencesExamples The first-level manager, of course, has another manager over him. John had two levels of management over him. He had six senior officers over him. Synonymssuperior to, above, higher up than, more powerful than, in charge of, responsible for, commanding2.2 Expressing authority or control. editorial control over what is included Example sentencesExamples Britain retains sovereign rights over two areas to be used as military bases. At this time there was little or no control over speed boats by the authorities. He is concerned about the local education authority losing some control over the school. This structure is one which allows the spectator a degree of power over what is see", "n. They ", "also insist local authorities will still have some control over their own waste policies. They seemed less stressed and they acted as if they had real control over what they were doing. What they will not put up with, however, is a lack of control over other people. This time they will choose a government that will have real power over the direction of the country. Also, I always feel as though I have a certain measure of control over the situatio", "n. The membership of the party have no say over the policy and direction of the party. Family doctors in England are being given control over the budgets which buy hospital services. However, the ship was teeming with children whose parents had absolutely no control over them. Second, it centralises that information and gives you control over what is visible to others. Let's hope it is just a first step in giving back people control over their own lives. Help them to regain a sense of control over their life by offering choices and options. However, a Ministry of Defence official says his department has no control over the plant. The charity said that women who had babies at home tended to have greater privacy and more control over the birth. Instead, the locals enjoy their town and impose some control over the speed of motor vehicles using it. Those receiving benefits would be given control over their own training budgets. He is no longer the grim dictator with the power of life and death over his subjects.2.3 Expressing preference. I'd choose the well-known brand over that one Example sentencesExamples None of this persuades me that my preference for poetry over politics is a wrong choice. Do seed predators, floral herbivores and pollinators prefer one sex over the other? How could anyone prefer that over a real democracy that had evolved since the end of World War Two? In terms of manufacture and for aesthetic reasons, plastics are preferred over metal. The shares are best left for those who prefer hope over reality with their investments. Either way, give me this lot over a bunch of monosyllabic scowlers any day. In the old days, we used to prefer the wider good over personal convenience. It seems to be working as the family audience are slowly preferring it over other films. For long distances, he prefers the bus over airliners or rail because he likes the atmosphere. The choice of a sloping tiled roof over a flat roof had more to do with the local climatic conditions than with style. Since then the cartel has been attempting to show how responsible it is and has favoured price over volume. It is necessary to look at the grounds on which we are persuaded to prefer one theory over another. Is care and concern always to be preferred over more emotionally detached ways of relating to others? It ", "also reveals a preference for debt over equity as a means of providing external funding. For those hoping to stay, it should be noted that their manager considers attitude over ability. The evidence that the country's people would have preferred an invasion over other options is slight.2.4 Expressing majority. there was a slight predominance of boys over girls Example sentencesExamples Care was taken to attend showings at which the audience contained a predominance of adults over children There was an excess of men over wome", "n.2.5 Higher in volume or pitch tha", "n. he shouted over the noise of the taxis Example sentencesExamples The television screen was enormous, but I had to turn up the volume to hear it over the roar of Park Lane. I shouted over the noise. Hearing him shout over a rumbling beat is one of life's singular pleasures. People crowded round the bar frantically shouting their orders over the noise of the band. A confused babble of voices rose over the hubbub. Much of the night was spent shouting at increasing volumes over ear-splitting music. I loved it so much that I wanted to shout about it over the cacophony of the real world. The noise got so loud we had to shout over it. Rogers screamed over the noise of rifle shots ringing out through the cool, night air. There was some music playing in the background, which could barely be heard over the noise.3Higher or more than (a specified number or quantity) over 40 degrees C they've been married for over a year Example sentencesExamples He was trapped in the car, which burst into flames, for over an hour. In fact he supervised the production of over 30 volumes in his role as general editor. Pensions have fallen in value by over a third since the change was introduced. She was born in Oxford and has lived in Ireland for over twenty five years. Flood levels over three meters deep drowned cars and drove people from their homes. I have friends who have lived in Thailand for over thirty years and can't speak a work of Thai. We spent a lot of time together, well over two months, and so we really got to know each other. Most of the material is stuff we'd been playing in front of live audiences for over a year. The shores of these islands are often sandy but temperatures over 30 degrees are rare. Water in the house reached a level of over three feet and considerable damage was caused. As the globe warms and over a billion people live on less than one dollar a day, a global left is needed more than ever. We had been together for over a year, but I left him because everything he did seemed so boring and dull. In some areas of the county over half the number of fires reported are started deliberately. On that basis the unemployment levels of those over forty are not reasonable. The age of some of the rocks in the area has been a subject of debate by geologists for over 150 years. The house, the entrance lodge and garden of just over an acre comprise lot one. Applicants must be over 25 and have had a clean driving licence for more than five years. The house, which is very elegant, had not been lived in for over four years and was slowly crumbling away. We raise such a hue and cry when a tree is cut down, but with every heavy shower over a dozen trees fall. Mind you, I think it was probably over thirty degrees when this was filmed earlier today. Synonymsmore than, above, in excess of, exceeding, upwards of, beyond, greater than4Expressing passage or trajectory across. she trudged over the lawn Example sentencesExamples The pace picks up as the river flows swift and shallow over a rocky bed. The Act, creates a new legal right to roam over areas, mapped as open land and registered common land. The more obvious route goes directly up the ridge over steep, rocky ground, though there is a path to follow. Flying over vast areas of vegetation, the scale of the disaster caused by the floods begins to unfold. Together we bounded over a meadow and parked the car on the edge of a copse. It was possible that a big cat could roam over a huge area. A small climb up over a muddy slope gains a corner with some fine formations. Ignore side roads as you go up the hill and over a cross roads with traffic lights. Once changed we set off over the fell with the rain thankfully absent for the time being. Clamber over this, and follow the passage through a short canal to a rope climb up a rift. Some headed directly east: over the mountains and into the tribal areas of Pakista", "n. Ranks closed and the birds swept over the estuary, rising and falling, packed together. An injured climber walked for a mile over rocky terrain after falling off a cliff and breaking his arm and foot. Then it was time to go home and everyone started to drive over the newly fallen snow in their cars with the big fat tyres on them. We headed off down Pierce's Passage and over a muddy boulder slope until we reached some cascades. Police, including six armed officers, swarmed over the area and the gangsters fled. Synonymsacross, on to, around, throughout, all through, throughout the extent of, everywhere in, in all parts of4.1 Beyond and falling or hanging from. he toppled over the side of the boat Example sentencesExamples I scowled into the night, took a swig of my beer and dumped the rest over the side of the deck. They claimed they were breaching a crazy law that was forcing them to dump fish caught in their nets over the side. There are five people on board and you have to decide who to chuck over the side to save the rest. He is splashing fish heads over the side of the boat, looking sick and out of place. It drops over the side of the canoe as I try to store it away in a waterproof container. Many of the owners are given time frames of how long it will be before their homes topple over the cliff. Her long, brown legs were draped over the side of the boat. Bait and decoys keep the sharks close to the boats, and a cage can then be dropped over the side for a diver to get a much closer look. Working on a film in St Lucia, he almost crashes a bus over the side of a ravine. They wrapped the first bomb in a sack and carefully rolled it over the side, where it exploded. He left the pub alone at closing time and must have fallen over the wall on his walk home. As it is, any adult proposing to get comfortable back there is going to have to dangle their feet over the sides. He fell 25 feet over a ledge and suffered head injuries after crashing into rocks. On a perfect day, with someone on shark-watch, we had leapt over the side to go for a swim. They roll him over on his side and his arm flaps limply over the side of the gurney. Can I report a loss because I have dropped my wallet over the side of the boat on the way back from France? Six-foot waves crash over the sides of the landing craft and several are swamped. Cars had been crushed like balls of paper, and chucked over the side of the bridges. Wounded in the leg, he fell back over a ledge and was fortunate to be snagged by a tree. When we moved off and dropped over the hull side, however, we found the visibility was as good as 1m!4.2 At the other side of; beyond. over the hill is a small village Example sentencesExamples He sits next to his Personal Assistant, with his sales and marketing director over the partitio", "n. Over the river, King's College has an absolutely stunning Fellows' Garde", "n. Just over the other side of the mountain, on the other slope at 770 foot, is the weather statio", "n. There is a village over the river from Liverpool called Port Sunlight. She asks if he could give her a lift to a town over the border.5Expressing duratio", "n. you've given us a lot of heartache over the years she told me over coffee Example sentencesExamples With the fine weather there has been a huge increase in visitors to the area over the past month or so. The stones of the path had been polished by the passage of feet over hundreds, if not thousands, of years. I've been in a lot of interesting places over the past two years and worked with some really great people. Security forces were thought to have largely cleaned up the area over the past two years. The direction of the markets over the coming months will largely be down to American interest rates. The couple said they will be organising lots of fundraising events over the coming year. Attacks on staff have increased in almost all areas of the NHS over the last 10 years. In just over a month the area was evacuated and the village literally vanished off the map. We had a longer day care service, holiday cover and respite care over the weekend. The cost of generating electricity by wind power has fallen dramatically over the past few years. Police are ", "also linking the duo to two other attacks in the Nottinghamshire area over the past few days. We talk over coffee in his small Knightsbridge office, where he employs just one assistant. They will be able to pay £12 a month over three years to cover their end of the deal. Alan eventually broke the news to her over a cup of coffee when they got home. My memory of the entrance passages had faded over the years, so we took a few wrong turnings. However, a number of the York side have improved over the last year and a close result is forecast. Search teams have been combing the area over the weekend but have so far been unable to trace the murder weapo", "n. Collectors from the scheme will be calling to homes in the area over the coming two weeks. There has been an increase in firearm crime in the area over the last five years. To enjoy these bulbs year after year, they must be dug up in fall and stored indoors over the winter.6Expressing the medium by which something is done; by means of. a voice came over the loudspeaker Example sentencesExamples The almost robotic voice of the security office fizzed over the voice comm. Within a few moments a reply was clearly voiced over the small speaker in the headrest of the chair. Customers will get used to making free voice calls over the internet. Increasingly customers buy insurance direct over the phone, or on the internet. This month's Athens Olympics will become the first to be broadcast live over the Net. The Dominoes On Line web site enables you to play dominoes live over the Internet. These could be used to attract more sales, perhaps even direct sales over the internet. The lights began to dim out and then a voice was heard over the microphone. Although not available in Orkney, the station broadcasts live over the internet. My husband heard the shouts over the phone and called the police when he realised I was being robbed. The company ", "also put out Madonna's concert at Slane live over the internet last year. The crowd listened in silence as the service was broadcast over loudspeakers. The lights over the rink dimmed and flashed colors, and a slow song came on over the loudspeakers. This is usually much more expensive than buying direct over the telephone or internet. His or her face is illuminated with a soft red light, and white noise is played over headphones. She printed a map with instructions, but he insisted on giving directions over the phone.7On the subject of. a long and heated debate over unemployment Example sentencesExamples Publicans are falling out over new licensing laws allowing pubs to open much later. A fresh row has erupted over the thorny issue of a northern bypass for Witham. MPs said it was a straight fight between the two sides over who would win approval for a new medical school. The traffickers then had a gunbattle with a rival drug gang over drug selling areas. Protests were staged in Kew on Monday over fresh attempts by a phone company to put up a mast in North Road. There has been a strong feeling among rank and file workers to walk out over this issue. The next battles were over the first direct elections to the European Parliament. That has raised fresh concerns over the nation's ability to pull itself out of recessio", "n. We need joint union rallies over pensions and a serious campaign among rank and file members. There is a great deal of debate over the safety of buying on the internet. Many couples fall out over the house when they separate since it is usually the biggest asset. The protagonists are ex-college buddies who fell out over a girl called Betty Anne. This incident raises fresh concerns over safety, and public access to the water's edge. We argue all the time, whether it's over my driving or directions or anything really. New figures show that the highest number of complaints are made over domestic noise. The debate over the use of cannabis in medicine is controversial and emotive. After bringing the railways to the city, he fell from grace over dodgy financial dealings. Right now, the world is faced with a debate over how to deal with the water crisis. There were concerns over your level of alcohol consumption and its effect on your conduct. He has been getting a lot more aggressive recently over such trivial things as the housework and his dinner. Synonymson the subject of, about, concerning, apropos of, with reference to, speaking of, with regard/respect to, regarding, as regards, relating to, respecting, in connection with, as for, reLatin in readverb ˈəʊvəˈoʊvər1Expressing passage or trajectory across an area. he leant over and tapped me on the hand Example sentencesExamples I put it back to its original position and wandered over to the other side of the room. It was a delight to watch the bird in flight as it flew over in the direction of Rookfield village. He reached over and gently stroked the cat. He leaned over and sloppily kissed her, and she could smell liquor on his breath. As she went to climb over, she fell and clipped her feet on the wall and her whole body flipped and she landed on her head. Loud snores drifted over from one side of the room as someone had become so relaxed they'd fallen asleep. Then he bounded over to the opposite side of the busy pedestrian area to another target. She dunked her head under water and when she came up she swam over to my side of the pool. He crawled over to her side at once and picked up one of her hands, clenching it tightly in his grip. He lifted me over and then one of them grabbed my hand. I wander over to the opposite side of the arena. He immediately rushed over to the area, which was in a barren part of the forest. The gunman went directly over to him, and fired at least three shots.1.1 In or to the place indicated. I'm over here Example sentencesExamples Although the film is due out soon, she confessed she would prefer to have friends over for a visit than go to a premiere. I was drinking in the area so I popped over to have a quick look. As you reach the first curve, you put your arm over to the side and you feel the acceleratio", "n. World ranking points are lower over here, of course, but the standard of play isn't as good. As the ugly scenes on the pitch spilled over into the crowd, police were called to the Corbet Field ground. Nick will do a fantastic job in America because he has played a lot over there. He is sitting somewhere over on the far side of the room. The machine is right over on the other side of the house, and it has never woken us up before. The other side of town is a virtual no go area for us living over here. We've had a lot of fun over here in the last six years, but it's time to go home. I used to read the Craven Herald when I lived over here and always pick it up when back in the area. This is incredibly popular in America and would generate lots of interest over here. He's over in the kitchen area, wearing nothing but his hat and a baggy pair of Y-fronts. I ", "also have a friend who has lived over here for a while and he really sold the city to me as a great place to live. The scenery is brilliant, so why not take a trip west to see how we live over here. Isabel often has friends over for coffee in this room, as there is a playroom for children nearby. Drizzle the lemon juice over and then sprinkle each plate with a tablespoon of olive oil. The live scene over there is very active, but the geography doesn't make touring easy. She says she wishes to have me over for coffee. It is no use the Minister over there shouting across the floor of the House to me.2Beyond and falling or hanging from a point. she knocked the jug over Example sentencesExamples Some the stems of the flowers seem too weak to support the flower, so they bend over and sometimes break off. One of my parsley pots had fallen over, so I picked it up and put it down properly. The oil drum where the male monkey had been sitting began to wobble from side to side and finally toppled right over. It is designed to be difficult to knock over because of gyroscopes that work to keep it upright. In explanation the guard said that it had fallen over as the train was crossing the curve at Neville Hill. It was thought that a candle had fallen over and set alight the paperwork in an office in the garage. It had toppled itself so far over to one side that it had pulled its roots out of the soil. The two rear carriages tipped over on their sides before the train came to a halt.3Used to express action and result. the car flipped over hand the money over Example sentencesExamples It will be preserved and covered over by the floor slab of the new building. His shot from outside the area was just tipped over. Some of us are all too keen on putting our views over and not listening to what's being said. It should ", "also be the case that significant areas should be given over to free parking. She had recently taken over as manager, and decided instead to keep it ope", "n. Initially doubtful, Bird was eventually won over and took control of the project. He handed a small stack of bills over and soon Nathan found himself heading back to his own car. Why hand your cash over to a tout when you could work your passage, get a more secure sleeping area and get in for free? I rolled over and then it was as if someone had thrown a lot of grit into my eyes. The real eyesore was the derelict building we took over, which was covered in vandalism. The boot gets tossed, it teeters on its side then rolls over with the shoe laces facing up. The cards are turned back over and then the next turn begins with two more cards being chose", "n. I looked him over and quickly spotted a few cuts that had not been there the night before. Indeed, Henry became so afraid of the cult that he ordered that the tomb be covered over. It is about keeping the invader out, rather than allowing him in and winning him over to your side. He looked himself over; he was covered in a greenish substance that he did not recognize. Just watch the amiable face cloud over as the subject of passing years is raised. She wrapped it up in a piece of plastic and returned to the restaurant where she handed it over to the duty manager. They ", "also dug over an area of ground which will be used to grow herbs and tomatoes for the school kitche", "n. You have to hand it over to a director and allow them to do what they want to it.3.1 Finished. the match is over message understood, over and out Example sentencesExamples Any chance of further reform across other areas is now over. The Indian series is over and almost immediately in this crowded age it is time to focus on Australia. The question should be whether the halcyon days of direct foreign investment are over. This is comforting somehow; the phoney war is pretty much over and now the real fight begins. Our time together over, I shake hands, thank her for her candour and walk out the door. He waited until the game at Celtic Park was over and then phoned his so", "n. The crisis was over, but both sides were fully aware of how close they had come to nuclear annihilatio", "n. Fifty years of heartache is over for a former Rochdale man who has finally found the sister he has never met. The sterile and confrontational years should be declared over on all sides. Why do so many women think the battle is over? But the game was far from over and the home side were not going to go down without a fight. Now, our national game is in disarray, our World Cup is over and even the Tartan Army have had enough. Sunday evening we managed to come out of our homes, not knowing if it was over or not. Yet the action still wasn't over with the away side determined to rescue some lost pride. Do you know exactly what you want to do with yourself once your undergrad degree is over? Well, the UK General Election is over and not much has changed in the cold light of day. My long weekend is nearly over and then it is back to the drudgery of the workplace. Once this was over we were then subjected to more searches and much x-raying of luggage. I'm going to wait till it's over and then somehow talk to her. When mass was over and more prayers had been said, each body would be brought to its grave by clergy and mourners. Synonymsat an end, finished, concluded, terminated, no more, ended, extinct, gone, dead, a thing of the past, ancient history4Used to express repetition of a process. the jukebox plays every song twice over Example sentencesExamples If you could pick just one day of your life to live over again, which day would you choose? Of course we wouldn't live the same life over, that wouldn't be possible, would it? I loved the book so much that I have read it twice over. As a healthcare professional that is what I observe over and agai", "n. It was the longest sentence he said that day, but he repeated it several times over.noun ˈəʊvəˈoʊvərCricket A sequence of six balls bowled by a bowler from one end of the pitch, after which another bowler takes over from the other end. Example sentencesExamples At that stage, scoring at eight runs an over appeared to be a fantastic display. He would bowl six overs, take wickets and get taken off because he was so unfit. As on Saturday, play went on late because Worcestershire bowled their overs so slowly. His first eight overs yielded just 10 runs and included four wickets. In the Indian first innings, he bowled just six overs at a cost of 32 runs.Phrases(all) over againFrom the beginning for a second or subsequent time. the sums will have to be done over again I tore it up and started all over again Example sentencesExamples This was so good I wanted to start reading it all over again but I had to lend it to a friend to read first. He would have to endure the process all over agai", "n. It wouldn't be necessary to re-try the whole case all over again to determine the question of damages. Becoming world champions undoubtedly boosted our confidence, but now we have to prove we're capable of doing it all over agai", "n. He said the intense media coverage was victimising her all over agai", "n. This season, he has to prove himself all over agai", "n.be overNo longer be affected by. we were over the worst Example sentencesExamples He is now over his cold and is doing better everyday. Wendy has been advised to stay on HRT for only five years, when she should be over her symptoms. We seem to be over the stomach problems now. If I can keep it up right through the weekend I reckon I'll be over the worst of it. Please just strike me down here and now because I am just destined to never be over any of this.get something over withDo or undergo something unpleasant or difficult, so as to be rid of it. Example sentencesExamples I just confessed and pled guilty and got it over with. He wanted to get the whole thing over with. I think he got it over with quickly because he hated auditions, just like me. It was a case of just getting it over with and looking forward to next seaso", "n. Damage was minimal and despite my irritation and extreme annoyance, my only goal was to get the formalities over with, get back into my car and go home. I suppose it was a good idea to get it over with quickly. They made everyone stand up at staff meetings in order to get them over with quickly. We shopped at a leisurely pace in the supermarket, browsing and thinking rather than madly grabbing the same products as last week in order to get it over with. I am just looking forward to getting it over with. While this often seems like a good way of speeding up a painful process and getting it over with, it is certainly no aid to communication or good public speaking.over against1Adjacent to. over against the wall Example sentencesExamples A teacher who had joined the insurgents keeled over against him and whispered, ‘There is no god but God ‘, before dying.’ The bed that was in the center of the room was now over against the left wall. He spied three familiar figures hunched over against the wall. A voice called out, telling them to settle down, and they seated themselves on a mismatch of assorted chairs, a couple perching themselves on barrels and bales over against the wall. Instead it stands over against this process like a mirror held up to it.2In contrast with. over against heaven is hell Example sentencesExamples She is attempting to define herself over against the established powers. In fact, the New Testament is clearer and fuller on this than the Old Testament, as can be seen by looking at what Jesus, the incarnate Son of God, taught about Hell, over against the prophets, for example. She put her sixth-century royal French name and wealth to work for a safe and peaceful women's religious community over against the violence and brutality around her. The Commentary on the Song of Songs points much more in this direction, in that the synagogue and the church are set over against one another as the ‘old Eve’ and the ‘new Eve.’ The Report could have chosen to speak in the strident tone of the Apocalypse, defining the church over against the whore of Babylo", "n. They do not need to define Christianity as a religion of grace over against a religion of law, because they discover in the actual words of Paul that no such contrast exists in his letters. Evangelical Protestantism defines itself over against mainline Protestantism. He sets over against this his own clear spiritual positio", "n. From that perspective, a main problem in the book is its tendency to posit psychosocial explanations over against ecclesiastical, theological, and philosophical turns. But to find this a compelling argument, one must already be convinced of the inalienable sanctity of choice, over against every other social good.over and aboveIn addition to. exceptional service over and above what normally might be expected Example sentencesExamples Any money allows us to improve patient comfort or bring in new equipment that is over and above what we would normally buy for ourselves. He behaved as an employee but had an interest as shareholder over and above that of employee and stood to gain if the company prospered. A farmer may ", "also apply for an additional bond over and above his or her basic quota. The deal included a signing on bonus and an extra £85-a-day over and above their wages. Drill pay, while adequate, is over and above what they are paid on their civilian jobs. There are some locations where traffic calming, over and above that provided by the existing laws of the highway, may be desirable. In fact, he had made a new addition to his daily itinerary over and above what he had been doing before. Each target audience requires information that is unique to itself over and above the general informatio", "n. Any profit they make over and above the interest charges of the loan, increases the value of the fund for all participating investors. It is not envisaged that the proposal will lead to any increase in noise from the site over and above any that may be generated at present. Synonymsin addition to, on top of, over and beyond, plus, as well as, besides, not to mention, along with, let aloneover and done withCompletely finished. Example sentencesExamples My only hope at this point is that they get this wretched debacle over and done with as soon as possible, and preferably before it gets really messy. We go up and do our training, get it over and done with, and try not to be distracted by what people are saying about the match. I'm not too concerned about the exam, just looking forwards to getting it over and done with. It is a strange feeling to work on this project for a whole year, only for it to be over and done with in what feels like the blink of an eye. But all we want to do is get it over and done with and hope that our daughter can go on to lead a normal life. It was as if everyone was waiting for the official speeches to be over and done with. I'd like to get this over and done with as quickly as possible. The longer this fiasco goes on, then the more shareholders are going to be hurt, so let's get it over and done with as quickly as possible. Thank goodness that's all over and done with for another year. If I have to testify I ask that it be done as soon as possible, because I just want to get this over and done with and get on with my life. Synonymscompleted, concluded, consummated, finalized, terminated, over and done with, over, in the past, at an endover and overAgain and agai", "n. doing the same thing over and over again Example sentencesExamples Repeat this over and over at gradually lengthening intervals until your baby goes to sleep. There is this song repeating itself over and over in my head but I can't get further than a few words. She read the novel over and over. I liked The Jungle Book soundtrack which I used to play over and over on my tape player. It one of those movies you can watch over and over. Synonymsrepeatedly, again and again, over and over again, time and again, time and time again, many times over, on many occasions, on several occasions, often, frequently, recurrently, constantly, continually, persistently, regularly, habitually, ad nauseamover to youinformal Used to say that it is now your turn or responsibility. it's over to you, the people of Scotland, to decide who should win Example sentencesExamples The nominees have been suggested by our judging panel but it's over to you to decide who should wi", "n. Over to you to discuss whatever you want in the world of football transfers Over to you consumer: vote with your feet. We think this sums up things more eloquently than we ever could, so over to you Joh", "n. Anyway, it's over to you now to listen to five of our favorites and pick the one that you fancy the most!OriginOld English ofer, of Germanic origin; related to Dutch over and German über, from an Indo-European word (originally a comparative of the element represented by -ove in above) which is ", "also the base of Latin super and Greek huper.RhymesCanova, Casanova, clover, Dover, drover, Grsbover, Jehovah, left-over, Markova, Moldova, moreover, Navrátilová, nova, ova, Pavlova, rover, trover, up-and-over", "prep.1 phr.Definition of over in US English: over prepositionˈōvərˈoʊvər1Extending directly upward from. I saw flames over Berlin Example sentencesExamples Put the yolk in a metal bowl, held close to a flame but not over it, and mix until it turns white. Heat the oil in a large saucepan, add the leeks and bay leaves, and fry over a high heat until the leeks have some colour. Add olives to the pan and cook over a moderate heat until they begin to wrinkle. If you position your eyes directly over the ball then your eyes will always be aligned with the hole. Keep mixing the roux over the flame until the mixture comes off the sides of the pot. For a more reliable source, you need to be directly over the clay seam where the fossils are buried. We are welcomed in with open arms and hearts, and they prepare beautiful food, cooked over an open fire. Cook over a gentle heat for five minutes, and then add the chopped anchovies and the olives. Lift the fish out onto warm plates and place the baking dish over a moderate flame. They were meant to be cooked the rest of the way by the diners over a flame that was brought in for that purpose. Let it cook over a relatively low heat till the bottom has formed a golden crust. This brings the centre of gravity directly over the right foot, which supports her weight. The meat is seared over the hottest flames, then moved to a cooler part of the fire to cook gently through. Cook over a high heat until just wilted, cool a bit, then squeeze out most of the moisture. In a large heavy pan, melt half the butter with the oil over a moderate heat. This occurred when a new building was built directly over the top of the remains of its predecessor. Continue to cook over a low heat until vegetables are submerged in their own liquid. Cook over a fairly high heat for two to three minutes, then add the tomatoes and juices. Soaring directly over our heads, she disappears back into the main current and is gone. Melt the fat in a pan, beat the egg and milk together, add to the fat in the pan, season well and cook over a gentle heat. Synonymsabove, on top of, higher than, higher up than, atop1.1 Above so as to cover or protect. an oxygen tent over the bed ladle this sauce over fresh pasta Example sentencesExamples It was only when the council put a thick layer of clay over it that this flora was lost. Sprinkle cracker crumbs evenly over the bottom and sides, then pour in the ricotta mixture. Two engineers were then able to pull up the two covers over the damaged cable. He was on his bed with the covers over him and she thought he was asleep. Mix well and spray thoroughly over both sides of the foliage and onto the offending pest. I turned up to the theatre in the costume and a couple of people threw coffee over me. Mix together the salt and sugar, and rub evenly over both sides of the salmo", "n. He innocently assumed that a steel cover placed over a drainpipe was safe to walk o", "n. Many of you suggested laying small lengths of holly over the damaged area of garde", "n. They had set up a shelter over their fire. She then ran into the bedroom where her husband finally poured water over the flames. The blast from the bomb had blown out all the windows but my mother had pulled the covers over us. Scatter the fresh coriander over the curry and serve with plain boiled rice. When I stop the car for a while and switch off the engine, the silence falls like a cloak over the countryside. Place a layer of tomato slices over the pesto then top with crumbled cheese. The cloths were laid on the ground directly over the plants and fixed with spikes. They have looked into loaning some covers to put over the pitch tomorrow night in case of overnight frost. In case of cold weather, it would be a good idea to apply a layer of mulch over the bulbs. The kettle had boiled so Don poured the water over the coffee powder in the mug. A kind of invisible bell jar had been dropped over it, protecting it from change.1.2 Extending above (a general area) from a vantage point. views over Hyde Park Example sentencesExamples Looking over the side you would expect to see a treasure chest full of gold. He walked to the single window looking out over the front lawn and road and opened it. A sunroom looks out over the vegetable garde", "n. She looks out of the window over the parking lot and slides the tray of untouched fries away. Even on the stormy day that we visited, the vista over some of the uninhabited islands was magical. This area has great views over the rear garden through large windows and a set of patio doors. Still wearing her pajamas she went onto the balcony and looked over the front lawns. There's a large outside balcony area which faces South over the city centre rooftops. This is a gracious and welcoming house with spectacular views over open countryside. Synonymsacross, on to, around, throughout, all through, throughout the extent of, everywhere in, in all parts of2At a higher level or layer tha", "n. watching a television hanging over the bar Example sentencesExamples Just to make sure, I now usually use a second layer of bandage over the first. Sherry had another excellent chance after 27 minutes but he sent his header over the bar. A pair of tame shots by Ben Thornley that floated up and over the bar were as much as they could muster in the first half. He then had an opportunity to put the visitors level but he flicked the shot just over the cross bar. The ball eventually came into the possession of Mike Cooper and he stuck it over the bar. He whipped in a viciously dipping shot that spun just a foot over the bar. The volley sailed over the front rank of soldiers and fell among the battle leaders beyond. He thumped a chance over the bar. The drysuit can be worn over a layer of clothing and it keeps its wearer completely dry and warm. Byatt almost doubled his tally seven minutes later after a fine run ended with his shot whistling over the bar. Then they must either transfer it quickly either over the bar or to a player in a better positio", "n. At the other end, a speculative lob from Ian Duncan dipped just over the bar. This was done from the rear of the ranks in most circumstances, and over the heads of the shield wall of the thrower. After a long delay, he stepped up to sky the spot-kick over the bar. His sweet right shot looked destined for the net but just sailed over the bar. They were used and enjoyed by townsfolk who lived over their businesses and were unable to escape to a garde", "n. The office was over a newsagent's shop in the centre of Manchester. His powerful shot was just over the bar. Synonymsabove, on top of, higher than, higher up than, atop2.1 Higher in grade or rank tha", "n. over him is the financial director Example sentencesExamples John had two levels of management over him. He had six senior officers over him. The first-level manager, of course, has another manager over him. Synonymssuperior to, above, higher up than, more powerful than, in charge of, responsible for, commanding2.2 Expressing authority or control. editorial control over what is included Example sentencesExamples Britain retains sovereign rights over two areas to be used as military bases. Help them to regain a sense of control over their life by offering choices and options. Family doctors in England are being given control over the budgets which buy hospital services. This time they will choose a government that will have real power over the direction of the country. Second, it centralises that information and gives you control over what is visible to others. What they will not put up with, however, is a lack of control over other people. However, the ship was teeming with children whose parents had absolutely no control over them. At this time there was little or no control over speed boats by the authorities. They ", "also insist local authorities will still have some control over their own waste policies. Also, I always feel as though I have a certain measure of control over the situatio", "n. He is no longer the grim dictator with the power of life and death over his subjects. They seemed less stressed and they acted as if they had real control over what they were doing. This structure is one which allows the spectator a degree of power over what is see", "n. Let's hope it is just a first step in giving back people control over their own lives. Those receiving benefits would be given control over their own training budgets. However, a Ministry of Defence official says his department has no control over the plant. He is concerned about the local education authority losing some control over the school. The charity said that women who had babies at home tended to have greater privacy and more control over the birth. The membership of the party have no say over the policy and direction of the party. Instead, the locals enjoy their town and impose some control over the speed of motor vehicles using it.2.3 Expressing preference. I'd choose the well-known brand over that one Example sentencesExamples It ", "also reveals a preference for debt over equity as a means of providing external funding. The choice of a sloping tiled roof over a flat roof had more to do with the local climatic conditions than with style. The evidence that the country's people would have preferred an invasion over other options is slight. It is necessary to look at the grounds on which we are persuaded to prefer one theory over another. Either way, give me this lot over a bunch of monosyllabic scowlers any day. Do seed predators, floral herbivores and pollinators prefer one sex over the other? Since then the cartel has been attempting to show how responsible it is and has favoured price over volume. In terms of manufacture and for aesthetic reasons, plastics are preferred over metal. For those hoping to stay, it should be noted that their manager considers attitude over ability. The shares are best left for those who prefer hope over reality with their investments. In the old days, we used to prefer the wider good over personal convenience. For long distances, he prefers the bus over airliners or rail because he likes the atmosphere. How could anyone prefer that over a real democracy that had evolved since the end of World War Two? None of this persuades me that my preference for poetry over politics is a wrong choice. Is care and concern always to be preferred over more emotionally detached ways of relating to others? It seems to be working as the family audience are slowly preferring it over other films.2.4 Expressing greater number. there was a slight predominance of boys over girls Example sentencesExamples Care was taken to attend showings at which the audience contained a predominance of adults over children There was an excess of men over wome", "n.2.5 Higher in volume or pitch tha", "n. he shouted over the noise of the taxis Example sentencesExamples Rogers screamed over the noise of rifle shots ringing out through the cool, night air. The television screen was enormous, but I had to turn up the volume to hear it over the roar of Park Lane. The noise got so loud we had to shout over it. I shouted over the noise. I loved it so much that I wanted to shout about it over the cacophony of the real world. There was some music playing in the background, which could barely be heard over the noise. Much of the night was spent shouting at increasing volumes over ear-splitting music. A confused babble of voices rose over the hubbub. People crowded round the bar frantically shouting their orders over the noise of the band. Hearing him shout over a rumbling beat is one of life's singular pleasures.3Higher than or more than (a specified number or quantity) over 40 degrees C they have lived together for over a year Example sentencesExamples He was trapped in the car, which burst into flames, for over an hour. We raise such a hue and cry when a tree is cut down, but with every heavy shower over a dozen trees fall. As the globe warms and over a billion people live on less than one dollar a day, a global left is needed more than ever. Most of the material is stuff we'd been playing in front of live audiences for over a year. In some areas of the county over half the number of fires reported are started deliberately. She was born in Oxford and has lived in Ireland for over twenty five years. Applicants must be over 25 and have had a clean driving licence for more than five years. The house, which is very elegant, had not been lived in for over four years and was slowly crumbling away. I have friends who have lived in Thailand for over thirty years and can't speak a work of Thai. The shores of these islands are often sandy but temperatures over 30 degrees are rare. Water in the house reached a level of over three feet and considerable damage was caused. Mind you, I think it was probably over thirty degrees when this was filmed earlier today. Flood levels over three meters deep drowned cars and drove people from their homes. Pensions have fallen in value by over a third since the change was introduced. We spent a lot of time together, well over two months, and so we really got to know each other. The age of some of the rocks in the area has been a subject of debate by geologists for over 150 years. On that basis the unemployment levels of those over forty are not reasonable. The house, the entrance lodge and garden of just over an acre comprise lot one. We had been together for over a year, but I left him because everything he did seemed so boring and dull. In fact he supervised the production of over 30 volumes in his role as general editor. Synonymsmore than, above, in excess of, exceeding, upwards of, beyond, greater than4Expressing passage or trajectory across. she trudged over the lawn Example sentencesExamples We headed off down Pierce's Passage and over a muddy boulder slope until we reached some cascades. Flying over vast areas of vegetation, the scale of the disaster caused by the floods begins to unfold. Police, including six armed officers, swarmed over the area and the gangsters fled. Clamber over this, and follow the passage through a short canal to a rope climb up a rift. The pace picks up as the river flows swift and shallow over a rocky bed. Ranks closed and the birds swept over the estuary, rising and falling, packed together. A small climb up over a muddy slope gains a corner with some fine formations. Then it was time to go home and everyone started to drive over the newly fallen snow in their cars with the big fat tyres on them. Some headed directly east: over the mountains and into the tribal areas of Pakista", "n. An injured climber walked for a mile over rocky terrain after falling off a cliff and breaking his arm and foot. Together we bounded over a meadow and parked the car on the edge of a copse. The more obvious route goes directly up the ridge over steep, rocky ground, though there is a path to follow. It was possible that a big cat could roam over a huge area. Once changed we set off over the fell with the rain thankfully absent for the time being. Ignore side roads as you go up the hill and over a cross roads with traffic lights. The Act, creates a new legal right to roam over areas, mapped as open land and registered common land. Synonymsacross, on to, around, throughout, all through, throughout the extent of, everywhere in, in all parts of4.1 Beyond and falling or hanging from. it toppled over the cliff Example sentencesExamples He fell 25 feet over a ledge and suffered head injuries after crashing into rocks. It drops over the side of the canoe as I try to store it away in a waterproof container. When we moved off and dropped over the hull side, however, we found the visibility was as good as 1m! I scowled into the night, took a swig of my beer and dumped the rest over the side of the deck. There are five people on board and you have to decide who to chuck over the side to save the rest. Cars had been crushed like balls of paper, and chucked over the side of the bridges. Can I report a loss because I have dropped my wallet over the side of the boat on the way back from France? Six-foot waves crash over the sides of the landing craft and several are swamped. They wrapped the first bomb in a sack and carefully rolled it over the side, where it exploded. Bait and decoys keep the sharks close to the boats, and a cage can then be dropped over the side for a diver to get a much closer look. Many of the owners are given time frames of how long it will be before their homes topple over the cliff. On a perfect day, with someone on shark-watch, we had leapt over the side to go for a swim. They roll him over on his side and his arm flaps limply over the side of the gurney. As it is, any adult proposing to get comfortable back there is going to have to dangle their feet over the sides. They claimed they were breaching a crazy law that was forcing them to dump fish caught in their nets over the side. Her long, brown legs were draped over the side of the boat. He left the pub alone at closing time and must have fallen over the wall on his walk home. He is splashing fish heads over the side of the boat, looking sick and out of place. Working on a film in St Lucia, he almost crashes a bus over the side of a ravine. Wounded in the leg, he fell back over a ledge and was fortunate to be snagged by a tree.4.2 At the other side of; beyond. over the hill is a small village Example sentencesExamples Over the river, King's College has an absolutely stunning Fellows' Garde", "n. He sits next to his Personal Assistant, with his sales and marketing director over the partitio", "n. Just over the other side of the mountain, on the other slope at 770 foot, is the weather statio", "n. There is a village over the river from Liverpool called Port Sunlight. She asks if he could give her a lift to a town over the border.5Expressing duratio", "n. she told me over coffee inventories have been refined over many years Example sentencesExamples In just over a month the area was evacuated and the village literally vanished off the map. We talk over coffee in his small Knightsbridge office, where he employs just one assistant. They will be able to pay £12 a month over three years to cover their end of the deal. Security forces were thought to have largely cleaned up the area over the past two years. The couple said they will be organising lots of fundraising events over the coming year. I've been in a lot of interesting places over the past two years and worked with some really great people. We had a longer day care service, holiday cover and respite care over the weekend. Attacks on staff have increased in almost all areas of the NHS over the last 10 years. The cost of generating electricity by wind power has fallen dramatically over the past few years. My memory of the entrance passages had faded over the years, so we took a few wrong turnings. To enjoy these bulbs year after year, they must be dug up in fall and stored indoors over the winter. With the fine weather there has been a huge increase in visitors to the area over the past month or so. The direction of the markets over the coming months will largely be down to American interest rates. Collectors from the scheme will be calling to homes in the area over the coming two weeks. Police are ", "also linking the duo to two other attacks in the Nottinghamshire area over the past few days. Alan eventually broke the news to her over a cup of coffee when they got home. There has been an increase in firearm crime in the area over the last five years. The stones of the path had been polished by the passage of feet over hundreds, if not thousands, of years. Search teams have been combing the area over the weekend but have so far been unable to trace the murder weapo", "n. However, a number of the York side have improved over the last year and a close result is forecast.6By means of; by the medium of. a voice came over the loudspeaker Example sentencesExamples His or her face is illuminated with a soft red light, and white noise is played over headphones. The crowd listened in silence as the service was broadcast over loudspeakers. The company ", "also put out Madonna's concert at Slane live over the internet last year. The lights began to dim out and then a voice was heard over the microphone. Customers will get used to making free voice calls over the internet. Within a few moments a reply was clearly voiced over the small speaker in the headrest of the chair. My husband heard the shouts over the phone and called the police when he realised I was being robbed. The Dominoes On Line web site enables you to play dominoes live over the Internet. She printed a map with instructions, but he insisted on giving directions over the phone. Although not available in Orkney, the station broadcasts live over the internet. Increasingly customers buy insurance direct over the phone, or on the internet. These could be used to attract more sales, perhaps even direct sales over the internet. This is usually much more expensive than buying direct over the telephone or internet. The almost robotic voice of the security office fizzed over the voice comm. The lights over the rink dimmed and flashed colors, and a slow song came on over the loudspeakers. This month's Athens Olympics will become the first to be broadcast live over the Net.7On the subject of. a heated debate over unemployment Example sentencesExamples Many couples fall out over the house when they separate since it is usually the biggest asset. The traffickers then had a gunbattle with a rival drug gang over drug selling areas. He has been getting a lot more aggressive recently over such trivial things as the housework and his dinner. We need joint union rallies over pensions and a serious campaign among rank and file members. MPs said it was a straight fight between the two sides over who would win approval for a new medical school. This incident raises fresh concerns over safety, and public access to the water's edge. The protagonists are ex-college buddies who fell out over a girl called Betty Anne. The next battles were over the first direct elections to the European Parliament. New figures show that the highest number of complaints are made over domestic noise. We argue all the time, whether it's over my driving or directions or anything really. The debate over the use of cannabis in medicine is controversial and emotive. There is a great deal of debate over the safety of buying on the internet. Right now, the world is faced with a debate over how to deal with the water crisis. Protests were staged in Kew on Monday over fresh attempts by a phone company to put up a mast in North Road. That has raised fresh concerns over the nation's ability to pull itself out of recessio", "n. Publicans are falling out over new licensing laws allowing pubs to open much later. After bringing the railways to the city, he fell from grace over dodgy financial dealings. A fresh row has erupted over the thorny issue of a northern bypass for Witham. There has been a strong feeling among rank and file workers to walk out over this issue. There were concerns over your level of alcohol consumption and its effect on your conduct. Synonymson the subject of, about, concerning, apropos of, with reference to, speaking of, with regard to, with respect to, regarding, as regards, relating to, respecting, in connection with, as for, readverbˈōvərˈoʊvər1Expressing passage or trajectory across an area. he leaned over and tapped me on the hand Example sentencesExamples He leaned over and sloppily kissed her, and she could smell liquor on his breath. As she went to climb over, she fell and clipped her feet on the wall and her whole body flipped and she landed on her head. It was a delight to watch the bird in flight as it flew over in the direction of Rookfield village. He crawled over to her side at once and picked up one of her hands, clenching it tightly in his grip. Loud snores drifted over from one side of the room as someone had become so relaxed they'd fallen asleep. He reached over and gently stroked the cat. The gunman went directly over to him, and fired at least three shots. He lifted me over and then one of them grabbed my hand. He immediately rushed over to the area, which was in a barren part of the forest. I put it back to its original position and wandered over to the other side of the room. She dunked her head under water and when she came up she swam over to my side of the pool. Then he bounded over to the opposite side of the busy pedestrian area to another target. I wander over to the opposite side of the arena.1.1 In or to the place mentioned or indicated. over here come over and cheer us up Example sentencesExamples The machine is right over on the other side of the house, and it has never woken us up before. As you reach the first curve, you put your arm over to the side and you feel the acceleratio", "n. Isabel often has friends over for coffee in this room, as there is a playroom for children nearby. Drizzle the lemon juice over and then sprinkle each plate with a tablespoon of olive oil. He's over in the kitchen area, wearing nothing but his hat and a baggy pair of Y-fronts. He is sitting somewhere over on the far side of the room. Nick will do a fantastic job in America because he has played a lot over there. As the ugly scenes on the pitch spilled over into the crowd, police were called to the Corbet Field ground. The live scene over there is very active, but the geography doesn't make touring easy. We've had a lot of fun over here in the last six years, but it's time to go home. This is incredibly popular in America and would generate lots of interest over here. She says she wishes to have me over for coffee. I was drinking in the area so I popped over to have a quick look. World ranking points are lower over here, of course, but the standard of play isn't as good. The scenery is brilliant, so why not take a trip west to see how we live over here. Although the film is due out soon, she confessed she would prefer to have friends over for a visit than go to a premiere. It is no use the Minister over there shouting across the floor of the House to me. The other side of town is a virtual no go area for us living over here. I used to read the Craven Herald when I lived over here and always pick it up when back in the area. I ", "also have a friend who has lived over here for a while and he really sold the city to me as a great place to live.2Beyond and falling or hanging from a point. listing over at an acute angle Example sentencesExamples The two rear carriages tipped over on their sides before the train came to a halt. In explanation the guard said that it had fallen over as the train was crossing the curve at Neville Hill. One of my parsley pots had fallen over, so I picked it up and put it down properly. It was thought that a candle had fallen over and set alight the paperwork in an office in the garage. It is designed to be difficult to knock over because of gyroscopes that work to keep it upright. Some the stems of the flowers seem too weak to support the flower, so they bend over and sometimes break off. The oil drum where the male monkey had been sitting began to wobble from side to side and finally toppled right over. It had toppled itself so far over to one side that it had pulled its roots out of the soil.3Used to express action and result. the car flipped over hand the money over Example sentencesExamples The real eyesore was the derelict building we took over, which was covered in vandalism. Just watch the amiable face cloud over as the subject of passing years is raised. His shot from outside the area was just tipped over. It is about keeping the invader out, rather than allowing him in and winning him over to your side. Initially doubtful, Bird was eventually won over and took control of the project. He looked himself over; he was covered in a greenish substance that he did not recognize. It should ", "also be the case that significant areas should be given over to free parking. I looked him over and quickly spotted a few cuts that had not been there the night before. He handed a small stack of bills over and soon Nathan found himself heading back to his own car. They ", "also dug over an area of ground which will be used to grow herbs and tomatoes for the school kitche", "n. It will be preserved and covered over by the floor slab of the new building. The boot gets tossed, it teeters on its side then rolls over with the shoe laces facing up. The cards are turned back over and then the next turn begins with two more cards being chose", "n. I rolled over and then it was as if someone had thrown a lot of grit into my eyes. You have to hand it over to a director and allow them to do what they want to it. Why hand your cash over to a tout when you could work your passage, get a more secure sleeping area and get in for free? She wrapped it up in a piece of plastic and returned to the restaurant where she handed it over to the duty manager. Some of us are all too keen on putting our views over and not listening to what's being said. She had recently taken over as manager, and decided instead to keep it ope", "n. Indeed, Henry became so afraid of the cult that he ordered that the tomb be covered over.3.1 Finished. the match is over message understood, over and out Example sentencesExamples Well, the UK General Election is over and not much has changed in the cold light of day. Now, our national game is in disarray, our World Cup is over and even the Tartan Army have had enough. Our time together over, I shake hands, thank her for her candour and walk out the door. He waited until the game at Celtic Park was over and then phoned his so", "n. Why do so many women think the battle is over? Once this was over we were then subjected to more searches and much x-raying of luggage. When mass was over and more prayers had been said, each body would be brought to its grave by clergy and mourners. This is comforting somehow; the phoney war is pretty much over and now the real fight begins. Fifty years of heartache is over for a former Rochdale man who has finally found the sister he has never met. The sterile and confrontational years should be declared over on all sides. Yet the action still wasn't over with the away side determined to rescue some lost pride. I'm going to wait till it's over and then somehow talk to her. Any chance of further reform across other areas is now over. My long weekend is nearly over and then it is back to the drudgery of the workplace. The Indian series is over and almost immediately in this crowded age it is time to focus on Australia. Do you know exactly what you want to do with yourself once your undergrad degree is over? But the game was far from over and the home side were not going to go down without a fight. The question should be whether the halcyon days of direct foreign investment are over. Sunday evening we managed to come out of our homes, not knowing if it was over or not. The crisis was over, but both sides were fully aware of how close they had come to nuclear annihilatio", "n. Synonymsat an end, finished, concluded, terminated, no more, ended, extinct, gone, dead, a thing of the past, ancient history4Used to express repetition of a process. twice over the sums will have to be done over again Example sentencesExamples Of course we wouldn't live the same life over, that wouldn't be possible, would it? If you could pick just one day of your life to live over again, which day would you choose? I loved the book so much that I have read it twice over. As a healthcare professional that is what I observe over and agai", "n. It was the longest sentence he said that day, but he repeated it several times over.nounˈōvərˈoʊvərCricket A sequence of six balls bowled by a bowler from one end of the pitch. Example sentencesExamples In the Indian first innings, he bowled just six overs at a cost of 32 runs. As on Saturday, play went on late because Worcestershire bowled their overs so slowly. His first eight overs yielded just 10 runs and included four wickets. At that stage, scoring at eight runs an over appeared to be a fantastic display. He would bowl six overs, take wickets and get taken off because he was so unfit.Phrasesbe overNo longer be affected by. we were over the worst Example sentencesExamples We seem to be over the stomach problems now. Wendy has been advised to stay on HRT for only five years, when she should be over her symptoms. If I can keep it up right through the weekend I reckon I'll be over the worst of it. Please just strike me down here and now because I am just destined to never be over any of this. He is now over his cold and is doing better everyday.get something over withDo or undergo something unpleasant or difficult, so as to be rid of it. Example sentencesExamples I am just looking forward to getting it over with. They made everyone stand up at staff meetings in order to get them over with quickly. We shopped at a leisurely pace in the supermarket, browsing and thinking rather than madly grabbing the same products as last week in order to get it over with. I suppose it was a good idea to get it over with quickly. I think he got it over with quickly because he hated auditions, just like me. I just confessed and pled guilty and got it over with. While this often seems like a good way of speeding up a painful process and getting it over with, it is certainly no aid to communication or good public speaking. He wanted to get the whole thing over with. Damage was minimal and despite my irritation and extreme annoyance, my only goal was to get the formalities over with, get back into my car and go home. It was a case of just getting it over with and looking forward to next seaso", "n.over against1Adjacent to. over against the wall Example sentencesExamples The bed that was in the center of the room was now over against the left wall. He spied three familiar figures hunched over against the wall. A teacher who had joined the insurgents keeled over against him and whispered, ‘There is no god but God ‘, before dying.’ A voice called out, telling them to settle down, and they seated themselves on a mismatch of assorted chairs, a couple perching themselves on barrels and bales over against the wall. Instead it stands over against this process like a mirror held up to it.1.1In contrast with. over against heaven is hell Example sentencesExamples The Commentary on the Song of Songs points much more in this direction, in that the synagogue and the church are set over against one another as the ‘old Eve’ and the ‘new Eve.’ Evangelical Protestantism defines itself over against mainline Protestantism. She is attempting to define herself over against the established powers. The Report could have chosen to speak in the strident tone of the Apocalypse, defining the church over against the whore of Babylo", "n. They do not need to define Christianity as a religion of grace over against a religion of law, because they discover in the actual words of Paul that no such contrast exists in his letters. But to find this a compelling argument, one must already be convinced of the inalienable sanctity of choice, over against every other social good. She put her sixth-century royal French name and wealth to work for a safe and peaceful women's religious community over against the violence and brutality around her. From that perspective, a main problem in the book is its tendency to posit psychosocial explanations over against ecclesiastical, theological, and philosophical turns. In fact, the New Testament is clearer and fuller on this than the Old Testament, as can be seen by looking at what Jesus, the incarnate Son of God, taught about Hell, over against the prophets, for example. He sets over against this his own clear spiritual positio", "n.over and aboveIn addition to. exceptional service over and above what normally might be expected Example sentencesExamples Any profit they make over and above the interest charges of the loan, increases the value of the fund for all participating investors. Each target audience requires information that is unique to itself over and above the general informatio", "n. He behaved as an employee but had an interest as shareholder over and above that of employee and stood to gain if the company prospered. It is not envisaged that the proposal will lead to any increase in noise from the site over and above any that may be generated at present. Any money allows us to improve patient comfort or bring in new equipment that is over and above what we would normally buy for ourselves. In fact, he had made a new addition to his daily itinerary over and above what he had been doing before. There are some locations where traffic calming, over and above that provided by the existing laws of the highway, may be desirable. A farmer may ", "also apply for an additional bond over and above his or her basic quota. The deal included a signing on bonus and an extra £85-a-day over and above their wages. Drill pay, while adequate, is over and above what they are paid on their civilian jobs. Synonymsin addition to, on top of, over and beyond, plus, as well as, besides, not to mention, along with, let aloneover and done withCompletely finished. Example sentencesExamples Thank goodness that's all over and done with for another year. I'd like to get this over and done with as quickly as possible. If I have to testify I ask that it be done as soon as possible, because I just want to get this over and done with and get on with my life. But all we want to do is get it over and done with and hope that our daughter can go on to lead a normal life. The longer this fiasco goes on, then the more shareholders are going to be hurt, so let's get it over and done with as quickly as possible. We go up and do our training, get it over and done with, and try not to be distracted by what people are saying about the match. It is a strange feeling to work on this project for a whole year, only for it to be over and done with in what feels like the blink of an eye. My only hope at this point is that they get this wretched debacle over and done with as soon as possible, and preferably before it gets really messy. It was as if everyone was waiting for the official speeches to be over and done with. I'm not too concerned about the exam, just looking forwards to getting it over and done with. Synonymscompleted, concluded, consummated, finalized, terminated, over and done with, over, in the past, at an endover and overAgain and agai", "n. Example sentencesExamples I liked The Jungle Book soundtrack which I used to play over and over on my tape player. She read the novel over and over. There is this song repeating itself over and over in my head but I can't get further than a few words. It one of those movies you can watch over and over. Repeat this over and over at gradually lengthening intervals until your baby goes to sleep. Synonymsrepeatedly, again and again, over and over again, time and again, time and time again, many times over, on many occasions, on several occasions, often, frequently, recurrently, constantly, continually, persistently, regularly, habitually, ad nauseamover to youinformal Used to say that it is now your turn or responsibility. it's over to you, the people of Scotland, to decide who should win Example sentencesExamples Over to you to discuss whatever you want in the world of football transfers The nominees have been suggested by our judging panel but it's over to you to decide who should wi", "n. Anyway, it's over to you now to listen to five of our favorites and pick the one that you fancy the most! We think this sums up things more eloquently than we ever could, so over to you Joh", "n. Over to you consumer: vote with your feet.OriginOld English ofer, of Germanic origin; related to Dutch over and German über, from an Indo-European word (originally a comparative of the element represented by -ove in above) which is ", "also the base of Latin super and Greek huper.", "prep.1 phr.  Definition of over-under in US English: over-under(", "also over/under) noun US 1A bet on whether the outcome of an event (usually the combined score of a sports game) will be above or below a number established in advance by the bookmaker. the over-under in hockey gives you less chance of losing Example sentencesExamples I stayed away from the over-and-under on the winning score, which Sherman posted as 4 1/2 - under-par, because I think that's about the right number. He was more interested in crap games, the over-and-under, the horses, and selling sweaters out of the trunk of his car. There is a special index in the book rating ballparks for Total Number of Runs per game - if you're a Totals (Over-Under) bettor, this would be helpful material. In sports betting, there are just a few bets that are considered to be regular bets and the over/under is one of them.1.1 The number (usually the combined score of a sports game) on which bettors place wagers in an over-under bet. oddsmakers had set the over-under at 53, higher than any other game this week figurative what's the over-under on how many fanatics will camp out? Example sentencesExamples What is the over-under on Weaver? Now, if I were a slow writer, then that could present a problem, especially since I review a lot of adventures, and the over-under for adventures is in the neighborhood of eight hours. Is an over-under of 60 out of the question? What is the over-under on Weaver's arrival in the major leagues? I don't know what the over-under was on him grabbing himself just below the belt buckle (38?). I put the over-under on e-mails to you complaining about O'Brien today at an even four hundred. As Walters puts it, \"The over-under on me was 39 years old, and not many guys took the over.\" The site has set the over-under on Peyton Manning's completion percentage vs. New England at 67.5 percent. The Over-Under is in the 47-48 range.2A gun having barrels arranged one above the other rather than side by side. if shooting an over-under, have the upper barrel pointing over and the lower barrel under the bird Example sentencesExamples If I ever do display my gun (a very ornate over-under shotgun built for skeet and trap shooting), it's only to adults, and after I've pulled the case from the back of my closet, opened it, and broken the action to make sure its unloaded. The EAA/Baikal line includes the MP-233 over-and-under, which features hammer-forged barrels, chrome-lined bores, machined receivers, walnut stocks and internal screw chokes. It's tough to beat the Red Label over-and-under. Remington's only over-and-under, the Model 332 12 gauge has been enhanced with a \"dressed-up\" appearance and traditional engraving. Last year, Browning introduced the Citori 525 over-and-under. The over-under guns tend to be at the more expensive end of the spectrum. Beretta's upgraded S682 Gold E competition over-and-under features a low-profile receiver in a dual-color finish, new internal barrel configuration, Optima-Bore and new Optima-Choke tubes.Definition of over-under in US English: over-under(", "also over/under) nounUS 1A bet on whether the outcome of an event (usually the combined score of a sports game) will be above or below a number established in advance by the bookmaker. the over-under in hockey gives you less chance of losing Example sentencesExamples There is a special index in the book rating ballparks for Total Number of Runs per game - if you're a Totals (Over-Under) bettor, this would be helpful material. He was more interested in crap games, the over-and-under, the horses, and selling sweaters out of the trunk of his car. I stayed away from the over-and-under on the winning score, which Sherman posted as 4 1/2 - under-par, because I think that's about the right number. In sports betting, there are just a few bets that are considered to be regular bets and the over/under is one of them.1.1 The number (usually the combined score of a sports game) on which bettors place wagers in an over-under bet. oddsmakers had set the over-under at 53, higher than any other game this week figurative what's the over-under on how many fanatics will camp out? Example sentencesExamples I don't know what the over-under was on him grabbing himself just below the belt buckle (38?). I put the over-under on e-mails to you complaining about O'Brien today at an even four hundred. What is the over-under on Weaver? Is an over-under of 60 out of the question? What is the over-under on Weaver's arrival in the major leagues? The site has set the over-under on Peyton Manning's completion percentage vs. New England at 67.5 percent. As Walters puts it, \"The over-under on me was 39 years old, and not many guys took the over.\" Now, if I were a slow writer, then that could present a problem, especially since I review a lot of adventures, and the over-under for adventures is in the neighborhood of eight hours. The Over-Under is in the 47-48 range.2A gun having barrels arranged one above the other rather than side by side. if shooting an over-under, have the upper barrel pointing over and the lower barrel under the bird Example sentencesExamples If I ever do display my gun (a very ornate over-under shotgun built for skeet and trap shooting), it's only to adults, and after I've pulled the case from the back of my closet, opened it, and broken the action to make sure its unloaded. Last year, Browning introduced the Citori 525 over-and-under. Remington's only over-and-under, the Model 332 12 gauge has been enhanced with a \"dressed-up\" appearance and traditional engraving. It's tough to beat the Red Label over-and-under. The EAA/Baikal line includes the MP-233 over-and-under, which features hammer-forged barrels, chrome-lined bores, machined receivers, walnut stocks and internal screw chokes. Beretta's upgraded S682 Gold E competition over-and-under features a low-profile receiver in a dual-color finish, new internal barrel configuration, Optima-Bore and new Optima-Choke tubes. The over-under guns tend to be at the more expensive end of the spectrum."]}], "usphone": "", "ukphone": ""}