{"name": "match up", "trans": [{"dict": "Oxford5000", "values": ["Definition of matchup in English: matchup nounNorth American 1A sporting contest between two players or teams. Example sentencesExamples The teams with the most favorable player matchups will be the teams holding trumps in the final three weeks. The game featured key matchups as both teams put out their best players with two crucial points on the line. The rest will feature game after game of hotly contested matchups with nightly playoff implications during the final two-dozen games or so. We'll have in-depth scouting reports on each team minutes after the bracket is announced, and we cover the tournament with matchups for all 64 games. In most cases, the outside man got a one-on-one matchup and the inside player drew the double team. The playoffs are no time to be clever by benching your most talented players because they have bad matchups and start experimenting with mediocre players in good matchups. Always a heated rivalry, this Friday tilt could shape up to be a playoff matchup preview. If you are one of the many who use a two-back system, you can find success if you closely monitor matchups and know each player's strengths and weaknesses. After you've spent a few minutes savoring another strong week for your squad, it's important to look at your players' matchups for the next week. However, in each of the postseason matchups, his team rallied from behind to win, the exact opposite of their playoff predecessors. Basketball is a team game, but the NBA is about individual matchups - whichever team wins the most matchups wins the game. A couple of scouts and coaches offered their expertise in breaking down the divisional playoff matchups of the upcoming weekend. The teams have battled to four straight Game 7, winner-take-all playoff matchups, with New York winning the last three. He doesn't shy away from matchups against star players and is the team's nastiest linema", "n. Three playoff matchups from last fall will be revived this weekend. If we've gotten line matchups or individual player matchups from the coaches, then I focus on the task at hand. The matchups create great individual contests that help determine the outcome of the team game. Playing the matchups is crucial in fantasy football. Nothing has been decided at this point because we are quite busy trying to predict the new head coaches and analyzing the playoff matchups. This is basically an even matchup, a toe-to-toe slugfest of a heavyweight championship battle in the making. Synonymscorrespond, be in agreement, tally, agree, match up, coincide, accord, conform, square, harmonize, be consonant, be compatible1.1BasketballA strategic pairing of one player with another from the opposing team for the purpose of marking. Example sentencesExamples The man to man matchup is basketball in its purest form.2A selected combination of people or things. the matchups of flavours are ideal Synonymscombine, match up, link, bring together, put together, unite, marry, pair up, yoke, team, couple, pair, allyDefinition of matchup in US English: matchup nounˈmaCHəpNorth American 1A contest between athletes or sports teams. a matchup of two twenty-something pitchers wondering what it is like to win in the majors Example sentencesExamples The playoffs are no time to be clever by benching your most talented players because they have bad matchups and start experimenting with mediocre players in good matchups. In most cases, the outside man got a one-on-one matchup and the inside player drew the double team. The game featured key matchups as both teams put out their best players with two crucial points on the line. The teams have battled to four straight Game 7, winner-take-all playoff matchups, with New York winning the last three. Basketball is a team game, but the NBA is about individual matchups - whichever team wins the most matchups wins the game. He doesn't shy away from matchups against star players and is the team's nastiest linema", "n. Nothing has been decided at this point because we are quite busy trying to predict the new head coaches and analyzing the playoff matchups. A couple of scouts and coaches offered their expertise in breaking down the divisional playoff matchups of the upcoming weekend. If you are one of the many who use a two-back system, you can find success if you closely monitor matchups and know each player's strengths and weaknesses. Playing the matchups is crucial in fantasy football. Always a heated rivalry, this Friday tilt could shape up to be a playoff matchup preview. Three playoff matchups from last fall will be revived this weekend. If we've gotten line matchups or individual player matchups from the coaches, then I focus on the task at hand. The rest will feature game after game of hotly contested matchups with nightly playoff implications during the final two-dozen games or so. The teams with the most favorable player matchups will be the teams holding trumps in the final three weeks. The matchups create great individual contests that help determine the outcome of the team game. We'll have in-depth scouting reports on each team minutes after the bracket is announced, and we cover the tournament with matchups for all 64 games. However, in each of the postseason matchups, his team rallied from behind to win, the exact opposite of their playoff predecessors. After you've spent a few minutes savoring another strong week for your squad, it's important to look at your players' matchups for the next week. This is basically an even matchup, a toe-to-toe slugfest of a heavyweight championship battle in the making. Synonymscorrespond, be in agreement, tally, agree, match up, coincide, accord, conform, square, harmonize, be consonant, be compatible1.1BasketballA man-to-man defense.See man to man at man Example sentencesExamples The man to man matchup is basketball in its purest form.  match up toSee match1match1 noun matʃmætʃ1A contest in which people or teams compete against each other in a particular sport. a boxing match Example sentencesExamples And, no matter what the sport, we all know that over a five match series the better team will wi", "n. The World Cup final is a match that touches almost every country in some way. There can't be many stadiums full to the rafters every week even though their team has lost six matches in a row. The players will be split into four teams for matches. There is no place in this distinctive genre for the football team, the cricket match or the game of bowls. Such was their dominance over the visitors, had it been a boxing match, the referee would have stopped the contest in the first half. He came back for four matches in the final games of the season and just squeezed in enough games to qualify for a title medal. The clubs have started a mutual war of nerves, accusing each other of fixing matches and corrupting referees. It is becoming increasingly frustrating to witness teams forfeiting matches for one reason or the other. Few can have sympathy for a team who starts a match as if they are already one up. The winners of their respective matches will contest the final, while the losers will play off for the bronze medal. Because the kick-off of the game was delayed it was too dark to play extra time and the match is to be replayed. I have seen teams win gruelling matches through good goal kicking. Each team will play five matches from tomorrow until Monday with the final scheduled for next Tuesday. Another worrying factor is the appointment of referees to officiate in matches involving teams from their own backyards. We entertained ourselves with a talent show, boxing matches and tug-of-war duels. All games were keenly contested and several matches were decided on tiebreakers. He said the team was playing training matches with local clubs to help it tune up for the tournament. We had worked so hard on team matches and winning really made us feel that the hard work paid off. I had sensed some nerves in the camp before the game, our first match in competition in two years. Synonymscontest, competition, game, tournament, tie, cup tie, event, fixture, trial, test, test match, meet, bout, fight, duelquarter-final, semi-final, final, Cup Finalfriendly, derby, local derbyplay-off, replay, rematchBritish clashCanadian &amp;amp Scottish playdownNorth American splitinformal, dated millarchaic tourney2A person or thing that is equal to another in quality or strength. they were no match for the mercenaries Example sentencesExamples However, the lack of experience was no match for the exuberance of youth. Special care may have to be taken to ensure that he enjoys the company of his classmates, who are likely to be no match for him. She knew she was no match for his strength. The poorly-armed soldiers prove to be no match for the battle mad Vikings. In recent decades his waning strength proved no match for the ravages of well intentioned but overbearing regulations. It is cheap and strangely enjoyable, but no match for a genuine blockbuster. I resisted as best I could, but I was no match for the three of them, who dragged me to the water and threw me into the surf. She is no match for her husband either in stature or in qualities and accepts her lot with resignatio", "n. The cold was no match for these paragons of athletic prowess and goodwill. In the end, truth is no match for economics and a misguided vision of self-preservatio", "n. These vexed machines with their built in obsolescence are no match for me. Corporate greed and power are eventually no match for this woman's determination to set things right. Intelligence and honesty are sometimes no match for comfortable habits of thought. The satyr, drunken as he is, is no match for the heavyweight nymphs. The giant tried to stop him at first, but his size and strength were no match for William's. Despite some very good performances, they were no match for the strength of the local side. I feared for a dog that would be no match for the thuggish birds. Our fast feet are no match for opponents on longboards, who tag us almost immediately. The pen may be mightier than the sword - but it's no match for a boxer's fist. Seeing she was no match for the animal in this grapple, the mother extended her hand into the bear's mouth. Synonymsequal, rival, equivalent, peer, counterpartrare compeer3A person or thing that resembles or corresponds to another. the child's identical twin would be a perfect match for organ donation Example sentencesExamples The cold gelato scoop on top was a perfect match as it melted onto its dark chocolately pedestal. The orange warms up from the hot caramel sauce, and it's tanginess is a perfect match for the sweetness of the sauce. At the lowest end there are some excellent everyday wines while at the top end quality matches price. You spot the ideal pair of trousers on the hanger; they are the perfect match for your snazzy little jacket and top. Dozens turned up for blood tests, but they will have to wait until next month to find out if any are a perfect match. He heard nothing for a decade until a letter asked him to save the life of a patient who was a perfect match and needed the transplant within days. The little girl has a rare tissue type with an estimated one in 90,000 chance of finding a perfect match. It was a perfect match between the wish of people to own their own homes and a public which needed somewhere to put its savings. The vaccine will almost certainly protect very well, but it's not the perfect match. A kidney patient has been given a new lease of life after enduring a 20-year wait for a perfect organ match. I've always added lemon rind to my butter - this gives it a really fresh zingy taste which is a perfect match for the mussels. Instead, they could have their own tissue cloned to produce a perfect match. The sweet onions were a perfect match for the thyme and the other ingredients. And one day that person waiting for an organ match could be themselves or someone very dear to them. The two had been courting for quite some time and knew that their relative strengths were a good match. Medical opinion holds that if the patient's body doesn't reject the bone marrow within five years, it is a perfect match. The match was far from perfect, and doctors were not optimistic about the chances of a successful transplant. The bitter taste of the chocolate combined with sweet and refreshing fruit is a perfect match. Here, her activity is more personal and it is the perfect match for the way in which her husband chooses to depict her. Their pungent, peppery taste is ", "also the perfect match for mild-tasting ingredients such as avocados. Synonymsreplica, copy, lookalike, double, twin, duplicate, equivalent, facsimile, likemate, fellow, companion, counterpart, pair, complementinformal spitting image, spit and image, spit, dead spit, ringer, dead ringer3.1ComputingA string that fulfils the specified conditions of a computer search. when the software finds a match, it writes the correct character Example sentencesExamples When it finds a match, the database sends back the text message, identifying the song. Intelligence officers then search for a match on the internal database. Have you ever done a search and seen that there were a million matches for your search terms? A search engine company's goal is to provide the end user with the best, most relevant matches to a search inquiry. Aaron ran a search on the government database for any matches to her picture, but none came.3.2 A similar or complementary pair. the headdresses and bouquet were a perfect match3.3 The fact or appearance of corresponding. stones of a perfect match and colour4A person viewed in regard to their eligibility for marriage, especially as regards class or wealth. he was an unsuitable match for any of their girls Example sentencesExamples She had always encouraged the infatuation, saying that the pair were a perfect match. Marriages usually result from family introductions, if not outright matches. These rituals would often lead to matches and marriages, either immediately in the coming summer or autum", "n. Many matches and marriages came out of working in the factory. Synonymsprospective husband/wife, prospect, candidateinformal catch4.1 A marriage. a dynastic match Example sentencesExamples He took her by storm and the match was the marriage of the year, that Hollywood would only experience in that time. Synonymsmarriage, betrothal, relationship, partnership, union, pairing, alliance, compact, contract, affiliation, combinationverb matʃmætʃ1Correspond or cause to correspond in some essential respect; make or be harmonious.with object I thought we'd have primrose walls to match the bathno object the jacket and trousers do not match Example sentencesExamples One is that it could provide sick people with matching organs or tissues. In short, the stock is creating its own filler, and the resulting color matches perfectly. They were not the usual fluff that is true for anyone but closely matched his personal life. The honeyed brown of the truck matched her skin tone perfectly, and it was leathery soft. These statements, as it happens, match observed facts at the scene of the killing. The speech pattern, which mimics the sound of his playing, has a distinctive modular tone that matches the rhythm. And if you're going to go blonde try to make sure it matches your skin tone. Nothing matches, and the colours are sharp enough to pierce your retina. Choose a color or pattern that either matches or complements your suit. We'll read a few of them next week and see if what you wrote matches what, in fact, he said. The woman was brunette and had a plum evening gown on with matching make-up and a coordinating flower and feather in a bun on the base of her neck. My eyes looked flat, dead, though I was crying, and my tone matched my eyes. As long as it matches your personal style and the rest of your outfit, you'll look great. Now people have matching furniture, and kitchen gadgets, and pictures on the walls. I'm very proud; the ambery colour I picked matches just right the base I already had. The failure of both sides of his face to act in unison shows that his real feelings don't match up with the image he is putting across to the public. The synthetic skin didn't quite match his normal skin tone but that was the only indication that it was artificial. Foundation should match your skin tone as closely as possible; powder should match your foundatio", "n. In other words, match the tanner shade to your skin tone rather than the colour you would like to be. At least, she can wear matching pyjamas to blend in with their colours. Synonymsgo with, coordinate with, complement, harmonize with, blend with, tone with, team with, be the same as, be similar to, suitbe a pair, be a set, be the same, go togethercorrespond, be in agreement, tally, agree, match up, coincide, accord, conform, square, harmonize, be consonant, be compatiblecorresponding, equivalent, parallel, analogous, coordinating, complementing, complementary, harmonizing, blending, toning, harmonious, the same, paired, twin, coupled, double, duplicate, identical, (all) of a piece, like, like (two) peas in a pod, alike, comparable, similar, correlative, congruent, tallying, agreeing, concordant, consonant1.1with object Put (someone or something) together with someone or something else appropriate or harmonious. she was trying to match the draperies to the couch Example sentencesExamples We put together an unprecedented ground operation, but it was matched by the zealots on the right. How do you go about matching the appropriate celebrity with the clients? Are there people you want to read solo whom you'd like less if they were matched up with some appropriate co-bloggers? She had a gift for getting people to work together and she could always match the right person to the right job. There was no outright winner but 12 people matched three numbers. The biggest problem was matching cars with people, most of whom wanted one-way rentals out of airports. Each rider is matched with a horse of the appropriate weight and height, but they are all at ease with teaching people who have never ridden before. Our role is to place them in the most appropriate position, matching the candidate's skills to those required by the client. Here, the game of matching his name to the appropriate subject can be astonishingly easy. Pin two sections together, matching the squares; stitch between the squares. Use wire nuts to fasten the two ends together, matching the color-coded wires. Tape the two vinyl sections firmly together after they are matched so they won't move when you cut them. When pieces are stolen and smuggled out, sometimes blocks of fossils are matched together mistakenly. They simply seem like two oddly matched adults, thrown together. My answers were matched with those of people who were happy and successful in certain jobs. Synonymscombine, match up, link, bring/put together, unite, marry, pair up, yoke, team, couple, pair, allyformal conjoin2with object Be equal to (something) in quality or strength. his anger matched her own Example sentencesExamples But then his intellectual brilliance is matched by his enigmatic personality - you can't be sure what he's really up to. The quality of the hot dog is matched by the quality of the toppings. The power of the press to cause panic was matched by their equal power to quell the imbalance they had caused. The whiskey beat his expectations but didn't match his own collectio", "n. Often they don't bother to announce rises at all, and when they do the result rarely matches the hike to the base rate the Bank of England has announced. Her beautiful looks and elegant acting were matched by rich tone, expressiveness, and virtuoso technique, which can be heard in her recordings. McCarthy's perceived influence among his peers is matched by his personal popularity. So, in many ways, the results didn't match the symbolism that he obviously enjoyed. Sadly this tough talk is not matched by results. Their skills increased as they trained and soon Raymond's people matched warriors of the other village. The selfishness of fame seekers is only matched by the personal cost they have to pay for the fame they seek. For six weeks, the results on the field matched the hype off it. I tried a couple of shots to see if I could record what I saw today but the results didn't match my visio", "n. His continually moronic, arrogant behaviour has meant that his results have never matched the drivel that comes out of his mouth. Can't we pick people with a keener sense of how their strengths match the demands of the role? The allure of the strapline was usually matched by the quality of the content. It should be as light and as strong as possible, and its size should match your body and strength. They found that the couples whose expectations matched their relationship skills were most satisfied. This sensitivity about representing race is not matched by an equal sensitivity about representing class. He would have brushed me off, made me answer for my tone - but not argued with me, not matched me shout for shout. Synonymsequal, be equal to, be the equal of, be a match for, measure up to, compare with, parallel, be in the same league as, be in the same category as, be on a par with, touch, keep pace with, keep up with, emulate, rival, vie with, compete with, contend withinformal hold a candle to2.1 Succeed in reaching or equalling (a standard or quality) he tried to match her nonchalance Example sentencesExamples Two years ago more than 124,000 people attended this event, but they knew those figures couldn't be matched this time. Schools in the area have once again performed well, with most at least matching the national average pass rate. There's a uniformly high standard set that is matched, then raised by every participant. Schools in the district have chalked up outstanding performances, with most of them at least matching the national average pass rate. New York City matched an 1893 degree record low for the day at one degree, according to the National Weather Service. One survey suggests that if British enterprise levels matched those in the United States an extra 250,000 businesses would be created. Thirty scores dotted the game, almost matching a modest foul count of 34. The next event was his best, the high jump, in which he matched his personal best, jumping clear of the field and moving into fourth. Some of the dioramas were repainted up to six times until they matched his exacting standards. Synonymscome up to, measure up to, meet with, be equal to, be as good as, satisfy, fulfil, answer to2.2 Equalize (two coupled electrical impedances) so as to bring about the maximum transfer of power from one to the other. the impedance of microphones, auxiliary equipment, and loudspeakers must be matched Example sentencesExamples If the load impedance perfectly matches the transmission line impedance, the reflected power is zero. An impedance matching circuit is provided for each signal-carrying wire pair of the first and second wire pair sets. New features include a 1.8V matched impedance interface, known as stub series terminated logic. Care should be taken in impedance matching between the elements of the user's GPS system.3with object Place (a person or group) in competition with another. the big names were matched against nobodies Example sentencesExamples An indication as to how evenly matched these two teams were is evidenced in the fact that both teams only registered one point each in the opening quarter. This was a lively game of football with two evenly matched teams who played some good football in slippery conditions. I will stare down the pack of cigarettes, matching wits and strength against tobacco. We are evenly matched so we have to hope we want it more on the night. He can be effective in the slot when he's matched against nickel cornerbacks who can't get their hands on him. The teams were evenly matched and shared the lead throughout the match. Both teams came with the spirit of competition and were evenly matched with the skills displayed by all participants. This was an exciting game between two evenly matched teams. The two teams were evenly matched trading points early o", "n. He was even matched against - and beat - the toughest cage fighters in the world in America. The two teams are evenly matched in this series, and what will separate them is strategy. It was a titanic struggle between two evenly matched teams. Having drawn the first game it took extra time in this replay to separate what were two evenly matched teams. No good or exciting game can be played without the participation of two good evenly matched teams. The two periods of extra time ", "also failed to separate these two evenly matched teams but one wonders how. In games like this where the stakes are so high, I think when the teams are evenly matched it can go either way. While on the field of play both teams were evenly matched. Two very evenly matched teams traded score for score in the third quarter. The teams are evenly matched as they have split their games so far this year. From the very beginning, the teams were evenly matched. Synonymsdraw against, set against, pit against, play off againstPhrasesmake a matchGet married. Harry and the Harvey girl were going to make a match of it Example sentencesExamples Both in the movies and in life, Tracy thought he and Hepburn were far too different to make a match; she thought they were much too alike. A Boston matron he met during his trip north tried to persuade him to remain in that city in the hopes of making a match for a marriageable daughter. Surely this is now her only chance of making a match, for any respectable gentleman is bound to be dissuaded from asking for her hand. However, the very next day she was besieged with complaints from her disappointed newlyweds, and conceded the great wisdom needed for making a match that leads to a happy marriage. Her plan is to send Tess to get the woman to take her in and make a match for her with a wealthy man so that the family will be set for life. Apparently they were planning to make a match for me. Matrimonials on the Net may have a long way to go before they start rivalling the conventional ways of making a match, but web companies are really striving hard to realise the latent potential of this medium.meet one's matchEncounter one's equal in strength or ability. Iris had met her match Example sentencesExamples It's ", "also reassuring to have finally met my match in ineptness. I imagine they have made some bawdy bravado remark about wanting to see someone's helmet, and have met their match. Professional eater that I am, I confess I met my match - even with the help of the women at the table taking their nibbling bites, I couldn't finish the dessert. But Edinburgh's dreaded parking attendants have finally met their match in the shape of the doughty Balmoral Hotel. In some of the most humble people in the world, the would-be makers of the economic commandments may well have met their match. But at last our cold weather adventurer had met his match. It is where some of Australia's great outback legends were created, and where some met their match. I want to congratulate you on being a great interviewer, but I think you've met your match. And in the case of Saturday night's incident, the attacker nearly met his match. However, on Wednesday they met their match even before stepping onto the cricket pitch.to matchCorresponding in some essential respect with something previously mentioned or chose", "n. a new coat and a hat to match Example sentencesExamples For millions of years it has led an unglamorous life with an unfortunate name to match. He has always been a charismatic lead singer and he certainly has the stamina to match. So now we've just got the sideboard still to get, and possibly a new dining room table to match. Having bundles of money and a lifestyle to match is little more than a dream to most folk. Never any trouble to look after, he was a great little pet with a personality to match. The commercial offerings are very impressive, but tend to have a price tag to match. We have a Premier League set-up in terms of facilities and we have ambitions to match.Phrasal Verbsmatch up toBe as good as or equal to. she matches up to the challenges of the job Example sentencesExamples No guy I've ever met has matched up to him and I doubt any guy ever will. As far as pace is concerned, I don't think I have seen a single team that could match up to what we're doing. As the guidelines have recently changed we need to make sure that our operation matches up to what is expected. And one way to make us feel that we are lacking is by showing us images of people the majority of us do not match up to. Neil's job aspirations have not matched up to what was expected. The statistics of most of the old-timers don't match up to what guys are doing today. Sums given for flood relief have not matched up to even half of the needs of those left homeless, at risk, and without an income. So it seemed that, for me, anyway, poems were going to happen rarely if they were going to match up to what I would wish them to be. But how could anything match up to what are quite frankly the most enjoyable gigs we've ever been to? You have to go through so many filters, answer to the critics, match up to the last decent work.match someone withBring about the marriage of someone to. try if you can to match her with a duke Example sentencesExamples She wants to match Harriet with Mr. Elton, and when Harriet compliments him, Emma's plan is set in motio", "n. You should consider yourself lucky that you have been matched with a young noble at all. She arrives with strong opinions about politics and her social obligations that clash with her father's conservatism, and she has no patience with the upper-class twit her parents try to match her with. John tells Elinor that they are thinking of matching Miss Morton with Robert, now that Edward is marrying Lucy. After the death of her father-in-law and unsuccessful attempts at matching Mr. Tweedie with her daughters, Mrs. Lapham marries him herself, mainly to keep the silver shop in the family.DerivativesmatchableadjectiveAny matchable tile to the skeleton layout must be played to it and no holdbacks are allowed for any player. Example sentencesExamples And by the way, most of that is matchable because of the matching funds. It's only very recently that Registered births and deaths have been computerised and matchable. For presidential candidates accepting matching funds, a money order is considered to be a matchable contributio", "n. Zoom forward to today, and there is nothing at all that is of matchable relevance.OriginOld English gemæcca 'mate, companion', of West Germanic origin; related to the base of make.Match in the sense ‘be the same as’ comes from an Old English word meaning ‘mate, companion’ which probably goes back to the same root as Old English make. Use of the word to mean ‘contest, competitive trial’ dates from the early 16th century. The match associated with fire was first used to mean ‘candle wick’. It is from Old French meche, perhaps from Latin myxa meaning ‘spout of a lamp, lamp wick’. The wooden match we are familiar with today dates from the early 19th century.VideoRhymesattach, batch, catch, crosshatch, detach, hatch, latch, mismatch, natch, outmatch, patch, scratch, thatch match2noun matʃmætʃ1A short, thin piece of wood or cardboard used to light a fire, being tipped with a composition that ignites when rubbed against a rough surface. he struck a match against the wall Example sentencesExamples It was sort of cool that night so I went up into the house, struck a match and lit the heater. I struck a match and lit a candle and put it in the green glass dish and I went into the kitche", "n. She positioned some sticks, and lit a fire with matches in her pocket, and sat down to warm up. He tried to light up his matches to put his shoes on fire and explode. Nama struck a match and its head went into flames, then she took it and lit a small lantern in the middle of the room. It was he who struck a match and carried out the dramatic unmasking of the villai", "n. Take great care not to light fires, or even to discard matches or cigarette ends in areas where there is a danger of fire spreading. After counting them, and returning the bag, he found a match and lit a small fire. He poured some of the gas on the trash, struck a match, and soon the fire roared. They have to catch and prepare their own food, light a fire without matches and build a shelter. He lit a match and warmed the foil until the powder liquified. He took part in training sessions and even played for short periods in some matches. After several attempts and most of the matches, she lit a small fire. She struck a match on the rough side of the box, and quickly threw the burning stick onto the first bush. He threw petrol in my car as I was sitting in it and he struck a match and threw it at the car. I got up, and while doing so struck a match to ignite the overhead oxyge", "n. He struck a match and turned on the gas fire stove, placing a greased pan on the fire. He struck a match and the objects on the mantelpiece threw brief shadows on the wall. Little kids like myself were handed matches and told to light the candles. Then he lit a match, and began igniting the shreds in the cup as he breathed in through the tube.1.1historicalA piece of wick or cord designed to burn at a uniform rate, used for firing a cannon or lighting gunpowder.Phrasesput a match toSet fire to. Example sentencesExamples Even if we had to put a match to what is left, and I sincerely hope we don't, we would still count it as a success. It was the first thing he'd done when he got back from the hospital-sweep everything even vaguely illegal into a bag and then put a match to it. He put a match to an ancient smoke flare, which he'd brought to signal our success to friends below, and held it aloft. It cannot be true for you that petrol burns and not true for me, since what happens when I put a match to petrol is just what happens if you do. Inside, he puts a match to the carefully laid wood of an open fire, the smoke billowing back immediately into the room. A Canadian based in London with a background in classical piano and advanced mathematics, he has taken the rulebook and put a match to it. The summer had been hot and the scrub was tinder dry, so it took little effort to put a match to but needed careful watching.OriginLate Middle English (in the sense 'wick of a candle'): from Old French meche, perhaps from Latin myxa 'spout of a lamp', later 'lamp wick'.nou", "n.1 phr. phr.", "v. nou", "n.2 phr.match1 nounmætʃmaCH1A contest in which people or teams compete against each other in a particular sport. a boxing match Example sentencesExamples Because the kick-off of the game was delayed it was too dark to play extra time and the match is to be replayed. The World Cup final is a match that touches almost every country in some way. I have seen teams win gruelling matches through good goal kicking. Few can have sympathy for a team who starts a match as if they are already one up. Each team will play five matches from tomorrow until Monday with the final scheduled for next Tuesday. We entertained ourselves with a talent show, boxing matches and tug-of-war duels. All games were keenly contested and several matches were decided on tiebreakers. It is becoming increasingly frustrating to witness teams forfeiting matches for one reason or the other. The winners of their respective matches will contest the final, while the losers will play off for the bronze medal. The players will be split into four teams for matches. He said the team was playing training matches with local clubs to help it tune up for the tournament. There can't be many stadiums full to the rafters every week even though their team has lost six matches in a row. I had sensed some nerves in the camp before the game, our first match in competition in two years. And, no matter what the sport, we all know that over a five match series the better team will wi", "n. The clubs have started a mutual war of nerves, accusing each other of fixing matches and corrupting referees. There is no place in this distinctive genre for the football team, the cricket match or the game of bowls. Such was their dominance over the visitors, had it been a boxing match, the referee would have stopped the contest in the first half. Another worrying factor is the appointment of referees to officiate in matches involving teams from their own backyards. We had worked so hard on team matches and winning really made us feel that the hard work paid off. He came back for four matches in the final games of the season and just squeezed in enough games to qualify for a title medal. Synonymscontest, competition, game, tournament, tie, cup tie, event, fixture, trial, test, test match, meet, bout, fight, duel2A person or thing able to contend with another as an equal in quality or strength. they were no match for the trained mercenaries Example sentencesExamples I feared for a dog that would be no match for the thuggish birds. The giant tried to stop him at first, but his size and strength were no match for William's. Despite some very good performances, they were no match for the strength of the local side. She knew she was no match for his strength. The poorly-armed soldiers prove to be no match for the battle mad Vikings. In the end, truth is no match for economics and a misguided vision of self-preservatio", "n. Corporate greed and power are eventually no match for this woman's determination to set things right. Special care may have to be taken to ensure that he enjoys the company of his classmates, who are likely to be no match for him. Seeing she was no match for the animal in this grapple, the mother extended her hand into the bear's mouth. However, the lack of experience was no match for the exuberance of youth. The satyr, drunken as he is, is no match for the heavyweight nymphs. The cold was no match for these paragons of athletic prowess and goodwill. It is cheap and strangely enjoyable, but no match for a genuine blockbuster. These vexed machines with their built in obsolescence are no match for me. The pen may be mightier than the sword - but it's no match for a boxer's fist. She is no match for her husband either in stature or in qualities and accepts her lot with resignatio", "n. Intelligence and honesty are sometimes no match for comfortable habits of thought. Our fast feet are no match for opponents on longboards, who tag us almost immediately. In recent decades his waning strength proved no match for the ravages of well intentioned but overbearing regulations. I resisted as best I could, but I was no match for the three of them, who dragged me to the water and threw me into the surf. Synonymsequal, rival, equivalent, peer, counterpart3A person or thing that resembles or corresponds to another. the child's identical twin would be a perfect match for organ donation Example sentencesExamples The orange warms up from the hot caramel sauce, and it's tanginess is a perfect match for the sweetness of the sauce. It was a perfect match between the wish of people to own their own homes and a public which needed somewhere to put its savings. Instead, they could have their own tissue cloned to produce a perfect match. Medical opinion holds that if the patient's body doesn't reject the bone marrow within five years, it is a perfect match. And one day that person waiting for an organ match could be themselves or someone very dear to them. I've always added lemon rind to my butter - this gives it a really fresh zingy taste which is a perfect match for the mussels. The match was far from perfect, and doctors were not optimistic about the chances of a successful transplant. The sweet onions were a perfect match for the thyme and the other ingredients. The two had been courting for quite some time and knew that their relative strengths were a good match. The little girl has a rare tissue type with an estimated one in 90,000 chance of finding a perfect match. The cold gelato scoop on top was a perfect match as it melted onto its dark chocolately pedestal. He heard nothing for a decade until a letter asked him to save the life of a patient who was a perfect match and needed the transplant within days. Their pungent, peppery taste is ", "also the perfect match for mild-tasting ingredients such as avocados. The bitter taste of the chocolate combined with sweet and refreshing fruit is a perfect match. At the lowest end there are some excellent everyday wines while at the top end quality matches price. The vaccine will almost certainly protect very well, but it's not the perfect match. A kidney patient has been given a new lease of life after enduring a 20-year wait for a perfect organ match. You spot the ideal pair of trousers on the hanger; they are the perfect match for your snazzy little jacket and top. Dozens turned up for blood tests, but they will have to wait until next month to find out if any are a perfect match. Here, her activity is more personal and it is the perfect match for the way in which her husband chooses to depict her. Synonymsreplica, copy, lookalike, double, twin, duplicate, equivalent, facsimile, like3.1ComputingA string that fulfills the specified conditions of a computer search. Example sentencesExamples When it finds a match, the database sends back the text message, identifying the song. Aaron ran a search on the government database for any matches to her picture, but none came. A search engine company's goal is to provide the end user with the best, most relevant matches to a search inquiry. Intelligence officers then search for a match on the internal database. Have you ever done a search and seen that there were a million matches for your search terms?3.2 A pair that corresponds or is very similar. the headdresses and bouquet were a perfect match3.3 The fact or appearance of corresponding. stones of a perfect match and color4A person viewed in regard to their eligibility for marriage, especially as regards class or wealth. he was an unsuitable match for any of their girls Example sentencesExamples Marriages usually result from family introductions, if not outright matches. These rituals would often lead to matches and marriages, either immediately in the coming summer or autum", "n. Many matches and marriages came out of working in the factory. She had always encouraged the infatuation, saying that the pair were a perfect match. Synonymsprospective husband, prospective wife, prospect, candidate4.1 A marriage. a dynastic match Example sentencesExamples He took her by storm and the match was the marriage of the year, that Hollywood would only experience in that time. Synonymsmarriage, betrothal, relationship, partnership, union, pairing, alliance, compact, contract, affiliation, combinationverbmætʃmaCH[with object]1Correspond or cause to correspond in some essential respect; make or be harmonious.no object the jacket and pants do not matchwith object we bought green and blue curtains to match the bedspread she matched her steps to his Example sentencesExamples The failure of both sides of his face to act in unison shows that his real feelings don't match up with the image he is putting across to the public. Now people have matching furniture, and kitchen gadgets, and pictures on the walls. Foundation should match your skin tone as closely as possible; powder should match your foundatio", "n. One is that it could provide sick people with matching organs or tissues. We'll read a few of them next week and see if what you wrote matches what, in fact, he said. I'm very proud; the ambery colour I picked matches just right the base I already had. The synthetic skin didn't quite match his normal skin tone but that was the only indication that it was artificial. The woman was brunette and had a plum evening gown on with matching make-up and a coordinating flower and feather in a bun on the base of her neck. In short, the stock is creating its own filler, and the resulting color matches perfectly. At least, she can wear matching pyjamas to blend in with their colours. And if you're going to go blonde try to make sure it matches your skin tone. My eyes looked flat, dead, though I was crying, and my tone matched my eyes. As long as it matches your personal style and the rest of your outfit, you'll look great. The honeyed brown of the truck matched her skin tone perfectly, and it was leathery soft. Choose a color or pattern that either matches or complements your suit. These statements, as it happens, match observed facts at the scene of the killing. They were not the usual fluff that is true for anyone but closely matched his personal life. In other words, match the tanner shade to your skin tone rather than the colour you would like to be. The speech pattern, which mimics the sound of his playing, has a distinctive modular tone that matches the rhythm. Nothing matches, and the colours are sharp enough to pierce your retina. Synonymscorresponding, equivalent, parallel, analogous, coordinating, complementing, complementary, harmonizing, blending, toning, harmonious, the same, paired, twin, coupled, double, duplicate, identical, of a piece, all of a piece, like, like peas in a pod, like two peas in a pod, alike, comparable, similar, correlative, congruent, tallying, agreeing, concordant, consonantgo with, coordinate with, complement, harmonize with, blend with, tone with, team with, be the same as, be similar to, suitbe a pair, be a set, be the same, go togethercorrespond, be in agreement, tally, agree, match up, coincide, accord, conform, square, harmonize, be consonant, be compatible1.1 Team (someone or something) with someone or something else appropriate or harmonious. she was trying to match the draperies to the couch they matched suitably qualified applicants with institutions that had vacancies Example sentencesExamples Pin two sections together, matching the squares; stitch between the squares. She had a gift for getting people to work together and she could always match the right person to the right job. Here, the game of matching his name to the appropriate subject can be astonishingly easy. They simply seem like two oddly matched adults, thrown together. Our role is to place them in the most appropriate position, matching the candidate's skills to those required by the client. The biggest problem was matching cars with people, most of whom wanted one-way rentals out of airports. We put together an unprecedented ground operation, but it was matched by the zealots on the right. Are there people you want to read solo whom you'd like less if they were matched up with some appropriate co-bloggers? My answers were matched with those of people who were happy and successful in certain jobs. There was no outright winner but 12 people matched three numbers. How do you go about matching the appropriate celebrity with the clients? When pieces are stolen and smuggled out, sometimes blocks of fossils are matched together mistakenly. Use wire nuts to fasten the two ends together, matching the color-coded wires. Tape the two vinyl sections firmly together after they are matched so they won't move when you cut them. Each rider is matched with a horse of the appropriate weight and height, but they are all at ease with teaching people who have never ridden before. Synonymscombine, match up, link, bring together, put together, unite, marry, pair up, yoke, team, couple, pair, ally2Be equal to (something) in quality or strength. his anger matched her own Example sentencesExamples The allure of the strapline was usually matched by the quality of the content. Often they don't bother to announce rises at all, and when they do the result rarely matches the hike to the base rate the Bank of England has announced. Sadly this tough talk is not matched by results. The selfishness of fame seekers is only matched by the personal cost they have to pay for the fame they seek. So, in many ways, the results didn't match the symbolism that he obviously enjoyed. McCarthy's perceived influence among his peers is matched by his personal popularity. Can't we pick people with a keener sense of how their strengths match the demands of the role? But then his intellectual brilliance is matched by his enigmatic personality - you can't be sure what he's really up to. I tried a couple of shots to see if I could record what I saw today but the results didn't match my visio", "n. Her beautiful looks and elegant acting were matched by rich tone, expressiveness, and virtuoso technique, which can be heard in her recordings. The power of the press to cause panic was matched by their equal power to quell the imbalance they had caused. It should be as light and as strong as possible, and its size should match your body and strength. The whiskey beat his expectations but didn't match his own collectio", "n. His continually moronic, arrogant behaviour has meant that his results have never matched the drivel that comes out of his mouth. For six weeks, the results on the field matched the hype off it. This sensitivity about representing race is not matched by an equal sensitivity about representing class. He would have brushed me off, made me answer for my tone - but not argued with me, not matched me shout for shout. They found that the couples whose expectations matched their relationship skills were most satisfied. The quality of the hot dog is matched by the quality of the toppings. Their skills increased as they trained and soon Raymond's people matched warriors of the other village. Synonymsequal, be equal to, be the equal of, be a match for, measure up to, compare with, parallel, be in the same league as, be in the same category as, be on a par with, touch, keep pace with, keep up with, emulate, rival, vie with, compete with, contend with2.1 Succeed in reaching or equaling (a standard or quality) he tried to match her nonchalance Example sentencesExamples Schools in the area have once again performed well, with most at least matching the national average pass rate. Schools in the district have chalked up outstanding performances, with most of them at least matching the national average pass rate. There's a uniformly high standard set that is matched, then raised by every participant. Some of the dioramas were repainted up to six times until they matched his exacting standards. New York City matched an 1893 degree record low for the day at one degree, according to the National Weather Service. One survey suggests that if British enterprise levels matched those in the United States an extra 250,000 businesses would be created. Thirty scores dotted the game, almost matching a modest foul count of 34. The next event was his best, the high jump, in which he matched his personal best, jumping clear of the field and moving into fourth. Two years ago more than 124,000 people attended this event, but they knew those figures couldn't be matched this time. Synonymscome up to, measure up to, meet with, be equal to, be as good as, satisfy, fulfil, answer to2.2 Equalize (two coupled electrical impedances) so as to bring about the maximum transfer of power from one to the other. Example sentencesExamples Care should be taken in impedance matching between the elements of the user's GPS system. New features include a 1.8V matched impedance interface, known as stub series terminated logic. An impedance matching circuit is provided for each signal-carrying wire pair of the first and second wire pair sets. If the load impedance perfectly matches the transmission line impedance, the reflected power is zero.3Place (a person or group) in contest or competition with another. the big names were matched against nobodies Example sentencesExamples The two teams are evenly matched in this series, and what will separate them is strategy. An indication as to how evenly matched these two teams were is evidenced in the fact that both teams only registered one point each in the opening quarter. Having drawn the first game it took extra time in this replay to separate what were two evenly matched teams. No good or exciting game can be played without the participation of two good evenly matched teams. The two teams were evenly matched trading points early o", "n. This was an exciting game between two evenly matched teams. Two very evenly matched teams traded score for score in the third quarter. Both teams came with the spirit of competition and were evenly matched with the skills displayed by all participants. The teams were evenly matched and shared the lead throughout the match. The two periods of extra time ", "also failed to separate these two evenly matched teams but one wonders how. This was a lively game of football with two evenly matched teams who played some good football in slippery conditions. He was even matched against - and beat - the toughest cage fighters in the world in America. It was a titanic struggle between two evenly matched teams. While on the field of play both teams were evenly matched. The teams are evenly matched as they have split their games so far this year. We are evenly matched so we have to hope we want it more on the night. In games like this where the stakes are so high, I think when the teams are evenly matched it can go either way. From the very beginning, the teams were evenly matched. I will stare down the pack of cigarettes, matching wits and strength against tobacco. He can be effective in the slot when he's matched against nickel cornerbacks who can't get their hands on him. Synonymsdraw against, set against, pit against, play off againstPhrasesmake a matchForm a partnership, especially by getting married. Example sentencesExamples A Boston matron he met during his trip north tried to persuade him to remain in that city in the hopes of making a match for a marriageable daughter. However, the very next day she was besieged with complaints from her disappointed newlyweds, and conceded the great wisdom needed for making a match that leads to a happy marriage. Matrimonials on the Net may have a long way to go before they start rivalling the conventional ways of making a match, but web companies are really striving hard to realise the latent potential of this medium. Surely this is now her only chance of making a match, for any respectable gentleman is bound to be dissuaded from asking for her hand. Her plan is to send Tess to get the woman to take her in and make a match for her with a wealthy man so that the family will be set for life. Both in the movies and in life, Tracy thought he and Hepburn were far too different to make a match; she thought they were much too alike. Apparently they were planning to make a match for me.meet one's matchEncounter one's equal in strength or ability. Iris had met her match Example sentencesExamples But Edinburgh's dreaded parking attendants have finally met their match in the shape of the doughty Balmoral Hotel. And in the case of Saturday night's incident, the attacker nearly met his match. However, on Wednesday they met their match even before stepping onto the cricket pitch. It is where some of Australia's great outback legends were created, and where some met their match. Professional eater that I am, I confess I met my match - even with the help of the women at the table taking their nibbling bites, I couldn't finish the dessert. It's ", "also reassuring to have finally met my match in ineptness. I imagine they have made some bawdy bravado remark about wanting to see someone's helmet, and have met their match. But at last our cold weather adventurer had met his match. In some of the most humble people in the world, the would-be makers of the economic commandments may well have met their match. I want to congratulate you on being a great interviewer, but I think you've met your match.to matchCorresponding in some essential respect with something previously mentioned or chose", "n. a new coat and a hat to match Example sentencesExamples The commercial offerings are very impressive, but tend to have a price tag to match. Never any trouble to look after, he was a great little pet with a personality to match. So now we've just got the sideboard still to get, and possibly a new dining room table to match. We have a Premier League set-up in terms of facilities and we have ambitions to match. Having bundles of money and a lifestyle to match is little more than a dream to most folk. For millions of years it has led an unglamorous life with an unfortunate name to match. He has always been a charismatic lead singer and he certainly has the stamina to match.Phrasal Verbsmatch up toBe as good as or equal to. she matches up to the challenges of the job Example sentencesExamples Neil's job aspirations have not matched up to what was expected. As the guidelines have recently changed we need to make sure that our operation matches up to what is expected. You have to go through so many filters, answer to the critics, match up to the last decent work. No guy I've ever met has matched up to him and I doubt any guy ever will. So it seemed that, for me, anyway, poems were going to happen rarely if they were going to match up to what I would wish them to be. But how could anything match up to what are quite frankly the most enjoyable gigs we've ever been to? As far as pace is concerned, I don't think I have seen a single team that could match up to what we're doing. Sums given for flood relief have not matched up to even half of the needs of those left homeless, at risk, and without an income. And one way to make us feel that we are lacking is by showing us images of people the majority of us do not match up to. The statistics of most of the old-timers don't match up to what guys are doing today.match someone withBring about the marriage of someone to. try if you can to match her with a duke Example sentencesExamples You should consider yourself lucky that you have been matched with a young noble at all. She arrives with strong opinions about politics and her social obligations that clash with her father's conservatism, and she has no patience with the upper-class twit her parents try to match her with. She wants to match Harriet with Mr. Elton, and when Harriet compliments him, Emma's plan is set in motio", "n. John tells Elinor that they are thinking of matching Miss Morton with Robert, now that Edward is marrying Lucy. After the death of her father-in-law and unsuccessful attempts at matching Mr. Tweedie with her daughters, Mrs. Lapham marries him herself, mainly to keep the silver shop in the family.OriginOld English gemæcca ‘mate, companion’, of West Germanic origin; related to the base of make. match2nounmætʃmaCH1A short, thin piece of wood or cardboard used to light a fire, being tipped with a composition that ignites when rubbed against a rough surface. he struck a match against the wall Example sentencesExamples He lit a match and warmed the foil until the powder liquified. He tried to light up his matches to put his shoes on fire and explode. She struck a match on the rough side of the box, and quickly threw the burning stick onto the first bush. He threw petrol in my car as I was sitting in it and he struck a match and threw it at the car. She positioned some sticks, and lit a fire with matches in her pocket, and sat down to warm up. I got up, and while doing so struck a match to ignite the overhead oxyge", "n. After several attempts and most of the matches, she lit a small fire. He took part in training sessions and even played for short periods in some matches. He struck a match and the objects on the mantelpiece threw brief shadows on the wall. It was sort of cool that night so I went up into the house, struck a match and lit the heater. He poured some of the gas on the trash, struck a match, and soon the fire roared. He struck a match and turned on the gas fire stove, placing a greased pan on the fire. Take great care not to light fires, or even to discard matches or cigarette ends in areas where there is a danger of fire spreading. Then he lit a match, and began igniting the shreds in the cup as he breathed in through the tube. Nama struck a match and its head went into flames, then she took it and lit a small lantern in the middle of the room. It was he who struck a match and carried out the dramatic unmasking of the villai", "n. Little kids like myself were handed matches and told to light the candles. I struck a match and lit a candle and put it in the green glass dish and I went into the kitche", "n. After counting them, and returning the bag, he found a match and lit a small fire. They have to catch and prepare their own food, light a fire without matches and build a shelter.1.1historicalA piece of wick or cord designed to burn at a uniform rate, used for firing a cannon or lighting gunpowder.Phrasesput a match toSet fire to. Example sentencesExamples Inside, he puts a match to the carefully laid wood of an open fire, the smoke billowing back immediately into the room. He put a match to an ancient smoke flare, which he'd brought to signal our success to friends below, and held it aloft. A Canadian based in London with a background in classical piano and advanced mathematics, he has taken the rulebook and put a match to it. Even if we had to put a match to what is left, and I sincerely hope we don't, we would still count it as a success. The summer had been hot and the scrub was tinder dry, so it took little effort to put a match to but needed careful watching. It cannot be true for you that petrol burns and not true for me, since what happens when I put a match to petrol is just what happens if you do. It was the first thing he'd done when he got back from the hospital-sweep everything even vaguely illegal into a bag and then put a match to it.OriginLate Middle English (in the sense ‘wick of a candle’): from Old French meche, perhaps from Latin myxa ‘spout of a lamp’, later ‘lamp wick’.nou", "n.1 phr. phr.", "v. nou", "n.2 phr."]}, {"dict": "Oxford5000", "values": ["Definition of matchup in English: matchup nounNorth American 1A sporting contest between two players or teams. Example sentencesExamples The teams with the most favorable player matchups will be the teams holding trumps in the final three weeks. The game featured key matchups as both teams put out their best players with two crucial points on the line. The rest will feature game after game of hotly contested matchups with nightly playoff implications during the final two-dozen games or so. We'll have in-depth scouting reports on each team minutes after the bracket is announced, and we cover the tournament with matchups for all 64 games. In most cases, the outside man got a one-on-one matchup and the inside player drew the double team. The playoffs are no time to be clever by benching your most talented players because they have bad matchups and start experimenting with mediocre players in good matchups. Always a heated rivalry, this Friday tilt could shape up to be a playoff matchup preview. If you are one of the many who use a two-back system, you can find success if you closely monitor matchups and know each player's strengths and weaknesses. After you've spent a few minutes savoring another strong week for your squad, it's important to look at your players' matchups for the next week. However, in each of the postseason matchups, his team rallied from behind to win, the exact opposite of their playoff predecessors. Basketball is a team game, but the NBA is about individual matchups - whichever team wins the most matchups wins the game. A couple of scouts and coaches offered their expertise in breaking down the divisional playoff matchups of the upcoming weekend. The teams have battled to four straight Game 7, winner-take-all playoff matchups, with New York winning the last three. He doesn't shy away from matchups against star players and is the team's nastiest linema", "n. Three playoff matchups from last fall will be revived this weekend. If we've gotten line matchups or individual player matchups from the coaches, then I focus on the task at hand. The matchups create great individual contests that help determine the outcome of the team game. Playing the matchups is crucial in fantasy football. Nothing has been decided at this point because we are quite busy trying to predict the new head coaches and analyzing the playoff matchups. This is basically an even matchup, a toe-to-toe slugfest of a heavyweight championship battle in the making. Synonymscorrespond, be in agreement, tally, agree, match up, coincide, accord, conform, square, harmonize, be consonant, be compatible1.1BasketballA strategic pairing of one player with another from the opposing team for the purpose of marking. Example sentencesExamples The man to man matchup is basketball in its purest form.2A selected combination of people or things. the matchups of flavours are ideal Synonymscombine, match up, link, bring together, put together, unite, marry, pair up, yoke, team, couple, pair, allyDefinition of matchup in US English: matchup nounˈmaCHəpNorth American 1A contest between athletes or sports teams. a matchup of two twenty-something pitchers wondering what it is like to win in the majors Example sentencesExamples The playoffs are no time to be clever by benching your most talented players because they have bad matchups and start experimenting with mediocre players in good matchups. In most cases, the outside man got a one-on-one matchup and the inside player drew the double team. The game featured key matchups as both teams put out their best players with two crucial points on the line. The teams have battled to four straight Game 7, winner-take-all playoff matchups, with New York winning the last three. Basketball is a team game, but the NBA is about individual matchups - whichever team wins the most matchups wins the game. He doesn't shy away from matchups against star players and is the team's nastiest linema", "n. Nothing has been decided at this point because we are quite busy trying to predict the new head coaches and analyzing the playoff matchups. A couple of scouts and coaches offered their expertise in breaking down the divisional playoff matchups of the upcoming weekend. If you are one of the many who use a two-back system, you can find success if you closely monitor matchups and know each player's strengths and weaknesses. Playing the matchups is crucial in fantasy football. Always a heated rivalry, this Friday tilt could shape up to be a playoff matchup preview. Three playoff matchups from last fall will be revived this weekend. If we've gotten line matchups or individual player matchups from the coaches, then I focus on the task at hand. The rest will feature game after game of hotly contested matchups with nightly playoff implications during the final two-dozen games or so. The teams with the most favorable player matchups will be the teams holding trumps in the final three weeks. The matchups create great individual contests that help determine the outcome of the team game. We'll have in-depth scouting reports on each team minutes after the bracket is announced, and we cover the tournament with matchups for all 64 games. However, in each of the postseason matchups, his team rallied from behind to win, the exact opposite of their playoff predecessors. After you've spent a few minutes savoring another strong week for your squad, it's important to look at your players' matchups for the next week. This is basically an even matchup, a toe-to-toe slugfest of a heavyweight championship battle in the making. Synonymscorrespond, be in agreement, tally, agree, match up, coincide, accord, conform, square, harmonize, be consonant, be compatible1.1BasketballA man-to-man defense.See man to man at man Example sentencesExamples The man to man matchup is basketball in its purest form.  match up toSee match1match1 noun matʃmætʃ1A contest in which people or teams compete against each other in a particular sport. a boxing match Example sentencesExamples And, no matter what the sport, we all know that over a five match series the better team will wi", "n. The World Cup final is a match that touches almost every country in some way. There can't be many stadiums full to the rafters every week even though their team has lost six matches in a row. The players will be split into four teams for matches. There is no place in this distinctive genre for the football team, the cricket match or the game of bowls. Such was their dominance over the visitors, had it been a boxing match, the referee would have stopped the contest in the first half. He came back for four matches in the final games of the season and just squeezed in enough games to qualify for a title medal. The clubs have started a mutual war of nerves, accusing each other of fixing matches and corrupting referees. It is becoming increasingly frustrating to witness teams forfeiting matches for one reason or the other. Few can have sympathy for a team who starts a match as if they are already one up. The winners of their respective matches will contest the final, while the losers will play off for the bronze medal. Because the kick-off of the game was delayed it was too dark to play extra time and the match is to be replayed. I have seen teams win gruelling matches through good goal kicking. Each team will play five matches from tomorrow until Monday with the final scheduled for next Tuesday. Another worrying factor is the appointment of referees to officiate in matches involving teams from their own backyards. We entertained ourselves with a talent show, boxing matches and tug-of-war duels. All games were keenly contested and several matches were decided on tiebreakers. He said the team was playing training matches with local clubs to help it tune up for the tournament. We had worked so hard on team matches and winning really made us feel that the hard work paid off. I had sensed some nerves in the camp before the game, our first match in competition in two years. Synonymscontest, competition, game, tournament, tie, cup tie, event, fixture, trial, test, test match, meet, bout, fight, duelquarter-final, semi-final, final, Cup Finalfriendly, derby, local derbyplay-off, replay, rematchBritish clashCanadian &amp;amp Scottish playdownNorth American splitinformal, dated millarchaic tourney2A person or thing that is equal to another in quality or strength. they were no match for the mercenaries Example sentencesExamples However, the lack of experience was no match for the exuberance of youth. Special care may have to be taken to ensure that he enjoys the company of his classmates, who are likely to be no match for him. She knew she was no match for his strength. The poorly-armed soldiers prove to be no match for the battle mad Vikings. In recent decades his waning strength proved no match for the ravages of well intentioned but overbearing regulations. It is cheap and strangely enjoyable, but no match for a genuine blockbuster. I resisted as best I could, but I was no match for the three of them, who dragged me to the water and threw me into the surf. She is no match for her husband either in stature or in qualities and accepts her lot with resignatio", "n. The cold was no match for these paragons of athletic prowess and goodwill. In the end, truth is no match for economics and a misguided vision of self-preservatio", "n. These vexed machines with their built in obsolescence are no match for me. Corporate greed and power are eventually no match for this woman's determination to set things right. Intelligence and honesty are sometimes no match for comfortable habits of thought. The satyr, drunken as he is, is no match for the heavyweight nymphs. The giant tried to stop him at first, but his size and strength were no match for William's. Despite some very good performances, they were no match for the strength of the local side. I feared for a dog that would be no match for the thuggish birds. Our fast feet are no match for opponents on longboards, who tag us almost immediately. The pen may be mightier than the sword - but it's no match for a boxer's fist. Seeing she was no match for the animal in this grapple, the mother extended her hand into the bear's mouth. Synonymsequal, rival, equivalent, peer, counterpartrare compeer3A person or thing that resembles or corresponds to another. the child's identical twin would be a perfect match for organ donation Example sentencesExamples The cold gelato scoop on top was a perfect match as it melted onto its dark chocolately pedestal. The orange warms up from the hot caramel sauce, and it's tanginess is a perfect match for the sweetness of the sauce. At the lowest end there are some excellent everyday wines while at the top end quality matches price. You spot the ideal pair of trousers on the hanger; they are the perfect match for your snazzy little jacket and top. Dozens turned up for blood tests, but they will have to wait until next month to find out if any are a perfect match. He heard nothing for a decade until a letter asked him to save the life of a patient who was a perfect match and needed the transplant within days. The little girl has a rare tissue type with an estimated one in 90,000 chance of finding a perfect match. It was a perfect match between the wish of people to own their own homes and a public which needed somewhere to put its savings. The vaccine will almost certainly protect very well, but it's not the perfect match. A kidney patient has been given a new lease of life after enduring a 20-year wait for a perfect organ match. I've always added lemon rind to my butter - this gives it a really fresh zingy taste which is a perfect match for the mussels. Instead, they could have their own tissue cloned to produce a perfect match. The sweet onions were a perfect match for the thyme and the other ingredients. And one day that person waiting for an organ match could be themselves or someone very dear to them. The two had been courting for quite some time and knew that their relative strengths were a good match. Medical opinion holds that if the patient's body doesn't reject the bone marrow within five years, it is a perfect match. The match was far from perfect, and doctors were not optimistic about the chances of a successful transplant. The bitter taste of the chocolate combined with sweet and refreshing fruit is a perfect match. Here, her activity is more personal and it is the perfect match for the way in which her husband chooses to depict her. Their pungent, peppery taste is ", "also the perfect match for mild-tasting ingredients such as avocados. Synonymsreplica, copy, lookalike, double, twin, duplicate, equivalent, facsimile, likemate, fellow, companion, counterpart, pair, complementinformal spitting image, spit and image, spit, dead spit, ringer, dead ringer3.1ComputingA string that fulfils the specified conditions of a computer search. when the software finds a match, it writes the correct character Example sentencesExamples When it finds a match, the database sends back the text message, identifying the song. Intelligence officers then search for a match on the internal database. Have you ever done a search and seen that there were a million matches for your search terms? A search engine company's goal is to provide the end user with the best, most relevant matches to a search inquiry. Aaron ran a search on the government database for any matches to her picture, but none came.3.2 A similar or complementary pair. the headdresses and bouquet were a perfect match3.3 The fact or appearance of corresponding. stones of a perfect match and colour4A person viewed in regard to their eligibility for marriage, especially as regards class or wealth. he was an unsuitable match for any of their girls Example sentencesExamples She had always encouraged the infatuation, saying that the pair were a perfect match. Marriages usually result from family introductions, if not outright matches. These rituals would often lead to matches and marriages, either immediately in the coming summer or autum", "n. Many matches and marriages came out of working in the factory. Synonymsprospective husband/wife, prospect, candidateinformal catch4.1 A marriage. a dynastic match Example sentencesExamples He took her by storm and the match was the marriage of the year, that Hollywood would only experience in that time. Synonymsmarriage, betrothal, relationship, partnership, union, pairing, alliance, compact, contract, affiliation, combinationverb matʃmætʃ1Correspond or cause to correspond in some essential respect; make or be harmonious.with object I thought we'd have primrose walls to match the bathno object the jacket and trousers do not match Example sentencesExamples One is that it could provide sick people with matching organs or tissues. In short, the stock is creating its own filler, and the resulting color matches perfectly. They were not the usual fluff that is true for anyone but closely matched his personal life. The honeyed brown of the truck matched her skin tone perfectly, and it was leathery soft. These statements, as it happens, match observed facts at the scene of the killing. The speech pattern, which mimics the sound of his playing, has a distinctive modular tone that matches the rhythm. And if you're going to go blonde try to make sure it matches your skin tone. Nothing matches, and the colours are sharp enough to pierce your retina. Choose a color or pattern that either matches or complements your suit. We'll read a few of them next week and see if what you wrote matches what, in fact, he said. The woman was brunette and had a plum evening gown on with matching make-up and a coordinating flower and feather in a bun on the base of her neck. My eyes looked flat, dead, though I was crying, and my tone matched my eyes. As long as it matches your personal style and the rest of your outfit, you'll look great. Now people have matching furniture, and kitchen gadgets, and pictures on the walls. I'm very proud; the ambery colour I picked matches just right the base I already had. The failure of both sides of his face to act in unison shows that his real feelings don't match up with the image he is putting across to the public. The synthetic skin didn't quite match his normal skin tone but that was the only indication that it was artificial. Foundation should match your skin tone as closely as possible; powder should match your foundatio", "n. In other words, match the tanner shade to your skin tone rather than the colour you would like to be. At least, she can wear matching pyjamas to blend in with their colours. Synonymsgo with, coordinate with, complement, harmonize with, blend with, tone with, team with, be the same as, be similar to, suitbe a pair, be a set, be the same, go togethercorrespond, be in agreement, tally, agree, match up, coincide, accord, conform, square, harmonize, be consonant, be compatiblecorresponding, equivalent, parallel, analogous, coordinating, complementing, complementary, harmonizing, blending, toning, harmonious, the same, paired, twin, coupled, double, duplicate, identical, (all) of a piece, like, like (two) peas in a pod, alike, comparable, similar, correlative, congruent, tallying, agreeing, concordant, consonant1.1with object Put (someone or something) together with someone or something else appropriate or harmonious. she was trying to match the draperies to the couch Example sentencesExamples We put together an unprecedented ground operation, but it was matched by the zealots on the right. How do you go about matching the appropriate celebrity with the clients? Are there people you want to read solo whom you'd like less if they were matched up with some appropriate co-bloggers? She had a gift for getting people to work together and she could always match the right person to the right job. There was no outright winner but 12 people matched three numbers. The biggest problem was matching cars with people, most of whom wanted one-way rentals out of airports. Each rider is matched with a horse of the appropriate weight and height, but they are all at ease with teaching people who have never ridden before. Our role is to place them in the most appropriate position, matching the candidate's skills to those required by the client. Here, the game of matching his name to the appropriate subject can be astonishingly easy. Pin two sections together, matching the squares; stitch between the squares. Use wire nuts to fasten the two ends together, matching the color-coded wires. Tape the two vinyl sections firmly together after they are matched so they won't move when you cut them. When pieces are stolen and smuggled out, sometimes blocks of fossils are matched together mistakenly. They simply seem like two oddly matched adults, thrown together. My answers were matched with those of people who were happy and successful in certain jobs. Synonymscombine, match up, link, bring/put together, unite, marry, pair up, yoke, team, couple, pair, allyformal conjoin2with object Be equal to (something) in quality or strength. his anger matched her own Example sentencesExamples But then his intellectual brilliance is matched by his enigmatic personality - you can't be sure what he's really up to. The quality of the hot dog is matched by the quality of the toppings. The power of the press to cause panic was matched by their equal power to quell the imbalance they had caused. The whiskey beat his expectations but didn't match his own collectio", "n. Often they don't bother to announce rises at all, and when they do the result rarely matches the hike to the base rate the Bank of England has announced. Her beautiful looks and elegant acting were matched by rich tone, expressiveness, and virtuoso technique, which can be heard in her recordings. McCarthy's perceived influence among his peers is matched by his personal popularity. So, in many ways, the results didn't match the symbolism that he obviously enjoyed. Sadly this tough talk is not matched by results. Their skills increased as they trained and soon Raymond's people matched warriors of the other village. The selfishness of fame seekers is only matched by the personal cost they have to pay for the fame they seek. For six weeks, the results on the field matched the hype off it. I tried a couple of shots to see if I could record what I saw today but the results didn't match my visio", "n. His continually moronic, arrogant behaviour has meant that his results have never matched the drivel that comes out of his mouth. Can't we pick people with a keener sense of how their strengths match the demands of the role? The allure of the strapline was usually matched by the quality of the content. It should be as light and as strong as possible, and its size should match your body and strength. They found that the couples whose expectations matched their relationship skills were most satisfied. This sensitivity about representing race is not matched by an equal sensitivity about representing class. He would have brushed me off, made me answer for my tone - but not argued with me, not matched me shout for shout. Synonymsequal, be equal to, be the equal of, be a match for, measure up to, compare with, parallel, be in the same league as, be in the same category as, be on a par with, touch, keep pace with, keep up with, emulate, rival, vie with, compete with, contend withinformal hold a candle to2.1 Succeed in reaching or equalling (a standard or quality) he tried to match her nonchalance Example sentencesExamples Two years ago more than 124,000 people attended this event, but they knew those figures couldn't be matched this time. Schools in the area have once again performed well, with most at least matching the national average pass rate. There's a uniformly high standard set that is matched, then raised by every participant. Schools in the district have chalked up outstanding performances, with most of them at least matching the national average pass rate. New York City matched an 1893 degree record low for the day at one degree, according to the National Weather Service. One survey suggests that if British enterprise levels matched those in the United States an extra 250,000 businesses would be created. Thirty scores dotted the game, almost matching a modest foul count of 34. The next event was his best, the high jump, in which he matched his personal best, jumping clear of the field and moving into fourth. Some of the dioramas were repainted up to six times until they matched his exacting standards. Synonymscome up to, measure up to, meet with, be equal to, be as good as, satisfy, fulfil, answer to2.2 Equalize (two coupled electrical impedances) so as to bring about the maximum transfer of power from one to the other. the impedance of microphones, auxiliary equipment, and loudspeakers must be matched Example sentencesExamples If the load impedance perfectly matches the transmission line impedance, the reflected power is zero. An impedance matching circuit is provided for each signal-carrying wire pair of the first and second wire pair sets. New features include a 1.8V matched impedance interface, known as stub series terminated logic. Care should be taken in impedance matching between the elements of the user's GPS system.3with object Place (a person or group) in competition with another. the big names were matched against nobodies Example sentencesExamples An indication as to how evenly matched these two teams were is evidenced in the fact that both teams only registered one point each in the opening quarter. This was a lively game of football with two evenly matched teams who played some good football in slippery conditions. I will stare down the pack of cigarettes, matching wits and strength against tobacco. We are evenly matched so we have to hope we want it more on the night. He can be effective in the slot when he's matched against nickel cornerbacks who can't get their hands on him. The teams were evenly matched and shared the lead throughout the match. Both teams came with the spirit of competition and were evenly matched with the skills displayed by all participants. This was an exciting game between two evenly matched teams. The two teams were evenly matched trading points early o", "n. He was even matched against - and beat - the toughest cage fighters in the world in America. The two teams are evenly matched in this series, and what will separate them is strategy. It was a titanic struggle between two evenly matched teams. Having drawn the first game it took extra time in this replay to separate what were two evenly matched teams. No good or exciting game can be played without the participation of two good evenly matched teams. The two periods of extra time ", "also failed to separate these two evenly matched teams but one wonders how. In games like this where the stakes are so high, I think when the teams are evenly matched it can go either way. While on the field of play both teams were evenly matched. Two very evenly matched teams traded score for score in the third quarter. The teams are evenly matched as they have split their games so far this year. From the very beginning, the teams were evenly matched. Synonymsdraw against, set against, pit against, play off againstPhrasesmake a matchGet married. Harry and the Harvey girl were going to make a match of it Example sentencesExamples Both in the movies and in life, Tracy thought he and Hepburn were far too different to make a match; she thought they were much too alike. A Boston matron he met during his trip north tried to persuade him to remain in that city in the hopes of making a match for a marriageable daughter. Surely this is now her only chance of making a match, for any respectable gentleman is bound to be dissuaded from asking for her hand. However, the very next day she was besieged with complaints from her disappointed newlyweds, and conceded the great wisdom needed for making a match that leads to a happy marriage. Her plan is to send Tess to get the woman to take her in and make a match for her with a wealthy man so that the family will be set for life. Apparently they were planning to make a match for me. Matrimonials on the Net may have a long way to go before they start rivalling the conventional ways of making a match, but web companies are really striving hard to realise the latent potential of this medium.meet one's matchEncounter one's equal in strength or ability. Iris had met her match Example sentencesExamples It's ", "also reassuring to have finally met my match in ineptness. I imagine they have made some bawdy bravado remark about wanting to see someone's helmet, and have met their match. Professional eater that I am, I confess I met my match - even with the help of the women at the table taking their nibbling bites, I couldn't finish the dessert. But Edinburgh's dreaded parking attendants have finally met their match in the shape of the doughty Balmoral Hotel. In some of the most humble people in the world, the would-be makers of the economic commandments may well have met their match. But at last our cold weather adventurer had met his match. It is where some of Australia's great outback legends were created, and where some met their match. I want to congratulate you on being a great interviewer, but I think you've met your match. And in the case of Saturday night's incident, the attacker nearly met his match. However, on Wednesday they met their match even before stepping onto the cricket pitch.to matchCorresponding in some essential respect with something previously mentioned or chose", "n. a new coat and a hat to match Example sentencesExamples For millions of years it has led an unglamorous life with an unfortunate name to match. He has always been a charismatic lead singer and he certainly has the stamina to match. So now we've just got the sideboard still to get, and possibly a new dining room table to match. Having bundles of money and a lifestyle to match is little more than a dream to most folk. Never any trouble to look after, he was a great little pet with a personality to match. The commercial offerings are very impressive, but tend to have a price tag to match. We have a Premier League set-up in terms of facilities and we have ambitions to match.Phrasal Verbsmatch up toBe as good as or equal to. she matches up to the challenges of the job Example sentencesExamples No guy I've ever met has matched up to him and I doubt any guy ever will. As far as pace is concerned, I don't think I have seen a single team that could match up to what we're doing. As the guidelines have recently changed we need to make sure that our operation matches up to what is expected. And one way to make us feel that we are lacking is by showing us images of people the majority of us do not match up to. Neil's job aspirations have not matched up to what was expected. The statistics of most of the old-timers don't match up to what guys are doing today. Sums given for flood relief have not matched up to even half of the needs of those left homeless, at risk, and without an income. So it seemed that, for me, anyway, poems were going to happen rarely if they were going to match up to what I would wish them to be. But how could anything match up to what are quite frankly the most enjoyable gigs we've ever been to? You have to go through so many filters, answer to the critics, match up to the last decent work.match someone withBring about the marriage of someone to. try if you can to match her with a duke Example sentencesExamples She wants to match Harriet with Mr. Elton, and when Harriet compliments him, Emma's plan is set in motio", "n. You should consider yourself lucky that you have been matched with a young noble at all. She arrives with strong opinions about politics and her social obligations that clash with her father's conservatism, and she has no patience with the upper-class twit her parents try to match her with. John tells Elinor that they are thinking of matching Miss Morton with Robert, now that Edward is marrying Lucy. After the death of her father-in-law and unsuccessful attempts at matching Mr. Tweedie with her daughters, Mrs. Lapham marries him herself, mainly to keep the silver shop in the family.DerivativesmatchableadjectiveAny matchable tile to the skeleton layout must be played to it and no holdbacks are allowed for any player. Example sentencesExamples And by the way, most of that is matchable because of the matching funds. It's only very recently that Registered births and deaths have been computerised and matchable. For presidential candidates accepting matching funds, a money order is considered to be a matchable contributio", "n. Zoom forward to today, and there is nothing at all that is of matchable relevance.OriginOld English gemæcca 'mate, companion', of West Germanic origin; related to the base of make.Match in the sense ‘be the same as’ comes from an Old English word meaning ‘mate, companion’ which probably goes back to the same root as Old English make. Use of the word to mean ‘contest, competitive trial’ dates from the early 16th century. The match associated with fire was first used to mean ‘candle wick’. It is from Old French meche, perhaps from Latin myxa meaning ‘spout of a lamp, lamp wick’. The wooden match we are familiar with today dates from the early 19th century.VideoRhymesattach, batch, catch, crosshatch, detach, hatch, latch, mismatch, natch, outmatch, patch, scratch, thatch match2noun matʃmætʃ1A short, thin piece of wood or cardboard used to light a fire, being tipped with a composition that ignites when rubbed against a rough surface. he struck a match against the wall Example sentencesExamples It was sort of cool that night so I went up into the house, struck a match and lit the heater. I struck a match and lit a candle and put it in the green glass dish and I went into the kitche", "n. She positioned some sticks, and lit a fire with matches in her pocket, and sat down to warm up. He tried to light up his matches to put his shoes on fire and explode. Nama struck a match and its head went into flames, then she took it and lit a small lantern in the middle of the room. It was he who struck a match and carried out the dramatic unmasking of the villai", "n. Take great care not to light fires, or even to discard matches or cigarette ends in areas where there is a danger of fire spreading. After counting them, and returning the bag, he found a match and lit a small fire. He poured some of the gas on the trash, struck a match, and soon the fire roared. They have to catch and prepare their own food, light a fire without matches and build a shelter. He lit a match and warmed the foil until the powder liquified. He took part in training sessions and even played for short periods in some matches. After several attempts and most of the matches, she lit a small fire. She struck a match on the rough side of the box, and quickly threw the burning stick onto the first bush. He threw petrol in my car as I was sitting in it and he struck a match and threw it at the car. I got up, and while doing so struck a match to ignite the overhead oxyge", "n. He struck a match and turned on the gas fire stove, placing a greased pan on the fire. He struck a match and the objects on the mantelpiece threw brief shadows on the wall. Little kids like myself were handed matches and told to light the candles. Then he lit a match, and began igniting the shreds in the cup as he breathed in through the tube.1.1historicalA piece of wick or cord designed to burn at a uniform rate, used for firing a cannon or lighting gunpowder.Phrasesput a match toSet fire to. Example sentencesExamples Even if we had to put a match to what is left, and I sincerely hope we don't, we would still count it as a success. It was the first thing he'd done when he got back from the hospital-sweep everything even vaguely illegal into a bag and then put a match to it. He put a match to an ancient smoke flare, which he'd brought to signal our success to friends below, and held it aloft. It cannot be true for you that petrol burns and not true for me, since what happens when I put a match to petrol is just what happens if you do. Inside, he puts a match to the carefully laid wood of an open fire, the smoke billowing back immediately into the room. A Canadian based in London with a background in classical piano and advanced mathematics, he has taken the rulebook and put a match to it. The summer had been hot and the scrub was tinder dry, so it took little effort to put a match to but needed careful watching.OriginLate Middle English (in the sense 'wick of a candle'): from Old French meche, perhaps from Latin myxa 'spout of a lamp', later 'lamp wick'.nou", "n.1 phr. phr.", "v. nou", "n.2 phr.match1 nounmætʃmaCH1A contest in which people or teams compete against each other in a particular sport. a boxing match Example sentencesExamples Because the kick-off of the game was delayed it was too dark to play extra time and the match is to be replayed. The World Cup final is a match that touches almost every country in some way. I have seen teams win gruelling matches through good goal kicking. Few can have sympathy for a team who starts a match as if they are already one up. Each team will play five matches from tomorrow until Monday with the final scheduled for next Tuesday. We entertained ourselves with a talent show, boxing matches and tug-of-war duels. All games were keenly contested and several matches were decided on tiebreakers. It is becoming increasingly frustrating to witness teams forfeiting matches for one reason or the other. The winners of their respective matches will contest the final, while the losers will play off for the bronze medal. The players will be split into four teams for matches. He said the team was playing training matches with local clubs to help it tune up for the tournament. There can't be many stadiums full to the rafters every week even though their team has lost six matches in a row. I had sensed some nerves in the camp before the game, our first match in competition in two years. And, no matter what the sport, we all know that over a five match series the better team will wi", "n. The clubs have started a mutual war of nerves, accusing each other of fixing matches and corrupting referees. There is no place in this distinctive genre for the football team, the cricket match or the game of bowls. Such was their dominance over the visitors, had it been a boxing match, the referee would have stopped the contest in the first half. Another worrying factor is the appointment of referees to officiate in matches involving teams from their own backyards. We had worked so hard on team matches and winning really made us feel that the hard work paid off. He came back for four matches in the final games of the season and just squeezed in enough games to qualify for a title medal. Synonymscontest, competition, game, tournament, tie, cup tie, event, fixture, trial, test, test match, meet, bout, fight, duel2A person or thing able to contend with another as an equal in quality or strength. they were no match for the trained mercenaries Example sentencesExamples I feared for a dog that would be no match for the thuggish birds. The giant tried to stop him at first, but his size and strength were no match for William's. Despite some very good performances, they were no match for the strength of the local side. She knew she was no match for his strength. The poorly-armed soldiers prove to be no match for the battle mad Vikings. In the end, truth is no match for economics and a misguided vision of self-preservatio", "n. Corporate greed and power are eventually no match for this woman's determination to set things right. Special care may have to be taken to ensure that he enjoys the company of his classmates, who are likely to be no match for him. Seeing she was no match for the animal in this grapple, the mother extended her hand into the bear's mouth. However, the lack of experience was no match for the exuberance of youth. The satyr, drunken as he is, is no match for the heavyweight nymphs. The cold was no match for these paragons of athletic prowess and goodwill. It is cheap and strangely enjoyable, but no match for a genuine blockbuster. These vexed machines with their built in obsolescence are no match for me. The pen may be mightier than the sword - but it's no match for a boxer's fist. She is no match for her husband either in stature or in qualities and accepts her lot with resignatio", "n. Intelligence and honesty are sometimes no match for comfortable habits of thought. Our fast feet are no match for opponents on longboards, who tag us almost immediately. In recent decades his waning strength proved no match for the ravages of well intentioned but overbearing regulations. I resisted as best I could, but I was no match for the three of them, who dragged me to the water and threw me into the surf. Synonymsequal, rival, equivalent, peer, counterpart3A person or thing that resembles or corresponds to another. the child's identical twin would be a perfect match for organ donation Example sentencesExamples The orange warms up from the hot caramel sauce, and it's tanginess is a perfect match for the sweetness of the sauce. It was a perfect match between the wish of people to own their own homes and a public which needed somewhere to put its savings. Instead, they could have their own tissue cloned to produce a perfect match. Medical opinion holds that if the patient's body doesn't reject the bone marrow within five years, it is a perfect match. And one day that person waiting for an organ match could be themselves or someone very dear to them. I've always added lemon rind to my butter - this gives it a really fresh zingy taste which is a perfect match for the mussels. The match was far from perfect, and doctors were not optimistic about the chances of a successful transplant. The sweet onions were a perfect match for the thyme and the other ingredients. The two had been courting for quite some time and knew that their relative strengths were a good match. The little girl has a rare tissue type with an estimated one in 90,000 chance of finding a perfect match. The cold gelato scoop on top was a perfect match as it melted onto its dark chocolately pedestal. He heard nothing for a decade until a letter asked him to save the life of a patient who was a perfect match and needed the transplant within days. Their pungent, peppery taste is ", "also the perfect match for mild-tasting ingredients such as avocados. The bitter taste of the chocolate combined with sweet and refreshing fruit is a perfect match. At the lowest end there are some excellent everyday wines while at the top end quality matches price. The vaccine will almost certainly protect very well, but it's not the perfect match. A kidney patient has been given a new lease of life after enduring a 20-year wait for a perfect organ match. You spot the ideal pair of trousers on the hanger; they are the perfect match for your snazzy little jacket and top. Dozens turned up for blood tests, but they will have to wait until next month to find out if any are a perfect match. Here, her activity is more personal and it is the perfect match for the way in which her husband chooses to depict her. Synonymsreplica, copy, lookalike, double, twin, duplicate, equivalent, facsimile, like3.1ComputingA string that fulfills the specified conditions of a computer search. Example sentencesExamples When it finds a match, the database sends back the text message, identifying the song. Aaron ran a search on the government database for any matches to her picture, but none came. A search engine company's goal is to provide the end user with the best, most relevant matches to a search inquiry. Intelligence officers then search for a match on the internal database. Have you ever done a search and seen that there were a million matches for your search terms?3.2 A pair that corresponds or is very similar. the headdresses and bouquet were a perfect match3.3 The fact or appearance of corresponding. stones of a perfect match and color4A person viewed in regard to their eligibility for marriage, especially as regards class or wealth. he was an unsuitable match for any of their girls Example sentencesExamples Marriages usually result from family introductions, if not outright matches. These rituals would often lead to matches and marriages, either immediately in the coming summer or autum", "n. Many matches and marriages came out of working in the factory. She had always encouraged the infatuation, saying that the pair were a perfect match. Synonymsprospective husband, prospective wife, prospect, candidate4.1 A marriage. a dynastic match Example sentencesExamples He took her by storm and the match was the marriage of the year, that Hollywood would only experience in that time. Synonymsmarriage, betrothal, relationship, partnership, union, pairing, alliance, compact, contract, affiliation, combinationverbmætʃmaCH[with object]1Correspond or cause to correspond in some essential respect; make or be harmonious.no object the jacket and pants do not matchwith object we bought green and blue curtains to match the bedspread she matched her steps to his Example sentencesExamples The failure of both sides of his face to act in unison shows that his real feelings don't match up with the image he is putting across to the public. Now people have matching furniture, and kitchen gadgets, and pictures on the walls. Foundation should match your skin tone as closely as possible; powder should match your foundatio", "n. One is that it could provide sick people with matching organs or tissues. We'll read a few of them next week and see if what you wrote matches what, in fact, he said. I'm very proud; the ambery colour I picked matches just right the base I already had. The synthetic skin didn't quite match his normal skin tone but that was the only indication that it was artificial. The woman was brunette and had a plum evening gown on with matching make-up and a coordinating flower and feather in a bun on the base of her neck. In short, the stock is creating its own filler, and the resulting color matches perfectly. At least, she can wear matching pyjamas to blend in with their colours. And if you're going to go blonde try to make sure it matches your skin tone. My eyes looked flat, dead, though I was crying, and my tone matched my eyes. As long as it matches your personal style and the rest of your outfit, you'll look great. The honeyed brown of the truck matched her skin tone perfectly, and it was leathery soft. Choose a color or pattern that either matches or complements your suit. These statements, as it happens, match observed facts at the scene of the killing. They were not the usual fluff that is true for anyone but closely matched his personal life. In other words, match the tanner shade to your skin tone rather than the colour you would like to be. The speech pattern, which mimics the sound of his playing, has a distinctive modular tone that matches the rhythm. Nothing matches, and the colours are sharp enough to pierce your retina. Synonymscorresponding, equivalent, parallel, analogous, coordinating, complementing, complementary, harmonizing, blending, toning, harmonious, the same, paired, twin, coupled, double, duplicate, identical, of a piece, all of a piece, like, like peas in a pod, like two peas in a pod, alike, comparable, similar, correlative, congruent, tallying, agreeing, concordant, consonantgo with, coordinate with, complement, harmonize with, blend with, tone with, team with, be the same as, be similar to, suitbe a pair, be a set, be the same, go togethercorrespond, be in agreement, tally, agree, match up, coincide, accord, conform, square, harmonize, be consonant, be compatible1.1 Team (someone or something) with someone or something else appropriate or harmonious. she was trying to match the draperies to the couch they matched suitably qualified applicants with institutions that had vacancies Example sentencesExamples Pin two sections together, matching the squares; stitch between the squares. She had a gift for getting people to work together and she could always match the right person to the right job. Here, the game of matching his name to the appropriate subject can be astonishingly easy. They simply seem like two oddly matched adults, thrown together. Our role is to place them in the most appropriate position, matching the candidate's skills to those required by the client. The biggest problem was matching cars with people, most of whom wanted one-way rentals out of airports. We put together an unprecedented ground operation, but it was matched by the zealots on the right. Are there people you want to read solo whom you'd like less if they were matched up with some appropriate co-bloggers? My answers were matched with those of people who were happy and successful in certain jobs. There was no outright winner but 12 people matched three numbers. How do you go about matching the appropriate celebrity with the clients? When pieces are stolen and smuggled out, sometimes blocks of fossils are matched together mistakenly. Use wire nuts to fasten the two ends together, matching the color-coded wires. Tape the two vinyl sections firmly together after they are matched so they won't move when you cut them. Each rider is matched with a horse of the appropriate weight and height, but they are all at ease with teaching people who have never ridden before. Synonymscombine, match up, link, bring together, put together, unite, marry, pair up, yoke, team, couple, pair, ally2Be equal to (something) in quality or strength. his anger matched her own Example sentencesExamples The allure of the strapline was usually matched by the quality of the content. Often they don't bother to announce rises at all, and when they do the result rarely matches the hike to the base rate the Bank of England has announced. Sadly this tough talk is not matched by results. The selfishness of fame seekers is only matched by the personal cost they have to pay for the fame they seek. So, in many ways, the results didn't match the symbolism that he obviously enjoyed. McCarthy's perceived influence among his peers is matched by his personal popularity. Can't we pick people with a keener sense of how their strengths match the demands of the role? But then his intellectual brilliance is matched by his enigmatic personality - you can't be sure what he's really up to. I tried a couple of shots to see if I could record what I saw today but the results didn't match my visio", "n. Her beautiful looks and elegant acting were matched by rich tone, expressiveness, and virtuoso technique, which can be heard in her recordings. The power of the press to cause panic was matched by their equal power to quell the imbalance they had caused. It should be as light and as strong as possible, and its size should match your body and strength. The whiskey beat his expectations but didn't match his own collectio", "n. His continually moronic, arrogant behaviour has meant that his results have never matched the drivel that comes out of his mouth. For six weeks, the results on the field matched the hype off it. This sensitivity about representing race is not matched by an equal sensitivity about representing class. He would have brushed me off, made me answer for my tone - but not argued with me, not matched me shout for shout. They found that the couples whose expectations matched their relationship skills were most satisfied. The quality of the hot dog is matched by the quality of the toppings. Their skills increased as they trained and soon Raymond's people matched warriors of the other village. Synonymsequal, be equal to, be the equal of, be a match for, measure up to, compare with, parallel, be in the same league as, be in the same category as, be on a par with, touch, keep pace with, keep up with, emulate, rival, vie with, compete with, contend with2.1 Succeed in reaching or equaling (a standard or quality) he tried to match her nonchalance Example sentencesExamples Schools in the area have once again performed well, with most at least matching the national average pass rate. Schools in the district have chalked up outstanding performances, with most of them at least matching the national average pass rate. There's a uniformly high standard set that is matched, then raised by every participant. Some of the dioramas were repainted up to six times until they matched his exacting standards. New York City matched an 1893 degree record low for the day at one degree, according to the National Weather Service. One survey suggests that if British enterprise levels matched those in the United States an extra 250,000 businesses would be created. Thirty scores dotted the game, almost matching a modest foul count of 34. The next event was his best, the high jump, in which he matched his personal best, jumping clear of the field and moving into fourth. Two years ago more than 124,000 people attended this event, but they knew those figures couldn't be matched this time. Synonymscome up to, measure up to, meet with, be equal to, be as good as, satisfy, fulfil, answer to2.2 Equalize (two coupled electrical impedances) so as to bring about the maximum transfer of power from one to the other. Example sentencesExamples Care should be taken in impedance matching between the elements of the user's GPS system. New features include a 1.8V matched impedance interface, known as stub series terminated logic. An impedance matching circuit is provided for each signal-carrying wire pair of the first and second wire pair sets. If the load impedance perfectly matches the transmission line impedance, the reflected power is zero.3Place (a person or group) in contest or competition with another. the big names were matched against nobodies Example sentencesExamples The two teams are evenly matched in this series, and what will separate them is strategy. An indication as to how evenly matched these two teams were is evidenced in the fact that both teams only registered one point each in the opening quarter. Having drawn the first game it took extra time in this replay to separate what were two evenly matched teams. No good or exciting game can be played without the participation of two good evenly matched teams. The two teams were evenly matched trading points early o", "n. This was an exciting game between two evenly matched teams. Two very evenly matched teams traded score for score in the third quarter. Both teams came with the spirit of competition and were evenly matched with the skills displayed by all participants. The teams were evenly matched and shared the lead throughout the match. The two periods of extra time ", "also failed to separate these two evenly matched teams but one wonders how. This was a lively game of football with two evenly matched teams who played some good football in slippery conditions. He was even matched against - and beat - the toughest cage fighters in the world in America. It was a titanic struggle between two evenly matched teams. While on the field of play both teams were evenly matched. The teams are evenly matched as they have split their games so far this year. We are evenly matched so we have to hope we want it more on the night. In games like this where the stakes are so high, I think when the teams are evenly matched it can go either way. From the very beginning, the teams were evenly matched. I will stare down the pack of cigarettes, matching wits and strength against tobacco. He can be effective in the slot when he's matched against nickel cornerbacks who can't get their hands on him. Synonymsdraw against, set against, pit against, play off againstPhrasesmake a matchForm a partnership, especially by getting married. Example sentencesExamples A Boston matron he met during his trip north tried to persuade him to remain in that city in the hopes of making a match for a marriageable daughter. However, the very next day she was besieged with complaints from her disappointed newlyweds, and conceded the great wisdom needed for making a match that leads to a happy marriage. Matrimonials on the Net may have a long way to go before they start rivalling the conventional ways of making a match, but web companies are really striving hard to realise the latent potential of this medium. Surely this is now her only chance of making a match, for any respectable gentleman is bound to be dissuaded from asking for her hand. Her plan is to send Tess to get the woman to take her in and make a match for her with a wealthy man so that the family will be set for life. Both in the movies and in life, Tracy thought he and Hepburn were far too different to make a match; she thought they were much too alike. Apparently they were planning to make a match for me.meet one's matchEncounter one's equal in strength or ability. Iris had met her match Example sentencesExamples But Edinburgh's dreaded parking attendants have finally met their match in the shape of the doughty Balmoral Hotel. And in the case of Saturday night's incident, the attacker nearly met his match. However, on Wednesday they met their match even before stepping onto the cricket pitch. It is where some of Australia's great outback legends were created, and where some met their match. Professional eater that I am, I confess I met my match - even with the help of the women at the table taking their nibbling bites, I couldn't finish the dessert. It's ", "also reassuring to have finally met my match in ineptness. I imagine they have made some bawdy bravado remark about wanting to see someone's helmet, and have met their match. But at last our cold weather adventurer had met his match. In some of the most humble people in the world, the would-be makers of the economic commandments may well have met their match. I want to congratulate you on being a great interviewer, but I think you've met your match.to matchCorresponding in some essential respect with something previously mentioned or chose", "n. a new coat and a hat to match Example sentencesExamples The commercial offerings are very impressive, but tend to have a price tag to match. Never any trouble to look after, he was a great little pet with a personality to match. So now we've just got the sideboard still to get, and possibly a new dining room table to match. We have a Premier League set-up in terms of facilities and we have ambitions to match. Having bundles of money and a lifestyle to match is little more than a dream to most folk. For millions of years it has led an unglamorous life with an unfortunate name to match. He has always been a charismatic lead singer and he certainly has the stamina to match.Phrasal Verbsmatch up toBe as good as or equal to. she matches up to the challenges of the job Example sentencesExamples Neil's job aspirations have not matched up to what was expected. As the guidelines have recently changed we need to make sure that our operation matches up to what is expected. You have to go through so many filters, answer to the critics, match up to the last decent work. No guy I've ever met has matched up to him and I doubt any guy ever will. So it seemed that, for me, anyway, poems were going to happen rarely if they were going to match up to what I would wish them to be. But how could anything match up to what are quite frankly the most enjoyable gigs we've ever been to? As far as pace is concerned, I don't think I have seen a single team that could match up to what we're doing. Sums given for flood relief have not matched up to even half of the needs of those left homeless, at risk, and without an income. And one way to make us feel that we are lacking is by showing us images of people the majority of us do not match up to. The statistics of most of the old-timers don't match up to what guys are doing today.match someone withBring about the marriage of someone to. try if you can to match her with a duke Example sentencesExamples You should consider yourself lucky that you have been matched with a young noble at all. She arrives with strong opinions about politics and her social obligations that clash with her father's conservatism, and she has no patience with the upper-class twit her parents try to match her with. She wants to match Harriet with Mr. Elton, and when Harriet compliments him, Emma's plan is set in motio", "n. John tells Elinor that they are thinking of matching Miss Morton with Robert, now that Edward is marrying Lucy. After the death of her father-in-law and unsuccessful attempts at matching Mr. Tweedie with her daughters, Mrs. Lapham marries him herself, mainly to keep the silver shop in the family.OriginOld English gemæcca ‘mate, companion’, of West Germanic origin; related to the base of make. match2nounmætʃmaCH1A short, thin piece of wood or cardboard used to light a fire, being tipped with a composition that ignites when rubbed against a rough surface. he struck a match against the wall Example sentencesExamples He lit a match and warmed the foil until the powder liquified. He tried to light up his matches to put his shoes on fire and explode. She struck a match on the rough side of the box, and quickly threw the burning stick onto the first bush. He threw petrol in my car as I was sitting in it and he struck a match and threw it at the car. She positioned some sticks, and lit a fire with matches in her pocket, and sat down to warm up. I got up, and while doing so struck a match to ignite the overhead oxyge", "n. After several attempts and most of the matches, she lit a small fire. He took part in training sessions and even played for short periods in some matches. He struck a match and the objects on the mantelpiece threw brief shadows on the wall. It was sort of cool that night so I went up into the house, struck a match and lit the heater. He poured some of the gas on the trash, struck a match, and soon the fire roared. He struck a match and turned on the gas fire stove, placing a greased pan on the fire. Take great care not to light fires, or even to discard matches or cigarette ends in areas where there is a danger of fire spreading. Then he lit a match, and began igniting the shreds in the cup as he breathed in through the tube. Nama struck a match and its head went into flames, then she took it and lit a small lantern in the middle of the room. It was he who struck a match and carried out the dramatic unmasking of the villai", "n. Little kids like myself were handed matches and told to light the candles. I struck a match and lit a candle and put it in the green glass dish and I went into the kitche", "n. After counting them, and returning the bag, he found a match and lit a small fire. They have to catch and prepare their own food, light a fire without matches and build a shelter.1.1historicalA piece of wick or cord designed to burn at a uniform rate, used for firing a cannon or lighting gunpowder.Phrasesput a match toSet fire to. Example sentencesExamples Inside, he puts a match to the carefully laid wood of an open fire, the smoke billowing back immediately into the room. He put a match to an ancient smoke flare, which he'd brought to signal our success to friends below, and held it aloft. A Canadian based in London with a background in classical piano and advanced mathematics, he has taken the rulebook and put a match to it. Even if we had to put a match to what is left, and I sincerely hope we don't, we would still count it as a success. The summer had been hot and the scrub was tinder dry, so it took little effort to put a match to but needed careful watching. It cannot be true for you that petrol burns and not true for me, since what happens when I put a match to petrol is just what happens if you do. It was the first thing he'd done when he got back from the hospital-sweep everything even vaguely illegal into a bag and then put a match to it.OriginLate Middle English (in the sense ‘wick of a candle’): from Old French meche, perhaps from Latin myxa ‘spout of a lamp’, later ‘lamp wick’.nou", "n.1 phr. phr.", "v. nou", "n.2 phr."]}], "usphone": "", "ukphone": ""}