{"name": "mistake for", "trans": [{"dict": "Oxford5000", "values": ["mistake someone/something forSee mistakeDefinition of mistake in English: mistake noun mɪˈsteɪkməˈsteɪk1An act or judgement that is misguided or wrong. coming here was a mistake she made the mistake of thinking they were important Example sentencesExamples After a while I realized the fatal mistake I had made, but I didn't cry. As soon as he said this he realized his grave mistake and quickly looked away. He warned that they should not make the mistake of believing that they could shelve their responsibility. Sure, we made a few mistakes along the way, but everybody makes them. Because if you make decisions without proper precautions, you're bound to make costly mistakes in life. Historians sometimes make the mistake of thinking that early modern religious dissent argues secularizatio", "n. She makes the mistake of assuming that Americans can not stop eating when served a large portio", "n. The danger in Iraq is repeating the biggest mistake - yielding to gradualism. He performed well overall but did make the expected rookie mistakes now and the", "n. People with great SAT scores go on to make the same stupid mistakes in their lives that we all make. The simple truth is that terrible mistakes have been made. Avoid the common mistake of falling through the poles. Samples are named, numbered and color-coded to make sure mistakes don't happe", "n. She made the mistake of looking back at him, urging her to stay. You know, mistakes happen in journalism, as they happen in the military. We can't make the mistake of assuming that everything is within our grasp. To suggest that embodied chemical properties can solve systemic institutional problems is to commit a serious category mistake. Not making mistakes goes beyond turnovers, and the Colts simply made costly mistakes at the wrong times. It seems that South Africa is condemned to repeat fatal mistakes that should have been learned from the past. And it is only natural that we will make some mistakes along the way. Synonymserror, fault, inaccuracy, omission, slip, blunder, miscalculation, misunderstanding, flaw, oversight, misinterpretation, fallacy, gaffe, faux pas, solecism, misapprehension, misconception, misreadinginformal slip-up, boo-boo, howler, boner, failBritish informal boob, clangerNorth American informal goofBritish informal, dated bloomerrare misreckoning1.1 Something, especially a word, figure, or fact, which is not correct; an inaccuracy. a couple of spelling mistakes Example sentencesExamples At more relaxed times we correct the grammar mistakes of political speeches. I'll upload the photos and correct my spelling and grammar mistakes tomorrow. So what is proposed is that a spelling mistake is corrected. The retyping explains the spelling, and ", "also explains how a couple of spelling mistakes were introduced. It always helps to have someone point out where you've written gibberish and pluck out the spelling mistakes. And note that I corrected all the stupid spelling mistakes. It gave the readers a chance to correct mistakes and add informatio", "n. Feel free to let me know about all of my spelling and grammar mistakes below. In closing, please ignore any spelling mistakes that may have slipped past. I have just had a look at the lists again, and note that the same spelling mistakes are there. I don't want to see any more forgotten corners or misspelled words or mistakes! The joined up hand-writing and lack of spelling mistakes gave the game away. Sorry I most likely do have quite a few grammar mistakes and so o", "n. I would be grateful if you would correct the mistakes in your article so your readers may not be misinformed. He shook his head and went over to her computer, reading over what she had and correcting her mistakes. Thanks for pointing out that I had some grammar mistakes! On your CV make sure everything is typographically perfect and that there are no spelling mistakes. Also, that there are actually very few spelling mistakes, which is in itself a telling sig", "n. One of them scored twice as much as the other for spelling, despite having made far more spelling mistakes. Are you aware that you sometimes have spelling mistakes and grammatical errors in your posts? Synonymsmisprint, printing error/mistake, typographical error/mistake, typesetting error/mistake, keyboarding error/mistake, keying error/mistake, typing error/mistake, corrigendum, erratumBritish literalinformal typoverbmistook, mistaken mɪˈsteɪkməˈsteɪk[with object]1Be wrong about. because I was inexperienced I mistook the nature of our relationship Example sentencesExamples But to read for the lost arc is to mistake what this book is up to. Well, often wildlife observers mistake what they are seeing. The marshal mistook the message, thinking the emperor wanted to sweep the whole province. But he later denied the reports, saying the media mistook his remarks in a meeting with the leader. The Tribunal mistook it, as I was directly responsible. You were rude to him, and I do think you mistook his motives. Synonymsmisunderstand, misinterpret, get wrong, put a wrong interpretation on, misconstrue, misapprehend, misread, miss, take amissbe wrong, be in error, be at fault, be under a misapprehension, be misinformed, be misguided, be wide of the mark, be barking up the wrong tree, get the wrong end of the stick1.1mistake someone/something for Wrongly identify someone or something as. she thought he'd mistaken her for Diana Example sentencesExamples If I had to go inside, people would easily mistake me for Nick. Marine life sometimes mistake the bags for food and wind up choking to death. We mistook the governments of the countries for the countries themselves. Nothing untoward, though one hapless guest mistook the cart path across the golf course for the exit drive. A short woman in a baseball cap approaches me, apparently mistaking me for another snake aficionado. As I said above, people often mistake me for a 16 year old, even though I'm 25. I'm still sometimes mistaken for a student, so could I be next? Survivorship bias involves mistaking what you see for what is really there. Like the temperance movement, antiporn activism mistook a symptom of male dominance for the cause. One describes how ill he felt when he mistook a large vat of gasoline for raspberry juice, guzzling the entire thing before making the realizatio", "n. We don't mistake it as a sign from God of an impending calamity. On the other front, Germans frequently mistook Soviet mortar barrages for aerial bombardments. I just wanted to emphasize: don't mistake your cat for a dog. We'd talk for hours and I mistook this interest as genuinely concern, but then discovered she was ", "also pregnant. Mind you, people are often mistaking me for someone else. And consequently, this is sometimes mistaken as not eating all that I should. Schmidt apparently mistook ground fire for fire aimed at his flight leader. People often mistook it for a girl's name. He apparently mistook it for one near a Jewish cemetery not far away. We didn't always know where everyone else was, and sometimes mistook one another for the enemy. Synonymsconfuse with, mix up with, take for, misinterpret as, confound withPhrasesand no mistakeinformal Without any doubt. it's a bad business and no mistake Example sentencesExamples Our band of friends must cross the river to reach the object of their quest before the clocks strike midnight, else their lives will surely be over and no mistake. Well, today's been a peculiar one, and no mistake. It was a clever thing I did that day, and no mistake! I'll not be voting for him next month and no mistake. England will be going for the jugular and no mistake. Sprinting end to end, leaping on and off the drum riser, throwing himself at the front rows and shaking the hand of everyone who's singing along, he's a real rock god tonight and no mistake. With his open-neck shirt neatly tucked into belted trousers, he's old school South London and no mistake. Still, my father was a bit of a dandy in his day and no mistake. It's beautifully filmed and no mistake, but it's got one of the most dreadful scripts in recent memory… Gosh, that Kylie's a naughty one, and no mistake.by mistakeAccidentally; in error. she'd left her purse at home by mistake Example sentencesExamples Going home from work in Oxford last night I accidentally got on the Bristol train by mistake. Those are the banned substances most frequently taken by mistake by players. I left my stylus at the club by mistake, so I'll get the manager to drive around to your place and give it to you. I think my parents left the hospital with the wrong baby by mistake. Officials in Australia admit the passports were returned by mistake. Unconfirmed reports last night suggested the double safety doors at the top and bottom of the tunnel were left open by mistake. I have taped up the door so I don't forget and go in there by mistake. I thought he was a local drunk who had wondered into the group by mistake, until I realised he was handing out leaflets. Apparently the parcel wasn't for us, it was for a completely different house and he put the note through our door by mistake. In other words, I accidentally clicked on it by mistake while pasting it in, before getting up to grab a book from a shelf. Synonymsby accident, accidentally, inadvertently, unintentionally, unwittingly, unknowingly, unconsciously, by mistake, by chance, misguidedlymake no mistake (about it)informal Do not be deceived into thinking otherwise. he's passionate about football, make no mistake Example sentencesExamples Let's make no mistake about it - part of the ant-globalisation movement is resentment towards the United States, the world's hyper-power. Second, of course, is the fact that - make no mistake about it and we certainly don't attempt to skirt the issue whatsoever - we are engaged in war. And make no mistake about it: They knew what they were doing. Because if we have to adopt such tactics it can only have a negative effect on our own team preparation, and make no mistake about it, we have forwards that will ", "also want the full width of this superb stadium. And make no mistake about it, recruiting is tough duty. And they can be lethal, make no mistake about it. But make no mistake about it, we support Israel. This is a serious football team and make no mistake about that! And make no mistake about it, this nation is sad. But make no mistake about it, she's a world figure.there is no mistaking —It is impossible not to recognize someone or something. there's no mistaking that voice there was no mistaking her sincerity Example sentencesExamples But there is no mistaking her academic prowess now. At first glance, there is no mistaking the scenes are from some of the most famous movies in history. The girls are not identical, but there is no mistaking them for twins with their similar frames and blonde hair. They are few and small, only two inches in diameter, but there is no mistaking them. For a manager charged with taking his team to the knockout stages of the Champions League, there is no mistaking the modesty of his resources, although there are those who would question his use of them. But, as she reads the Braille inscription on it there is no mistaking her pride. But whatever the detail, there is no mistaking the fact that vodka is booze - hard liquor, as the Americans like to call it - that you drink for the effect rather than the taste. I have never heard my grandfather's herald voice before, but there is no mistaking it. Quaint, and sort of touristy as it may be, there is no mistaking it for anything but a railroad tow", "n. It may be that he finds himself relying on his two most physical strikers, but there is no mistaking his desire to field a more creative talent.Derivativesmistakableadjective mɪˈsteɪkəb(ə)lməˈsteɪkəb(ə)l His novels frequently star fanciable middle-aged men easily mistakable for the author's alter-egos, legends in their own fleeces, their lives curious crossbreeds of the dashing and the banal. Example sentencesExamples All the time she muttered that someone had to get a copy that wasn't mistakable for a dictionary. He is just now waking up in Manitoba in the house mistakable in every detail for the sturdy home from which he is now - and ever shall be - missing. With the Nikon, she's poetic, warm, sad, excellent, but mistakable for someone else. It's a five-door hatchback, potentially mistakeable for as many as 730 other currently available five-door hatchbacks. It's all almost totally mistakable as just another Nordic garage rock band. It would have been mistakable for a mortal village if it wasn't for all the cloaks and hats that hid the cobbled street from view.mistakablyadverbmɪˈsteɪkəbliməˈsteɪkəbliIn a way that is misguided or wrong. they were mistakably deemed successesThe other solution, which I've mentioned before, is that Larson and Pierre never appeared in the Rome adventure, and were wrongly ‘chronicled’ by Lara's professor-friend, instead of two rivals who just so happened to have very mistakeably similar names.OriginLate Middle English (as a verb): from Old Norse mistaka 'take in error', probably influenced in sense by Old French mesprendre.Rhymesache, awake, bake, betake, Blake, brake, break, cake, crake, drake, fake, flake, forsake, hake, Jake, lake, make, opaque, partake, quake, rake, sake, shake, sheikh, slake, snake, splake, stake, steak, strake, take, undertake, wake, wideawakenou", "n.1 phr.Definition of mistake in US English: mistake nounməˈsteɪkməˈstāk1An action or judgment that is misguided or wrong. coming here was a mistake she made the mistake of thinking they were important Example sentencesExamples We can't make the mistake of assuming that everything is within our grasp. Sure, we made a few mistakes along the way, but everybody makes them. It seems that South Africa is condemned to repeat fatal mistakes that should have been learned from the past. Avoid the common mistake of falling through the poles. To suggest that embodied chemical properties can solve systemic institutional problems is to commit a serious category mistake. She made the mistake of looking back at him, urging her to stay. And it is only natural that we will make some mistakes along the way. The danger in Iraq is repeating the biggest mistake - yielding to gradualism. People with great SAT scores go on to make the same stupid mistakes in their lives that we all make. After a while I realized the fatal mistake I had made, but I didn't cry. Samples are named, numbered and color-coded to make sure mistakes don't happe", "n. You know, mistakes happen in journalism, as they happen in the military. Because if you make decisions without proper precautions, you're bound to make costly mistakes in life. Not making mistakes goes beyond turnovers, and the Colts simply made costly mistakes at the wrong times. She makes the mistake of assuming that Americans can not stop eating when served a large portio", "n. As soon as he said this he realized his grave mistake and quickly looked away. The simple truth is that terrible mistakes have been made. He performed well overall but did make the expected rookie mistakes now and the", "n. Historians sometimes make the mistake of thinking that early modern religious dissent argues secularizatio", "n. He warned that they should not make the mistake of believing that they could shelve their responsibility. Synonymserror, fault, inaccuracy, omission, slip, blunder, miscalculation, misunderstanding, flaw, oversight, misinterpretation, fallacy, gaffe, faux pas, solecism, misapprehension, misconception, misreading1.1 Something, especially a word, figure, or fact, which is not correct; an inaccuracy. a couple of spelling mistakes Example sentencesExamples Thanks for pointing out that I had some grammar mistakes! It always helps to have someone point out where you've written gibberish and pluck out the spelling mistakes. I'll upload the photos and correct my spelling and grammar mistakes tomorrow. The retyping explains the spelling, and ", "also explains how a couple of spelling mistakes were introduced. It gave the readers a chance to correct mistakes and add informatio", "n. In closing, please ignore any spelling mistakes that may have slipped past. Also, that there are actually very few spelling mistakes, which is in itself a telling sig", "n. Are you aware that you sometimes have spelling mistakes and grammatical errors in your posts? I would be grateful if you would correct the mistakes in your article so your readers may not be misinformed. And note that I corrected all the stupid spelling mistakes. I don't want to see any more forgotten corners or misspelled words or mistakes! Sorry I most likely do have quite a few grammar mistakes and so o", "n. On your CV make sure everything is typographically perfect and that there are no spelling mistakes. I have just had a look at the lists again, and note that the same spelling mistakes are there. One of them scored twice as much as the other for spelling, despite having made far more spelling mistakes. The joined up hand-writing and lack of spelling mistakes gave the game away. At more relaxed times we correct the grammar mistakes of political speeches. Feel free to let me know about all of my spelling and grammar mistakes below. So what is proposed is that a spelling mistake is corrected. He shook his head and went over to her computer, reading over what she had and correcting her mistakes. Synonymsmisprint, printing error, printing mistake, typographical error, typographical mistake, typesetting error, typesetting mistake, keyboarding error, keyboarding mistake, keying error, keying mistake, typing error, typing mistake, corrigendum, erratumverbməˈsteɪkməˈstāk[with object]1Be wrong about. because I was inexperienced I mistook the nature of our relationship Example sentencesExamples But to read for the lost arc is to mistake what this book is up to. The Tribunal mistook it, as I was directly responsible. But he later denied the reports, saying the media mistook his remarks in a meeting with the leader. Well, often wildlife observers mistake what they are seeing. The marshal mistook the message, thinking the emperor wanted to sweep the whole province. You were rude to him, and I do think you mistook his motives. Synonymsmisunderstand, misinterpret, get wrong, put a wrong interpretation on, misconstrue, misapprehend, misread, miss, take amissbe wrong, be in error, be at fault, be under a misapprehension, be misinformed, be misguided, be wide of the mark, be barking up the wrong tree, get the wrong end of the stick1.1mistake someone/something for Wrongly identify someone or something as. she thought he'd mistaken her for someone else Example sentencesExamples We mistook the governments of the countries for the countries themselves. Mind you, people are often mistaking me for someone else. If I had to go inside, people would easily mistake me for Nick. One describes how ill he felt when he mistook a large vat of gasoline for raspberry juice, guzzling the entire thing before making the realizatio", "n. Marine life sometimes mistake the bags for food and wind up choking to death. On the other front, Germans frequently mistook Soviet mortar barrages for aerial bombardments. I just wanted to emphasize: don't mistake your cat for a dog. People often mistook it for a girl's name. As I said above, people often mistake me for a 16 year old, even though I'm 25. Like the temperance movement, antiporn activism mistook a symptom of male dominance for the cause. Schmidt apparently mistook ground fire for fire aimed at his flight leader. We didn't always know where everyone else was, and sometimes mistook one another for the enemy. And consequently, this is sometimes mistaken as not eating all that I should. We don't mistake it as a sign from God of an impending calamity. Nothing untoward, though one hapless guest mistook the cart path across the golf course for the exit drive. He apparently mistook it for one near a Jewish cemetery not far away. Survivorship bias involves mistaking what you see for what is really there. A short woman in a baseball cap approaches me, apparently mistaking me for another snake aficionado. I'm still sometimes mistaken for a student, so could I be next? We'd talk for hours and I mistook this interest as genuinely concern, but then discovered she was ", "also pregnant. Synonymsconfuse with, mix up with, take for, misinterpret as, confound withPhrasesand no mistakeinformal Without any doubt. it's a bad business and no mistake Example sentencesExamples Our band of friends must cross the river to reach the object of their quest before the clocks strike midnight, else their lives will surely be over and no mistake. Well, today's been a peculiar one, and no mistake. I'll not be voting for him next month and no mistake. England will be going for the jugular and no mistake. Sprinting end to end, leaping on and off the drum riser, throwing himself at the front rows and shaking the hand of everyone who's singing along, he's a real rock god tonight and no mistake. Still, my father was a bit of a dandy in his day and no mistake. Gosh, that Kylie's a naughty one, and no mistake. With his open-neck shirt neatly tucked into belted trousers, he's old school South London and no mistake. It's beautifully filmed and no mistake, but it's got one of the most dreadful scripts in recent memory… It was a clever thing I did that day, and no mistake!by mistakeAccidentally; in error. she'd left her purse at home by mistake Example sentencesExamples Apparently the parcel wasn't for us, it was for a completely different house and he put the note through our door by mistake. I think my parents left the hospital with the wrong baby by mistake. Those are the banned substances most frequently taken by mistake by players. I thought he was a local drunk who had wondered into the group by mistake, until I realised he was handing out leaflets. In other words, I accidentally clicked on it by mistake while pasting it in, before getting up to grab a book from a shelf. I have taped up the door so I don't forget and go in there by mistake. I left my stylus at the club by mistake, so I'll get the manager to drive around to your place and give it to you. Going home from work in Oxford last night I accidentally got on the Bristol train by mistake. Unconfirmed reports last night suggested the double safety doors at the top and bottom of the tunnel were left open by mistake. Officials in Australia admit the passports were returned by mistake. Synonymsby accident, accidentally, inadvertently, unintentionally, unwittingly, unknowingly, unconsciously, by mistake, by chance, misguidedlymake no mistake (about it)informal Do not be deceived into thinking otherwise. Example sentencesExamples But make no mistake about it, we support Israel. But make no mistake about it, she's a world figure. And make no mistake about it, recruiting is tough duty. Second, of course, is the fact that - make no mistake about it and we certainly don't attempt to skirt the issue whatsoever - we are engaged in war. Because if we have to adopt such tactics it can only have a negative effect on our own team preparation, and make no mistake about it, we have forwards that will ", "also want the full width of this superb stadium. Let's make no mistake about it - part of the ant-globalisation movement is resentment towards the United States, the world's hyper-power. This is a serious football team and make no mistake about that! And make no mistake about it: They knew what they were doing. And make no mistake about it, this nation is sad. And they can be lethal, make no mistake about it.there is no mistaking someone or somethingIt is impossible not to recognize someone or something. there was no mistaking her sincerity Example sentencesExamples They are few and small, only two inches in diameter, but there is no mistaking them. Quaint, and sort of touristy as it may be, there is no mistaking it for anything but a railroad tow", "n. It may be that he finds himself relying on his two most physical strikers, but there is no mistaking his desire to field a more creative talent. I have never heard my grandfather's herald voice before, but there is no mistaking it. At first glance, there is no mistaking the scenes are from some of the most famous movies in history. The girls are not identical, but there is no mistaking them for twins with their similar frames and blonde hair. But, as she reads the Braille inscription on it there is no mistaking her pride. For a manager charged with taking his team to the knockout stages of the Champions League, there is no mistaking the modesty of his resources, although there are those who would question his use of them. But there is no mistaking her academic prowess now. But whatever the detail, there is no mistaking the fact that vodka is booze - hard liquor, as the Americans like to call it - that you drink for the effect rather than the taste.OriginLate Middle English (as a verb): from Old Norse mistaka ‘take in error’, probably influenced in sense by Old French mesprendre.nou", "n.1 phr."]}, {"dict": "Oxford5000", "values": ["mistake someone/something forSee mistakeDefinition of mistake in English: mistake noun mɪˈsteɪkməˈsteɪk1An act or judgement that is misguided or wrong. coming here was a mistake she made the mistake of thinking they were important Example sentencesExamples After a while I realized the fatal mistake I had made, but I didn't cry. As soon as he said this he realized his grave mistake and quickly looked away. He warned that they should not make the mistake of believing that they could shelve their responsibility. Sure, we made a few mistakes along the way, but everybody makes them. Because if you make decisions without proper precautions, you're bound to make costly mistakes in life. Historians sometimes make the mistake of thinking that early modern religious dissent argues secularizatio", "n. She makes the mistake of assuming that Americans can not stop eating when served a large portio", "n. The danger in Iraq is repeating the biggest mistake - yielding to gradualism. He performed well overall but did make the expected rookie mistakes now and the", "n. People with great SAT scores go on to make the same stupid mistakes in their lives that we all make. The simple truth is that terrible mistakes have been made. Avoid the common mistake of falling through the poles. Samples are named, numbered and color-coded to make sure mistakes don't happe", "n. She made the mistake of looking back at him, urging her to stay. You know, mistakes happen in journalism, as they happen in the military. We can't make the mistake of assuming that everything is within our grasp. To suggest that embodied chemical properties can solve systemic institutional problems is to commit a serious category mistake. Not making mistakes goes beyond turnovers, and the Colts simply made costly mistakes at the wrong times. It seems that South Africa is condemned to repeat fatal mistakes that should have been learned from the past. And it is only natural that we will make some mistakes along the way. Synonymserror, fault, inaccuracy, omission, slip, blunder, miscalculation, misunderstanding, flaw, oversight, misinterpretation, fallacy, gaffe, faux pas, solecism, misapprehension, misconception, misreadinginformal slip-up, boo-boo, howler, boner, failBritish informal boob, clangerNorth American informal goofBritish informal, dated bloomerrare misreckoning1.1 Something, especially a word, figure, or fact, which is not correct; an inaccuracy. a couple of spelling mistakes Example sentencesExamples At more relaxed times we correct the grammar mistakes of political speeches. I'll upload the photos and correct my spelling and grammar mistakes tomorrow. So what is proposed is that a spelling mistake is corrected. The retyping explains the spelling, and ", "also explains how a couple of spelling mistakes were introduced. It always helps to have someone point out where you've written gibberish and pluck out the spelling mistakes. And note that I corrected all the stupid spelling mistakes. It gave the readers a chance to correct mistakes and add informatio", "n. Feel free to let me know about all of my spelling and grammar mistakes below. In closing, please ignore any spelling mistakes that may have slipped past. I have just had a look at the lists again, and note that the same spelling mistakes are there. I don't want to see any more forgotten corners or misspelled words or mistakes! The joined up hand-writing and lack of spelling mistakes gave the game away. Sorry I most likely do have quite a few grammar mistakes and so o", "n. I would be grateful if you would correct the mistakes in your article so your readers may not be misinformed. He shook his head and went over to her computer, reading over what she had and correcting her mistakes. Thanks for pointing out that I had some grammar mistakes! On your CV make sure everything is typographically perfect and that there are no spelling mistakes. Also, that there are actually very few spelling mistakes, which is in itself a telling sig", "n. One of them scored twice as much as the other for spelling, despite having made far more spelling mistakes. Are you aware that you sometimes have spelling mistakes and grammatical errors in your posts? Synonymsmisprint, printing error/mistake, typographical error/mistake, typesetting error/mistake, keyboarding error/mistake, keying error/mistake, typing error/mistake, corrigendum, erratumBritish literalinformal typoverbmistook, mistaken mɪˈsteɪkməˈsteɪk[with object]1Be wrong about. because I was inexperienced I mistook the nature of our relationship Example sentencesExamples But to read for the lost arc is to mistake what this book is up to. Well, often wildlife observers mistake what they are seeing. The marshal mistook the message, thinking the emperor wanted to sweep the whole province. But he later denied the reports, saying the media mistook his remarks in a meeting with the leader. The Tribunal mistook it, as I was directly responsible. You were rude to him, and I do think you mistook his motives. Synonymsmisunderstand, misinterpret, get wrong, put a wrong interpretation on, misconstrue, misapprehend, misread, miss, take amissbe wrong, be in error, be at fault, be under a misapprehension, be misinformed, be misguided, be wide of the mark, be barking up the wrong tree, get the wrong end of the stick1.1mistake someone/something for Wrongly identify someone or something as. she thought he'd mistaken her for Diana Example sentencesExamples If I had to go inside, people would easily mistake me for Nick. Marine life sometimes mistake the bags for food and wind up choking to death. We mistook the governments of the countries for the countries themselves. Nothing untoward, though one hapless guest mistook the cart path across the golf course for the exit drive. A short woman in a baseball cap approaches me, apparently mistaking me for another snake aficionado. As I said above, people often mistake me for a 16 year old, even though I'm 25. I'm still sometimes mistaken for a student, so could I be next? Survivorship bias involves mistaking what you see for what is really there. Like the temperance movement, antiporn activism mistook a symptom of male dominance for the cause. One describes how ill he felt when he mistook a large vat of gasoline for raspberry juice, guzzling the entire thing before making the realizatio", "n. We don't mistake it as a sign from God of an impending calamity. On the other front, Germans frequently mistook Soviet mortar barrages for aerial bombardments. I just wanted to emphasize: don't mistake your cat for a dog. We'd talk for hours and I mistook this interest as genuinely concern, but then discovered she was ", "also pregnant. Mind you, people are often mistaking me for someone else. And consequently, this is sometimes mistaken as not eating all that I should. Schmidt apparently mistook ground fire for fire aimed at his flight leader. People often mistook it for a girl's name. He apparently mistook it for one near a Jewish cemetery not far away. We didn't always know where everyone else was, and sometimes mistook one another for the enemy. Synonymsconfuse with, mix up with, take for, misinterpret as, confound withPhrasesand no mistakeinformal Without any doubt. it's a bad business and no mistake Example sentencesExamples Our band of friends must cross the river to reach the object of their quest before the clocks strike midnight, else their lives will surely be over and no mistake. Well, today's been a peculiar one, and no mistake. It was a clever thing I did that day, and no mistake! I'll not be voting for him next month and no mistake. England will be going for the jugular and no mistake. Sprinting end to end, leaping on and off the drum riser, throwing himself at the front rows and shaking the hand of everyone who's singing along, he's a real rock god tonight and no mistake. With his open-neck shirt neatly tucked into belted trousers, he's old school South London and no mistake. Still, my father was a bit of a dandy in his day and no mistake. It's beautifully filmed and no mistake, but it's got one of the most dreadful scripts in recent memory… Gosh, that Kylie's a naughty one, and no mistake.by mistakeAccidentally; in error. she'd left her purse at home by mistake Example sentencesExamples Going home from work in Oxford last night I accidentally got on the Bristol train by mistake. Those are the banned substances most frequently taken by mistake by players. I left my stylus at the club by mistake, so I'll get the manager to drive around to your place and give it to you. I think my parents left the hospital with the wrong baby by mistake. Officials in Australia admit the passports were returned by mistake. Unconfirmed reports last night suggested the double safety doors at the top and bottom of the tunnel were left open by mistake. I have taped up the door so I don't forget and go in there by mistake. I thought he was a local drunk who had wondered into the group by mistake, until I realised he was handing out leaflets. Apparently the parcel wasn't for us, it was for a completely different house and he put the note through our door by mistake. In other words, I accidentally clicked on it by mistake while pasting it in, before getting up to grab a book from a shelf. Synonymsby accident, accidentally, inadvertently, unintentionally, unwittingly, unknowingly, unconsciously, by mistake, by chance, misguidedlymake no mistake (about it)informal Do not be deceived into thinking otherwise. he's passionate about football, make no mistake Example sentencesExamples Let's make no mistake about it - part of the ant-globalisation movement is resentment towards the United States, the world's hyper-power. Second, of course, is the fact that - make no mistake about it and we certainly don't attempt to skirt the issue whatsoever - we are engaged in war. And make no mistake about it: They knew what they were doing. Because if we have to adopt such tactics it can only have a negative effect on our own team preparation, and make no mistake about it, we have forwards that will ", "also want the full width of this superb stadium. And make no mistake about it, recruiting is tough duty. And they can be lethal, make no mistake about it. But make no mistake about it, we support Israel. This is a serious football team and make no mistake about that! And make no mistake about it, this nation is sad. But make no mistake about it, she's a world figure.there is no mistaking —It is impossible not to recognize someone or something. there's no mistaking that voice there was no mistaking her sincerity Example sentencesExamples But there is no mistaking her academic prowess now. At first glance, there is no mistaking the scenes are from some of the most famous movies in history. The girls are not identical, but there is no mistaking them for twins with their similar frames and blonde hair. They are few and small, only two inches in diameter, but there is no mistaking them. For a manager charged with taking his team to the knockout stages of the Champions League, there is no mistaking the modesty of his resources, although there are those who would question his use of them. But, as she reads the Braille inscription on it there is no mistaking her pride. But whatever the detail, there is no mistaking the fact that vodka is booze - hard liquor, as the Americans like to call it - that you drink for the effect rather than the taste. I have never heard my grandfather's herald voice before, but there is no mistaking it. Quaint, and sort of touristy as it may be, there is no mistaking it for anything but a railroad tow", "n. It may be that he finds himself relying on his two most physical strikers, but there is no mistaking his desire to field a more creative talent.Derivativesmistakableadjective mɪˈsteɪkəb(ə)lməˈsteɪkəb(ə)l His novels frequently star fanciable middle-aged men easily mistakable for the author's alter-egos, legends in their own fleeces, their lives curious crossbreeds of the dashing and the banal. Example sentencesExamples All the time she muttered that someone had to get a copy that wasn't mistakable for a dictionary. He is just now waking up in Manitoba in the house mistakable in every detail for the sturdy home from which he is now - and ever shall be - missing. With the Nikon, she's poetic, warm, sad, excellent, but mistakable for someone else. It's a five-door hatchback, potentially mistakeable for as many as 730 other currently available five-door hatchbacks. It's all almost totally mistakable as just another Nordic garage rock band. It would have been mistakable for a mortal village if it wasn't for all the cloaks and hats that hid the cobbled street from view.mistakablyadverbmɪˈsteɪkəbliməˈsteɪkəbliIn a way that is misguided or wrong. they were mistakably deemed successesThe other solution, which I've mentioned before, is that Larson and Pierre never appeared in the Rome adventure, and were wrongly ‘chronicled’ by Lara's professor-friend, instead of two rivals who just so happened to have very mistakeably similar names.OriginLate Middle English (as a verb): from Old Norse mistaka 'take in error', probably influenced in sense by Old French mesprendre.Rhymesache, awake, bake, betake, Blake, brake, break, cake, crake, drake, fake, flake, forsake, hake, Jake, lake, make, opaque, partake, quake, rake, sake, shake, sheikh, slake, snake, splake, stake, steak, strake, take, undertake, wake, wideawakenou", "n.1 phr.Definition of mistake in US English: mistake nounməˈsteɪkməˈstāk1An action or judgment that is misguided or wrong. coming here was a mistake she made the mistake of thinking they were important Example sentencesExamples We can't make the mistake of assuming that everything is within our grasp. Sure, we made a few mistakes along the way, but everybody makes them. It seems that South Africa is condemned to repeat fatal mistakes that should have been learned from the past. Avoid the common mistake of falling through the poles. To suggest that embodied chemical properties can solve systemic institutional problems is to commit a serious category mistake. She made the mistake of looking back at him, urging her to stay. And it is only natural that we will make some mistakes along the way. The danger in Iraq is repeating the biggest mistake - yielding to gradualism. People with great SAT scores go on to make the same stupid mistakes in their lives that we all make. After a while I realized the fatal mistake I had made, but I didn't cry. Samples are named, numbered and color-coded to make sure mistakes don't happe", "n. You know, mistakes happen in journalism, as they happen in the military. Because if you make decisions without proper precautions, you're bound to make costly mistakes in life. Not making mistakes goes beyond turnovers, and the Colts simply made costly mistakes at the wrong times. She makes the mistake of assuming that Americans can not stop eating when served a large portio", "n. As soon as he said this he realized his grave mistake and quickly looked away. The simple truth is that terrible mistakes have been made. He performed well overall but did make the expected rookie mistakes now and the", "n. Historians sometimes make the mistake of thinking that early modern religious dissent argues secularizatio", "n. He warned that they should not make the mistake of believing that they could shelve their responsibility. Synonymserror, fault, inaccuracy, omission, slip, blunder, miscalculation, misunderstanding, flaw, oversight, misinterpretation, fallacy, gaffe, faux pas, solecism, misapprehension, misconception, misreading1.1 Something, especially a word, figure, or fact, which is not correct; an inaccuracy. a couple of spelling mistakes Example sentencesExamples Thanks for pointing out that I had some grammar mistakes! It always helps to have someone point out where you've written gibberish and pluck out the spelling mistakes. I'll upload the photos and correct my spelling and grammar mistakes tomorrow. The retyping explains the spelling, and ", "also explains how a couple of spelling mistakes were introduced. It gave the readers a chance to correct mistakes and add informatio", "n. In closing, please ignore any spelling mistakes that may have slipped past. Also, that there are actually very few spelling mistakes, which is in itself a telling sig", "n. Are you aware that you sometimes have spelling mistakes and grammatical errors in your posts? I would be grateful if you would correct the mistakes in your article so your readers may not be misinformed. And note that I corrected all the stupid spelling mistakes. I don't want to see any more forgotten corners or misspelled words or mistakes! Sorry I most likely do have quite a few grammar mistakes and so o", "n. On your CV make sure everything is typographically perfect and that there are no spelling mistakes. I have just had a look at the lists again, and note that the same spelling mistakes are there. One of them scored twice as much as the other for spelling, despite having made far more spelling mistakes. The joined up hand-writing and lack of spelling mistakes gave the game away. At more relaxed times we correct the grammar mistakes of political speeches. Feel free to let me know about all of my spelling and grammar mistakes below. So what is proposed is that a spelling mistake is corrected. He shook his head and went over to her computer, reading over what she had and correcting her mistakes. Synonymsmisprint, printing error, printing mistake, typographical error, typographical mistake, typesetting error, typesetting mistake, keyboarding error, keyboarding mistake, keying error, keying mistake, typing error, typing mistake, corrigendum, erratumverbməˈsteɪkməˈstāk[with object]1Be wrong about. because I was inexperienced I mistook the nature of our relationship Example sentencesExamples But to read for the lost arc is to mistake what this book is up to. The Tribunal mistook it, as I was directly responsible. But he later denied the reports, saying the media mistook his remarks in a meeting with the leader. Well, often wildlife observers mistake what they are seeing. The marshal mistook the message, thinking the emperor wanted to sweep the whole province. You were rude to him, and I do think you mistook his motives. Synonymsmisunderstand, misinterpret, get wrong, put a wrong interpretation on, misconstrue, misapprehend, misread, miss, take amissbe wrong, be in error, be at fault, be under a misapprehension, be misinformed, be misguided, be wide of the mark, be barking up the wrong tree, get the wrong end of the stick1.1mistake someone/something for Wrongly identify someone or something as. she thought he'd mistaken her for someone else Example sentencesExamples We mistook the governments of the countries for the countries themselves. Mind you, people are often mistaking me for someone else. If I had to go inside, people would easily mistake me for Nick. One describes how ill he felt when he mistook a large vat of gasoline for raspberry juice, guzzling the entire thing before making the realizatio", "n. Marine life sometimes mistake the bags for food and wind up choking to death. On the other front, Germans frequently mistook Soviet mortar barrages for aerial bombardments. I just wanted to emphasize: don't mistake your cat for a dog. People often mistook it for a girl's name. As I said above, people often mistake me for a 16 year old, even though I'm 25. Like the temperance movement, antiporn activism mistook a symptom of male dominance for the cause. Schmidt apparently mistook ground fire for fire aimed at his flight leader. We didn't always know where everyone else was, and sometimes mistook one another for the enemy. And consequently, this is sometimes mistaken as not eating all that I should. We don't mistake it as a sign from God of an impending calamity. Nothing untoward, though one hapless guest mistook the cart path across the golf course for the exit drive. He apparently mistook it for one near a Jewish cemetery not far away. Survivorship bias involves mistaking what you see for what is really there. A short woman in a baseball cap approaches me, apparently mistaking me for another snake aficionado. I'm still sometimes mistaken for a student, so could I be next? We'd talk for hours and I mistook this interest as genuinely concern, but then discovered she was ", "also pregnant. Synonymsconfuse with, mix up with, take for, misinterpret as, confound withPhrasesand no mistakeinformal Without any doubt. it's a bad business and no mistake Example sentencesExamples Our band of friends must cross the river to reach the object of their quest before the clocks strike midnight, else their lives will surely be over and no mistake. Well, today's been a peculiar one, and no mistake. I'll not be voting for him next month and no mistake. England will be going for the jugular and no mistake. Sprinting end to end, leaping on and off the drum riser, throwing himself at the front rows and shaking the hand of everyone who's singing along, he's a real rock god tonight and no mistake. Still, my father was a bit of a dandy in his day and no mistake. Gosh, that Kylie's a naughty one, and no mistake. With his open-neck shirt neatly tucked into belted trousers, he's old school South London and no mistake. It's beautifully filmed and no mistake, but it's got one of the most dreadful scripts in recent memory… It was a clever thing I did that day, and no mistake!by mistakeAccidentally; in error. she'd left her purse at home by mistake Example sentencesExamples Apparently the parcel wasn't for us, it was for a completely different house and he put the note through our door by mistake. I think my parents left the hospital with the wrong baby by mistake. Those are the banned substances most frequently taken by mistake by players. I thought he was a local drunk who had wondered into the group by mistake, until I realised he was handing out leaflets. In other words, I accidentally clicked on it by mistake while pasting it in, before getting up to grab a book from a shelf. I have taped up the door so I don't forget and go in there by mistake. I left my stylus at the club by mistake, so I'll get the manager to drive around to your place and give it to you. Going home from work in Oxford last night I accidentally got on the Bristol train by mistake. Unconfirmed reports last night suggested the double safety doors at the top and bottom of the tunnel were left open by mistake. Officials in Australia admit the passports were returned by mistake. Synonymsby accident, accidentally, inadvertently, unintentionally, unwittingly, unknowingly, unconsciously, by mistake, by chance, misguidedlymake no mistake (about it)informal Do not be deceived into thinking otherwise. Example sentencesExamples But make no mistake about it, we support Israel. But make no mistake about it, she's a world figure. And make no mistake about it, recruiting is tough duty. Second, of course, is the fact that - make no mistake about it and we certainly don't attempt to skirt the issue whatsoever - we are engaged in war. Because if we have to adopt such tactics it can only have a negative effect on our own team preparation, and make no mistake about it, we have forwards that will ", "also want the full width of this superb stadium. Let's make no mistake about it - part of the ant-globalisation movement is resentment towards the United States, the world's hyper-power. This is a serious football team and make no mistake about that! And make no mistake about it: They knew what they were doing. And make no mistake about it, this nation is sad. And they can be lethal, make no mistake about it.there is no mistaking someone or somethingIt is impossible not to recognize someone or something. there was no mistaking her sincerity Example sentencesExamples They are few and small, only two inches in diameter, but there is no mistaking them. Quaint, and sort of touristy as it may be, there is no mistaking it for anything but a railroad tow", "n. It may be that he finds himself relying on his two most physical strikers, but there is no mistaking his desire to field a more creative talent. I have never heard my grandfather's herald voice before, but there is no mistaking it. At first glance, there is no mistaking the scenes are from some of the most famous movies in history. The girls are not identical, but there is no mistaking them for twins with their similar frames and blonde hair. But, as she reads the Braille inscription on it there is no mistaking her pride. For a manager charged with taking his team to the knockout stages of the Champions League, there is no mistaking the modesty of his resources, although there are those who would question his use of them. But there is no mistaking her academic prowess now. But whatever the detail, there is no mistaking the fact that vodka is booze - hard liquor, as the Americans like to call it - that you drink for the effect rather than the taste.OriginLate Middle English (as a verb): from Old Norse mistaka ‘take in error’, probably influenced in sense by Old French mesprendre.nou", "n.1 phr."]}], "usphone": "", "ukphone": ""}