{"name": "fit in", "trans": [{"dict": "Oxford5000", "values": ["fit inSee fit1fit someone/something in (or into)See fit1fit1 adjectivefittest, fitter fɪtfɪt1predicative Of a suitable quality, standard, or type to meet the required purpose. the house was not fit for human habitationwith infinitive is the water clean and fit to drink? Example sentencesExamples The Roadmen's cottages have been used for no more than rough storage for some years and would require considerable work before they were fit for habitatio", "n. Regulations requiring that the houses be deemed fit for habitation have been waived so that they can move i", "n. Vic representatives visited the Southern Cross shortly after Easter and found the first and second floors fit for habitatio", "n. The Association executive have had talks with the club, who indicated that they will do their utmost to ensure the playing surface is fit for cricket to be played. However as long as the ship had lifeboats on board it was fit to travel. But up to 150 council workers based at the Fashion Corner council tax office were waiting to find out whether the building was fit for work. Look at some of the buildings, run down and no longer fit for purpose. First, the food and drink had to be certified fit for human consumptio", "n. He pronounced them fit for consumption, upon which we all fell to them hungrily. Nothing can enter these kitchens that isn't deemed fit for human consumptio", "n. Under the Sale of Goods Act retailers must sell goods that are of a satisfactory quality, are accurately described on the packaging and are fit for their purpose. Mr. Saunders apparently thinks that the boat, as delivered, was fit for the purpose for which it was intended. But brains from younger animals will still be considered fit for human consumptio", "n. I contacted a wine merchant in London and told him I wanted to buy some that would be fit for drinking in ten years time. The chancellor's upbeat pre-budget report hammered home the message that the economy will be fit to meet challenges from Asia and China. Perhaps the trauma of that August day, when he was forced to spend so many hours in an outfit not fit for any particular athletic activity was just too much for him. Meat which is not fit for consumption in the EU is now heading for South Africa. The van was fit for the purpose for which it was purchased. He says that the property is not fit for human habitation and is in serious disrepair. They spent at least another £7,000 making the launch watertight and fit for habitatio", "n. Synonymssuitable, good enoughrelevant, pertinent, apt, appropriate, suited, apposite, apropos, -worthyfitting, befitting, proper, due, seemly, decorous, decent, right, correctFrench comme il fautarchaic meet1.1 Having the requisite qualities or skills to undertake something competently.with infinitive the party was fit to govern Example sentencesExamples Neither of these men is stupid enough to believe that churches are fit to govern a secular society, unlike many of their junior colleagues. If he is deemed by the court to not be fit and proper to operate the pub then we would look at reopening with a new tenant. It's right to question, as the Royal Gazette does today, whether such gross negligence means the Government is fit to gover", "n. And those who would seek to give us that kind of politics are very happy to indulge the patronising fantasies of those who think it is all we are fit for. A Member who no longer thinks his party is fit to govern should in conscience resign from that party, and the party should be able to expel him if he doesn't. He got in his van and drove, was clearly not in a fit state, and accepted now he made the wrong decisio", "n. New aspects require policies to ensure that rail personnel are fit for duty and, in particular, that they are not impaired by drugs or alcohol. He was quite useless here and the only thing he was fit for was to run things like Hampton Court entertainment… They will make rings round him. And after 10 weeks in hospital, numerous complications and surgery, he was fit enough to return home. Even if he didn't betray his secret, he would never be deemed fit to return to work. Doctors will be regularly asked to demonstrate their competence, so that they are fit to practise throughout their lives. Now, does Professor Collins believe that a professor at his university is fit for his job if the professor lies in his research? But does taking a certificate guarantee that someone will be fit for purpose? William Hague hopes to use this week's Conservative conference to prove he is fit for government. If we can persuade a few more to stay on rather then retire if they are fit and able to do the job, then that is a good thing. Between now and the next general election we have to persuade millions of people up and down the country that this Conservative party is fit for government. In attempting to limit the damage by lying about his own words, he has merely raised the most serious question of all: whether or not he is fit for public office. Luckily, the doctor in charge kept on giving her a chit that she was fit and able to work although she was not. That must go as far as not working excessive hours and being fit for the job they are doing at the time. Normally I do not drink at lunchtime because all I am fit for is a siesta; evening is a different matter &lt; g &gt;. Synonymscompetent, able, capableadequate, good enough, satisfactory, proficientready, prepared, qualified, trained, equipped, eligible, worthyinformal up to scratch1.2 Suitable and correct according to accepted social standards. a fit subject on which to correspond Example sentencesExamples It is not for the Speaker to judge whether it is fit and proper for a Minister to have access to official informatio", "n. Many former stars say it is not a fit subject for the soap. The concept of the early modern period ", "also enabled an exploration of topics and subjects not previously thought fit for consideration in relation to the Renaissance. What objective criteria decide what is fit to print? How could any Court of Review determine whether leave ought to be given or not without hearing and determining upon the hearing whether it was a fit case for an appeal? But religion is a private matter, and thus not a fit subject for an inaugural address. While the results demonstrated an abundance of creativity in the audience, not all of the sculptures would be fit for public display! Synonymssuitable, good enough1.3informal with infinitive Having reached such an extreme condition as to be on the point of doing the thing specified. he baited even his close companions until they were fit to kill him Example sentencesExamples Rhyann looked fit to kill, but it was nothing compared to Gavin's anger when Alex had first fallen under. The water hurt his nose and stung his lungs and he felt fit to burst. Allen's eyeballs looked fit to pop out of his head on several occasions as he exhorted his players. We were both fit to explode but managed to share a peanut butter and chocolate cheesecake. He is so excited about his aspiration that his bubble is fit to burst. Synonymsready, prepared, on the point of, set, all set, in a fit state, primed, disposed, likely, aboutinformal up for, geared up, psyched up1.4informalReady. well, are you fit? Example sentencesExamples Now just put on these boots and you're fit to go! Are you fit then to return to the lecture?2In good health, especially because of regular physical exercise. my family keep fit by walking and cycling figurative the measures would ensure a leaner, fitter company Example sentencesExamples He appreciates how fortunate he is to be fit and able to meet such a challenge. Being always on the move, they are a very fit and strong people. A healthy body is one that is strong, flexible and aerobically fit. Dancing is great fun and a great way to keep fit during the winter months. But we can at least keep ourselves physically fit and healthy, capable of working tirelessly for ourselves and others. Football isn't just about committing yourself to training and being fit. Whisper it, but some players on the circuit are even less fit than your average county cricketer. People who are physically fit are happier, healthier and more productive than those who are not. You have to be fit to play competitively, and all younger players are competitive. The ecologically sound version of working out involves joining in with conservation work to get fit and help the environment at the same time. A Rossendale councillor has taken on a mammoth training regime to get fit for the ultimate challenge - a trek to Everest Base Camp. Would you like to become fit without the pounding and perspiration of an aerobic class or a gym? The 13-mile run may still be three months away but participants are being urged to get in training now to ensure they are fit for the event. For me being physically fit is beneficial as it helps with my mental capacities when I'm driving. Volunteers will need to be fit and will be able to make their own way to Tatton Park. Research has shown that most of us regularly over-estimate how fit we are and how much real physical activity we do. Being as fit and healthy as possible maximises the chances of a healthy pregnancy. We think that we will get very fit by the years end. He is prone to being overweight, to having a dodgy knee, to not being able to stay fit for a full seaso", "n. The only way to get fit is to make exercise a regularly scheduled part of every week, even every day. Synonymshealthy, well, in good healthin good shape, in shape, in good trim, in trim, in good condition, in tip-top condition, in fine fettle, fighting fit, as fit as a fiddle, as fit as a flea, as strong as an oxstrong, robust, hale and hearty, sturdy, hardy, stalwart, lusty, vigorous, soundathletic, muscular, strapping, tough, powerful, ruggedinformal right as rain, husky, ripped, shreddedNorth American informal buff2.1British informalSexually attractive; good-looking. who's this fit babe? Example sentencesExamples I have got a girlfriend from college but I have recently been introduced to a really fit girl through a friend of mine. Who is that guy? Oh he's so fit! Go and chat up her fit friend! Some really fit guy wearing a gorgeous top came wandering down the stairs.verbfitted, fits, fitting fɪtfɪt[with object]1Be of the right shape and size for. those jeans still fit meno object the shoes fitted better after being stretched Example sentencesExamples We have a large range of picture frames of all shapes and sizes to fit any photo, from a back yard snapshot to a professional portrait or even a personal artwork. Another approach is to take a shirt that fits you perfectly and determine the distance between the middle of its collar button to the far end of the buttonhole. She looks sleek in a beige, almost flesh-tone, summer dress and a slightly darker cardigan that fits her like a sealski", "n. I find that a lot of professional clothing with a tailored look doesn't fit me well. Don't get yourself depressed searching for items of clothing that will fit you perfectly off the rack. It was ", "also clear to me as the viewer that the equipment she was using was not sized to fit her. Although many fire guards can be adjusted to fit a range of widths, check that the guard you buy is suitable for your style of fire and make sure that it is firmly secured. Forget about size when choosing clothes and choose something that fits well regardless of size and that's comfortable on you. A visible callus that forms on the feet is known as a corn and usually results from shoes that do not fit properly. The crisp polo shirt and slacks fit him perfectly, setting off his muscular arms and blue eyes. None of my size 10 clothes fitted me anymore, I was upset and became depressed just because my clothes size had gone up one level. The trousers were a little long in the leg but other than that the clothes fit fine. You can look amazingly sexy in beautiful plus size dresses that actually fit you and flatter your figure. My jeans from Italy, for example, have no hope of fitting me any more. Lydia wore her favorite blue dress, one from Maude's trunk, which Joscelyn had graciously altered to fit her. And just where did he think I was going to get something to fit a child that size? To preclude gloves from wrapping around the bar, you have to choose the size that fits you well - not too tight, loose, small or long - just the right size. Try shoes on both feet and buy the size that best fits the larger foot. I looked around and grabbed a pair of trousers that actually fit me and a purple shirt, and ", "also some undergarments. The three-point adjustable strap adjusts to fit all heads and helmets. Synonymsbe the right/correct size (for), be big/small enough (for), be the right shape (for)informal fit like a glove1.1usually be fitted for Try clothing on (someone) in order to make or alter it to the correct size. she was about to be fitted for her costume Example sentencesExamples One of the most embarrassing moments in Deirdre's life was when she had to be fitted for protective clothing at work and they had to use two tape measures end to end to go round her. The only scars from that 20-minute procedure are four barely visible dots around his head where he was fitted for a protective metal halo. Others may have looked at it and decided it was time he was fitted for one of those jackets with the long sleeves that tie round the back. When you are fitted for your tuxedo a small deposit is usually required. The preparations for the engagement event consisted mostly of Marigold and her mother being fitted for gowns at the Earl's expense. Once I was fitted for my suit they told me it would be done by next week so I'd have enough time to qualify for the race.1.2no object, with adverbial of place Be of the right size, shape, or number to occupy a particular place. Fiona says we can all fit in her car Example sentencesExamples Originally a pasty, it developed its characteristic shape to fit better into huntsmen's saddlebags. The radio body fits nicely in a jersey pocket. The first prototype is small enough to fit in the palm of your hand. Amazingly, the hermit crab's body is asymmetrically twisted so that it fits snugly into the shape of the shell. Actually, most of the girls in the drama club fit into this category. Cut the slices of bread to a size that will fit inside your soup bowls, and toast them until dark brown on both sides. Unlike other computers, PDAs are lightweight - designed to fit comfortably in a jacket pocket. These planes are normally characterized by their diminutive size so as to fit comfortably in their user's small hands. The shape of the carton fits more conveniently into home freezers. Most of the eight Democratic candidates fit snugly into two categories. Science doesn't usually fit neatly into categories of all good or all bad. Picking the strategy that best fits into your schedule will help you maintain optimum weed management. The slightly ovoid shape fits nicely in your hand. Drain the water and set the spears on a plate, and cut them to size so they can fit on top of the muffins without drooping over the sides too much. Spar have come up with ingenious pocket Eco Bag which is a small, wallet size bag that fits neatly into a pocket or handbag so you're always armed and ready to shop.2Install or fix (something) into place. they fitted smoke alarms to their home Example sentencesExamples One Sunday our neighbour says could I please ask our landlord to fit draft excluders on our front door. With his help, she has transformed the one-bed house in Crawley, West Sussex, fitting a new bathroom, installing storage, laying flooring and doing plenty of rewiring. They pronounced the pipework ‘impeccably installed’, and recommended we fit an independent water supply. The announcement comes just a week after rail bosses responsible for redeveloping the railway station got round to fitting new clocks on the platforms, more than 18 months after the station revamp was completed. Work began on Monday to fit a disabled lift, due to be installed in May but delayed because the Italian manufacturer wasn't able to supply it until recently. Mr Sanderson said one of the most successful schemes helped the victims of burglary being targeted a second time by swiftly fitting new locks on doors and windows. Police have fitted new locks on the windows and doors since the break-i", "n. If not, why didn't you call a local Sky Installation Engineer to fit your dish? The team can fit grab-rails on staircases and in doorways, fix defective carpets or floor coverings, remove trailing wires and generally reduce trip hazards. A restraining net is fitted as standard, as is a decent luggage cover. Police are warning homeowners to fit strong locks on sheds and garages, cover windows with old curtains, install an expensive but noisy alarm and ensure that the household insurance policy covers the value of shed contents. Power assisted steering, fitted as standard, makes manoeuvring the vehicle effortless. These could serve as additional bedrooms and there is plumbing in place to fit a shower room in one of them. After a medical centre in West Bowling was targeted by vandals, fences were fitted out of the centre's own funds. Adam, our installer, was fitting some other stuff and left to go on to another job whilst I changed 16 of the handles. Selby fire station has previously held car-seat open days, showing people how to properly fit child seats in cars. Inspectors will look at whether the correct equipment is being used, work platforms are properly installed and scaffolding is securely fitted. A council spokesman said today there was no council policy of fitting child locks on windows in York, although it did fit locks on replacement windows as a crime prevention measure. So he came round, and we positioned it and fitted the great drive-belt. So fitting sensors in the rear rooms of the house and in the hallway is often considered sufficient for the ground floor. Synonymslay, put in place/position, position, place, fix, insertarrange, adjust, shape2.1often be fitted with Provide (something) with a particular component or article. most tools can be fitted with a new handle Example sentencesExamples She claims it was sheer luck that the blaze was caught in time, because her kitchen was not fitted with a smoke alarm. Their front door was fitted with a Yale lock, two bolts and a security chai", "n. The traffic car was fitted with child locks in the rear to prevent people escaping. The café has been fitted with a new kitchen and outside seating with parasols. Her cot is fitted with a sleep monitor that sounds an alarm if her breathing stops. The massive bike was fitted with a stereo and a foghorn to attract the maximum amount of attentio", "n. The room is fitted with special low lighting and window blinds to allow fragile works to be displayed. Fire chiefs yesterday said that lives could have been saved if the house had been fitted with a smoke alarm. Each table is fitted with a grill for you to cook the deliciously marinated meat. The airship will be fitted with cameras and infra-red equipment for night visio", "n. The car was fitted with a roll cage and sports seats and drivers had to wear crash helmets and be strapped i", "n. It is hoped the park will be fitted with floodlights and CCTV cameras for extra security. Typically, a motorcycle may be fitted with a horn that would usually go on a jeep or a truck. The cars are all left hand drive and had not yet been fitted with tracking devices. It is understood the vehicle used by the gang was ", "also fitted with false number plates. The kitchen has been fitted with new equipment and furniture will be replaced throughout the pub. Make sure you lock windows and doors, which should be fitted with security deadlocks The bag is fitted with a special alarm programmed to go off if someone reaches inside. She called for all new properties to be fitted with meters so people were aware how much water they were using. The coach was fitted with lap belts but parents are concerned they are inadequate to protect childre", "n. Synonymsequip, provide, supply, fit out, rig out, furnish, outfit, endow2.2 Join or cause to join together to form a whole.no object their bodies fitted together perfectlywith object many physicists tried to fit together the various pieces of the puzzle Example sentencesExamples Extra fuel tanks may need to be fitted together with spare jerricans. What they didn't know is when or if the pieces would fit together. He wished to cut them into as few pieces as possible so that they could be fitted together, without waste, to form a perfectly square table-top. The little pieces fit together, each part representing something small but vital. The limestone is produced in special moulds and can be fitted together like a jigsaw to form any configuratio", "n. Seven remain, which can be fitted together with only small gaps. It just brings everything into balance and all the pieces fit together. You know what the picture's going to look like at the end, but you want to see how all the pieces will fit together. Finding which pieces fit together in order make the complete picture is one of the more difficult tasks. As the pieces start to fit together the characters' dilemmas begin to take on a different shape. Once inside you can see how the upper and lower receivers have been carefully fitted together by hand. The seven pieces will never fit together to make any sense. Currently sheet metal barriers were being fitted together behind the factory. It was a place where two separate pieces of metal fitted together, like the barrel of a lock. Instead, when you crack open this thing, all you get are busted pieces that don't fit together and don't work. These are fitted together and built up as you need them, providing a versatile solution to changing needs. Drawing a plan forces you to think through your project from beginning to end, what you are going to need and how your are going to get the pieces to fit together. There is no doubt that a certain consistency of outlook is present throughout, but the pieces do not always fit together well. When these were fitted together, they were hammered to make the joint watertight. Understanding how the three pieces fit together and what to do about them is a big part of choosing the right project and getting it done. Synonymsjoin, connect, put together, piece together, attach, unite, link, splice, fuse, weld3Be compatible or in agreement with; match. the landlord had not seen anyone fitting that description Example sentencesExamples Dewey observed that this model does not fit what we know about childre", "n. I'd seen her once or twice at school, and she fitted the description Travis gave me of her perfectly. He said: ‘It happened in the city centre and the man fits the same physical descriptio", "n.’ Take a volunteer position that fits your interest, and may even enhance your career goals. The Edmonton author, publisher, and former social worker has fit that description for at least 25 years. However modern scholars claim that Newton sometimes adjusted his calculations to fit his theories. The descriptions the woman gave fitted those of the two girls Tessa had seen before. Canada's judges have moved boldly into the public policy arena, shaping laws to fit their own peculiar biases and ideologies. After a while, a newcomer walks in who perfectly fits the description of the spy her husband gave to her. I learned that the job description was written to fit the individual whom the department wanted to hire. We can and should form opinions about guilt or innocence in the same as we form other opinions, by choosing the position that best fits the available evidence. I certainly don't fit any of the ideals presented in the media. So if you fit any of these descriptions and are interested in auditioning, the producers would love to see you. Ten minutes later there were a number of sightings close to the Brittons' home of a man fitting Mark Hobson's descriptio", "n. Unfortunately, no candidate perfectly fits this descriptio", "n. I haven't met anyone who fits the commonly held definition of sane. She has adjusted her services to fit the customer's budget. Fast, simple and delicious, these dishes can be adjusted to fit your schedule, grocery list and occasio", "n. It was clear that none of the six men who claimed to be at the warehouse could possibly fit the police officer's descriptio", "n. In some respects the description had fitted Naylor, while in others it did not.3.1 Be suitable or appropriate for. the punishment should fit the crime Example sentencesExamples But it must be for independent judges, not party political ministers, to decide what particular punishment fits what particular crime. To some no punishment fits such a crime, and these people honestly believe the murderers deserve no sympathy at all. Plus, they come in a variety of sizes and shapes to fit your specific needs. Unfortunately, regulations, society and employers' attitudes have not been adjusted to fit the new situatio", "n. The sound effects are used suitably and fit perfectly in the game. That means criminalizing behavior such as the spreading of viruses and setting up a punishment that fits the resulting economic damage. They can adjust their temperature to fit their surroundings. My dad suggested getting a one-level house and adjusting it to fit her needs, but she flat-out refused. The great vocal melody is still there, and the arrangement on the album fits the theme of the song. Are separate vacations in our future, or is there a destination that can fit us both? Synonymsbe appropriate to, suit, correspond toagree with, tally with, go with, be in agreement with, accord with, correlate to, be congruous with, be congruent with, concur with, dovetail with, conform to, be consonant with, match3.2 (of an attribute, qualification, or skill) make (someone) suitable to fulfil a particular role or undertake a particular task. an MSc fits the student for a professional career Example sentencesExamples His passion for lists, dates and details fits him well for this task. Dr Cherry's specialisation and experience fitted him ideally for involvement in the development of the project. His freshness, his directness and his capacity for making connections with people both in person and on the television screen certainly fitted him for the task. I was playing the part of Polonius - a part my mature years obviously fitted me for. He regarded his own intellectual gifts and cast of mind as properly fitting him for the task. One biographer assumes that he was a boy of somewhat ordinary talents that would fit him only for the mercantile trade. Synonymsqualify, prepare, make ready, make suitable, prime, condition, train, coach, groom, tailornounPlural fits fɪtfɪt1The particular way in which something, especially a garment or component, fits. the dress was a perfect fit Example sentencesExamples However, the shoulder seam plays a key role in the fit of garments that cover the upper body. It means a lot to me; I didn't exchange it for the correct fit because I wanted the original one. I got up and borrowed a pair of Jon's jeans which were the perfect fit. The pants have a roomy cargo pocket on the right leg and unhemmed cuffs so woman hunters can achieve the perfect fit. The dress was fabulous, a perfect fit, slim fitting with two thin shoulder straps and a more loose, flowing bottom part that ended just above the knee. If you find a pair of black pants or a skirt that are the perfect fit, consider buying more than one pair. The firm has developed mathematical algorithms to simulate fabric drape and garment fit. Not every shirt or jeans will have a perfect fit for everybody. Again, I strongly encourage choosing pants with a drawstring or an elastic waistband for an easy fit. Sometimes, you can help the fit of your garments by sewing these darts a little differently. Perfect fit is accomplished when garments just skim the body, without pulling or sagging. We look at clothing as an investment, so we consider the quality of a garment as well as the fit. The pants feature a full elastic waistband and cuffs for a comfortable fit. Is your saddle a correct fit and not put too far up the back. Both the skirt and shirt were a perfect fit. All new windows offer a tight fit between components to limit the rate of infiltratio", "n. The harness is adjusted on the shoulder and waist straps for a perfect fit. You might want to get your shirts altered at waist level to give them a slimmer fit. A belt that doesn't have holes is even easier, as it's fully adjustable for a perfect fit. Despite the general lack of fit, the best fitting model seems to be the one-factor model.1.1 The particular way in which things match. a close fit between teachers' qualifications and their teaching responsibilities Example sentencesExamples It is ", "also a way to gain knowledge of what is a good fit or match for your personality type. A great deal of the power and impact of the preached Word comes from the fit between the preacher and the words being preached. There's a very good fit between the ideals of our two organisations. The band may be sore because there's a close fit between their own fan base and the kind of campus kids who have got into illegal downloading big time. The nurse must carefully examine the fit between the diagnosis and the client for whom it is intended. Marketing is a dynamic process of ensuring a close fit between the capabilities of an organization and the demands placed upon it by its external environment. Synonymscorrelation, correspondence, agreement, consistency, equivalence, match, similarity, resemblance, comparability, compatibility, affinity, concurrence1.2StatisticsThe correspondence between observed data and the values expected by theory. Example sentencesExamples A thermal history involving two discrete episodes of heating and cooling clearly provides the best fit to the measured data. The greatest deviation from a good fit between the component figures occurs near the proximal end. The results indicate a good overall fit of the model. Accurate measurements of these parameters could lead to a better fit of the theory to experiment. A smaller ratio score signifies good fit, and values near 2.0 are considered acceptable.Phrasesfit for purpose(of an institution, facility, etc.) well equipped or well suited for its designated role or purpose. Example sentencesExamples A policy of armed neutrality with an emphasis on quality kit, fit for purpose. Validation means making sure the information the customer sends you is fit for purpose. Everyone except the government seems to have acknowledged that the assessment system is no longer fit for purpose. Product specification/quality not fit for purpose or meet regulatory standards. What is currently on offer is simply not fit for purpose, in terms of funding or scale. Murray is, at the moment, not fit for purpose. Five years in Iraq demonstrated that the vehicle was not fit for purpose. A high quality attractive, \"fit for purpose\" estate does not come cheap. The only approximation of the classification which could have been created would not have been fit for purpose. Quality is inextricably linked with being fit for purpose.fit for a king (or queen)Of very high quality. your bedroom is fit for a king Example sentencesExamples One can quickly whip up a meal fit for a king or quee", "n. You love luxury and sensual comforts such as silky satin sheets, robes fit for a king or queen and beautiful surroundings. We grill up a feast fit for a king. New windows, a brighter floral display, and an external paint job have left the place fit for a quee", "n. The city hall is taking steps to make an arts and cultural centre fit for a quee", "n.fit to be tiedinformal Very angry. Daddy was fit to be tied when I separated from Hugh Example sentencesExamples They clucked and fussed and were fit to be tied at the wanton waste they witnessed. We know that his family was fit to be tied with him during that time, and for good reaso", "n. I listen to her set out her latest jargon-laden agenda for interfering in the lives and habits of British families, and after a few paragraphs I am afraid I am fit to be tied. When she learns from the doctor that she's not sick after all but sound as a dollar, she's fit to be tied. Those wee ones love the man and are fit to be tied when it's time for him to leave. Synonymslivid, furious, angry, infuriated, irate, fuming, raging, seething, incensed, enraged, angered, beside oneself, wrathful, ireful, maddened, cross, annoyed, irritated, exasperated, indignantinformal mad, boiling, wild, hot under the collar, foaming at the mouth, steamed upfit to bustinformal With great energy. they laughed fit to bust Example sentencesExamples I get a face full of sherbet, in my eyes and up my nose and I'm coughing fit to bust. The flower beds are brimming with rhododendrons, the birds are singing fit to bust. It might be that they have snow blizzards up in Scotland just now but down here we've got grass growing, buds budding, and, to my great delight, huge swathes of snowdrops, flowering fit to bust. An hour later I woke from a vivid dream with my heart pounding away fit to bust. Everywhere you go there's someone coughing fit to bust and looking miserable, or cross, or plain old-fashioned resigned to their fate. Algernon laughed sufficiently for the two of them, wheezing and hee-hee-heeing fit to bust, having to support himself on Simpson's shoulder. I looked on in disbelief and her mother walked in and started screaming fit to bust. The brother she mentioned is laughing fit to bust. Already, his kitchen was full of brightly clad, bright-faced students talking fit to bust, helping themselves to coffee, and to stuff out of the pantry. Now, late in the evening, it's blowing fit to bust outside.see (or think) fitConsider it correct or acceptable to do something. why did the company see fit to give you the job? Example sentencesExamples Once it was confirmed that there was no further asbestos the site would be vested in the community, which could decide to use or dispose of it as they thought fit. Over the next six months, consider all your career options and make changes as you see fit. He needs to raise some money, so if you see fit, please make a donatio", "n. The prime minister is free to do as he pleases when he sees fit. Feel free to choose more or less as you see fit, but please explain why you picked them. You may add or subtract from my suggested text as you see fit, but please keep it polite. I told the news editor he could break all the rules and do as he thought fit on the front page. I am sure the learned trial judge felt she did her best to consider the arguments and rule as she saw fit, according to law. I am pretty shocked that you thought fit to send this email out today. I have not had any academic training in film-making and planned the shots the way I thought fit.Phrasal Verbsfit in1Be socially compatible with other members of a group. he feels he should become tough to fit in with his friends Example sentencesExamples What if he realized how little she fitted in with those he loved? Other issues included feelings of social isolation, with students saying they had difficulties fitting in because of a culture clash between university and their home life. I never fitted in with the cool kids, and trying to do so was making me unhappy as a teenager. She was confident of fitting in socially but, during her first term, the workload caused a few concerns. Does your teen have trouble fitting in at school? I never fitted in with the Catholic community of my home. They may have poor social skills, have problems fitting in and probably cannot meet the expectations of their family or school. Early on, his drinking was linked to loneliness and an inability to fit in socially with his fellow players. On an endless search for what is needed to fit in and be socially acceptable, all sense of self is lost. Synonymsconform, be in harmony, belong, blend inaccord, agree, concur, be in linebe assimilated intomatch, square withinformal click1.1Be in harmony with other elements in a situatio", "n. her project fitted in with the organization's general aims Example sentencesExamples Helen Kidman, chairman of Ilkley Civic Society, said the guide was meant to inspire finer architecture that fitted in with the surrounding area. Needless to say, the service was attentive, without being overbearing, and fitted in with the relaxed, classy atmosphere. The drive to increase access to universities fits in with New Labour pronouncements on social inclusion and the ilk. This fits in perfectly with the general social and economic policy of the SPD-Green government. Throughout the meal we were treated to a varied array of music which fitted in with the friendly atmosphere of the pub. He said the deals were ‘a good package’ and fitted in with their strategy of expanding on both sides of the Atlantic. ‘We picked up the project because it was a good idea and because it fitted in with our health agenda,’ said a spokesma", "n. It was none the less an amusing portrayal, which fitted in with the high spirits of the evening if not into the household. People were satisfied and extremely elated with the overall results, as they fitted in with the concept of a truly national party, even on face value. This fitted in with the free trade approach of the time.1.2Constitute part of a situation or larger structure. I don't think I fit into his plans for next season Example sentencesExamples Where did you see yourself fitting into all that? She just wasn't fitting into his plan at all tonight. What I hope is that the coaching staff and my team-mates think that I'm steadily getting better as a player and fitting into the team. It certainly fits into my plans to really look at mammals to understand birds better. He has not been hampered by timidity or uncertainty, fitting into the side with calm assurance and revealing the extent of his ability. Where do you see broadband and videostreaming fitting into your plans? They are training very hard and have acquired a number of new players this year that are fitting into the team very well. He has been in tremendous form and is a fantastic talent who fits into Saints' future plans. We don't have any children of our own yet but I don't see how any child of ours would fit into such a situatio", "n. How do you see those alliances fitting into your long-term business plan?fit someone/something in (or into)1Find room or have sufficient space for someone or something. can you fit any more water into the jug? Example sentencesExamples Do you think that some people don't realise that there is a trade off, that okay if you don't want to have high-rise, you're going to have to take up more space to fit people in? There was not enough room to fit people in and no access for the disabled. If your club/organisation is missing out on valuable publicity for vital fundraising events, we will always find space each week to fit you i", "n. And it could be the answer to the prayers of weekend shoppers who frequently struggle to fit their vehicles into precious spaces. I have been focusing on fitting my things into the very limited space this apartment affords. He only just fit his belongings into the room, cramming his clothes and most of his toys into the roll-out drawers and using the shelves for his books and stand-alone objects. The space inside seems too small to fit the elaborate furniture in the room. He disappeared without payment when he had completed the extraordinary task of fitting a spiral staircase into a space deemed impossibly small. There is enough room to fit the power cable in there, but I think a bit more space would make it easier for people with large hands to connect and disconnect the cable. I have, however, seen that people with slightly larger cars have experienced difficulty trying to fit their cars into the spaces.1.1Succeed in finding time in a busy schedule to see someone or do something. I could fit you in at 3.45 this afternoon Example sentencesExamples The organisers were hoping the champion runner would fit the event into her busy schedule. How do you fit your workouts into such a busy schedule? I fitted my degree into a busy fire service life - it was a case of interrupted study for six years. We've been looking to play this venue for ages, because it is such a good reputation, but either we were busy or they were busy and couldn't fit us i", "n. Johnny raised his eyebrows and shrugged, ‘I suppose I could fit you into my extremely busy schedule.’ Just follow our 10 steps for fitting a new activity into an already busy lifestyle, and you'll be sure to achieve success. Mr Simpson said on both occasions that he was unable to fit the openings into his busy calendar of events. I tried to eat well and exercised when I could fit it into my busy life. Added to the business of choosing a topic, I must ", "also consider where I will fit the actual writing into my schedule. This enabled her to decide when she worked and to fit it in around her busy schedule, which included picking up the kids from school.fit someone/something out (or up)Provide someone or something with the necessary equipment, clothes, or other items for a particular situatio", "n. the cabin had been fitted out to a high standard Example sentencesExamples The properties can be fitted out at a cost of €15,000. And the opportunity is not restricted to the able-bodied - the vessel is fitted out to accommodate people of all types of physical ability and disability. The next four weeks will be very busy fitting it out with furniture and equipment and making it clinically clea", "n. He said doctors on duty will have a taxi available to them at all times to drive them to patients and the car will be fitted out with high quality medical equipment, like a mini-ambulance. These houses are fitted up in first-rate style, with gas and water laid o", "n. The bathrooms are fitted out in granite, oak and glass. The Learning and Skills Council spent £40,000 on refurbishing space at the station, fitting it out with six new computers with Internet access, printers, a digital camera and scanner. On leaving the school the boys were fitted out with clothes and given a bible and a Book Of Common Prayer. The interior of both buildings are fitted out with the highest of standards of modern fittings. The cells are fitted out with televisions, sanitary and tea making facilities. Synonymsequip, provide, supply, furnish, kit out, rig out, outfit, accoutre, array, stockfit someone upIncriminate someone by falsifying evidence against them. Example sentencesExamples He admitted in early 1997 he was a prime suspect for the murder and conducted a series of interviews denying the charge and claiming police were out to fit him up. Thus does the movie have its cake and eat it: the drama and glamour of real mob violence, plus the sentimental suggestion that our Charlie was fitted up. He added: ‘After 27 years of being a thorn in the side of the police they fitted him up for something serious to put him away for a long time.’ The confessor's claims that Stuart had been fitted up shook the parochial world of late 1950s Australia, a country just waking up to the notion of civil rights. That was a really pathetic job of fitting someone up. We need people who have the skills to smell out somebody who comes along to try to fit us up. He told the Standing Committee on Legal and Constitutional Affairs he had been fitted up with the help of covert recordings for falsely accusing police officers of corruptio", "n. Your basic complaint is that they fitted you up for something you did not do. Synonymsfalsely incriminate, entrap, fabricate charges/evidence againstinformal frame, set upDerivativesfitlyadverb ˈfɪtliˈfɪtli Science since Darwin is fact upon fact, instance upon instance, experiment upon experiment, principle upon principle, which fitly joined together by some master mind may establish some great truth. Example sentencesExamples He runs fitly and trimly around the racetrack. In the beginning, it seemed to be a very happy marriage, since the two poets could inspire and parallel each other so fitly. She denied she was a strong-minded woman, but ‘if a word fitly spoken and in due season can be urged at a time like this, we should not withhold it.’ The vine has less beauty than many other trees, but it is exceedingly fruitful; fitly representing the low condition in which our Lord was in, yet bringing many sons to glory.OriginLate Middle English: of unknown origi", "n.Rhymesacquit, admit, backlit, bedsit, befit, bit, Brit, Britt, chit, commit, demit, dit, emit, flit, frit, git, grit, hit, intermit, it, kit, knit, legit, lickety-split, lit, manumit, mishit, mitt, nit, omit, outsit, outwit, permit, pit, Pitt, pretermit, quit, remit, retrofit, sit, skit, slit, snit, spit, split, sprit, squit, submit, transmit, twit, whit, wit, writ, zit fit2nounPlural fits fɪtfɪt1A sudden attack of convulsions and/or loss of consciousness, typical of epilepsy and some other medical conditions. the child had frequent fits Example sentencesExamples She cannot work as she now suffers frequent, violent epileptic fits. Kirstie has had epilepsy since she was 18 and until recently suffered daily epileptic fits. One prisoner suffered an epileptic fit, and all the others shouted for help. During this state one keeps on getting epileptic fits without regaining consciousness in betwee", "n. Julie Ann now suffers from daily fits and seizures. Alexandra has cerebral palsy, is confined to a wheelchair and suffers from frequent epileptic fits. If the child has fits, they may be prescribed anticonvulsant drugs. Othello, told by Iago that Cassio has admitted sleeping with Desdemona, falls into a fit. His master and friends all said he was a clever, well-behaved boy, and had never been known to have fits, or walk in his sleep. At his parents' Flamborough home, his condition worsened, and he suffered several prolonged epileptic fits. The problems began after the woman was admitted to a medical ward in a local hospital suffering from fits and nightmares. Concerned about the number of fits Slater was having, her doctor decided to operate to disconnect the right and left hemispheres of her brai", "n. His frequent fits result in painful injuries, and medication has failed to control the traumatic episodes. It is believed he suffered a fit as he was watching a football match. Her sister, Lucy, suffers from cerebral palsy and epilepsy and is often treated in York Hospital for fits and chest infections. He collapsed and died suddenly after not suffering an epileptic fit for several years. If the child has a history of epilepsy, it can be difficult to tell the difference between febrile convulsions and epileptic fits. Febrile convulsions are fits that sometimes happen in a child with a high temperature. Always phone for an ambulance if a fit lasts longer than five minutes. Her ordeal began in November when she started having fits and convulsions despite no previous history of health problems. Synonymsconvulsion, spasm, paroxysm, seizure, attack(fits) throesMedicine ictus2A sudden short period of uncontrollable coughing, laughter, etc. Example sentencesExamples One rehearsal we were supposed to look lovingly into each other's eyes but kept bursting into uncontrollable fits of laughter. Promptly she was seized by a sneezing fit agai", "n. They burst into a fit of giggles once again and collapsed onto the floor, each pulling their piece of the supposed French ensemble off and placing it on the floor between them. In fits of laughter, he told them I was his so", "n. He muffled his sudden fit of laughter, coughing rather violently to disguise it. Next she would burst into a fit of sobbing, wailing on and on about how good she had been to him. She kept erupting into fits of maniacal chuckles at some secret joke. Victor whacked her hard on the back and Antonia burst into a fit of coughs. And as he watched her in confusion, Shelley's chuckle turned into an uncontrollable, hysterical fit of laughter. The first day, she had burst into a fit of coughs after opening her mouth only having to have a fly swarm into her mouth. We where in the middle of singing when I had a coughing fit. Michelle burst into a fit of giggles, rolling back onto her tiny bunk. He ", "also has a name that reduces grown men to uncontrollable laughing fits at the slightest mentio", "n. The match flew by as the fans went through fits of shouting, singing, tension and passio", "n. Her eyes danced with amusement and then she burst into a fit of giggles. She seemed to dissolve into hysterical fits of laughter when she looked at me. She whispered this last part to me and we both had a fit of giggles. One of the kids standing behind him broke out into an uncontrollable fit of giggles. Francesca tried to cover her giggles by throwing a coughing fit. I'm sure you all have experienced those sudden fits of laughter that make you cry and make your sides hurt and you want to stop but you can't? Synonymsoutbreak, outburst, burst, attack, bout, spell, eruption, explosion, flare-up, blow-uprare access2.1 A sudden burst of intense emotio", "n. he had killed her in a fit of jealous rage Example sentencesExamples He acknowledges these fits of anger, such as the one that caused him to slay his wife with an ax, but he nevertheless shows some remorse for what he has done. Hearing such music does not usually send you into a fit of rage immediately. Lisa suffers from fits of sudden rage and unbearable fatigue. If at all he became angry, he would keep quiet rather than burst out in a fit of temper. He even had his own wife murdered in a fit of jealousy. Another time, while Elie is working at the electrical warehouse, he goes on one of his fits of rage and beats the boy. He lives off the earnings of his wife, Eva, succumbs to fits of paranoia and anger, engages in a desultory affair, hates the physical decay around him and is haunted by the prospect of death. To leave now would suggest that he'd gone in a fit of pique. He was suddenly seized by a fit of panic. He was frantically jealous, beat her, begged forgiveness in fits of remorse which became as repellent as his rage, and demanded she abort the pregnancy that came along in the second month of the hasty match. In a fit of fury Calvert who was known to be a violent and irrational person burst into Smedleys home and hurled a heavy stone ornament at him. Her mother's fits of anger and the threats and beatings dealt to the girl resolve themselves in a grudging acceptance of the financial favours handed out by the lover. Yes, authors and creators can suffer fits of pique that can hurt the markets for secondary works. Reane, in a fit of pure rage, slashed him across the back. Alex is extremely intelligent with a propensity for fits of anger and uncontrollable rage. The model is already facing claims from three former assistants who say she allegedly assaulted them in fits of rage. He is prone to fits of jealousy when he sees Primrose in the company of another male. Synonymstantrum, fit of temper, outburst of anger, outburst of rage, frenzy, furyinformal paddy, state, stressNorth American informal blowout, hissy fitrare ebullition, boutadeverbfitted, fits, fitting fɪt[no object]Have an epileptic fit. he started fitting uncontrollably Example sentencesExamples He had had no medication and so he was fitting four to five times a day. She fitted twice more on the way up, the second time slipping dangerously out of the chair at the top of some steps. He has been fitting every day for the last six days.Phrasesgive someone a fitinformal Greatly shock or anger someone. Example sentencesExamples My liking of jam and cheese sandwiches always gave my mum a fit. Should I go see Mr. Mercader tonight and give Brexton a fit, or go home? Emma has another tooth that came through Saturday night, but it gave her a fit! Bugs, and anything that crawled, used to give her a fit.have (or throw) a fitinformal Be very shocked or angry. Example sentencesExamples If people don't want to listen to what he wants to listen to, he throws a fit. I was in a line of folks standing behind a woman at the bookstore who was throwing a fit because the clerk could not find the copy of The Great Gatsby she'd called to reserve. You know my mother will throw a fit if she sees me like this. His mother had a fit, so they married again on New Year's Day 1937, this time with the family present. Mother will be having a fit if she knows I'm sitting out in the cold air - for even though it seems warm she'll fuss. This hardly seems like the kind of thing to be throwing a fit about. Better get a move on so mother doesn't throw a fit when I get back. They were used to him throwing a fit when he was in bad mood. My mother would have a fit if she knew I spent a lot of time at Deane's. The rental company is sent away by the filming crew and my friend's husband throws a fit.in fits (of laughter)informal Highly amused. he had us all in fits Example sentencesExamples At one point, she had the audience in fits. For starters, I was in fits of laughter at the sight of him, and his swearing and shouting just made me worse. His quick wit and confident delivery had the audience in fits of laughter. Once we were out of harm's way, we all ended up breaking down in fits of uncontrollable laughter - partly to relieve the tension of the near-miss situation, but mostly because of the absurdity of what had just happened. Peter had one of the locals in fits of laughter when he was doing a line dance. Eventually, after half an hour rolling around on the floor in fits of laughter, I managed to regain my composure. The rest of us collapsed in fits of laughter at poor old Dave. We collapsed in fits, the tutor had overheard and was almost wetting herself, and the 5 others were demanding to know what we'd said. There was a time when circus was a popular form of entertainment - with acrobats and bold ring-masters to whose crack of the whip wild animals played awesome tricks and the clowns left packed audiences in fits. Both the staging and acting are universally superb and we were in fits of laughter throughout.in (or by) fits and startsWith irregular bursts of activity. the economy was recovering in fits and starts Example sentencesExamples The poetry is moving forward in fits and starts. The improvement came slowly, sporadically, in fits and starts. The Roman occupation of Britain advanced in fits and starts with the occasional disaster - the bloody revolt of Queen Boadicea in 61 AD is the best known example. It was built in 1961, and it's been renovated in fits and starts, so it's sort of an architectural Frankenstei", "n. Progress has come in fits and starts and is still fragile. I've started adding mine, but it'll be done in fits and starts… All too often, science progresses in fits and starts, re-examining data, reinterpreting evidence - a path that can be hard to accept in medicine, when answers are needed now. Like my wife's slimming programme, this year's harvest is going in fits and starts, punctuated by incredibly hot days of activity and frustrating rest periods. We played in fits and starts and never really clicked and opened up, but we're happy with the points. However, like in any sport, those who play well throughout the whole contest - not just in fits and starts - more often than not end up victorious. Synonymsspasmodically, intermittently, sporadically, erratically, irregularly, interruptedly, fitfully, haphazardly, on and off, off and on, now and then, now and againOriginOld English fitt 'conflict', in Middle English 'position of danger or excitement', ", "also 'short period'; the sense 'sudden attack of illness' dates from the mid 16th century. fit3(", "also fytte)nounPlural fits fɪtfɪtarchaic A section of a poem. Example sentencesExamples The balance of this first fytte consists mostly of lengthy dialogue detailing the knight's impoverishment. When the knight is introduced in a later fytte of the poem, he is called Sir Richard-at-the-Lee. Percy has written a long ballad in many fits: it is pretty enough.OriginOld English fitt, perhaps the same word as fit2, or related to German Fitze 'skein of yarn', in the obsolete sense 'thread with which weavers mark off a day's work'.", "adj.1 phr. phr.", "v. nou", "n.1 phr. nou", "n.2fit1 adjectivefitfɪt1predicative Of a suitable quality, standard, or type to meet the required purpose. the meat is fit for human consumptionwith infinitive is the water clean and fit to drink? Example sentencesExamples I contacted a wine merchant in London and told him I wanted to buy some that would be fit for drinking in ten years time. Regulations requiring that the houses be deemed fit for habitation have been waived so that they can move i", "n. Look at some of the buildings, run down and no longer fit for purpose. But brains from younger animals will still be considered fit for human consumptio", "n. Nothing can enter these kitchens that isn't deemed fit for human consumptio", "n. He says that the property is not fit for human habitation and is in serious disrepair. Perhaps the trauma of that August day, when he was forced to spend so many hours in an outfit not fit for any particular athletic activity was just too much for him. He pronounced them fit for consumption, upon which we all fell to them hungrily. The Roadmen's cottages have been used for no more than rough storage for some years and would require considerable work before they were fit for habitatio", "n. The chancellor's upbeat pre-budget report hammered home the message that the economy will be fit to meet challenges from Asia and China. The Association executive have had talks with the club, who indicated that they will do their utmost to ensure the playing surface is fit for cricket to be played. Mr. Saunders apparently thinks that the boat, as delivered, was fit for the purpose for which it was intended. Under the Sale of Goods Act retailers must sell goods that are of a satisfactory quality, are accurately described on the packaging and are fit for their purpose. The van was fit for the purpose for which it was purchased. First, the food and drink had to be certified fit for human consumptio", "n. They spent at least another £7,000 making the launch watertight and fit for habitatio", "n. But up to 150 council workers based at the Fashion Corner council tax office were waiting to find out whether the building was fit for work. Meat which is not fit for consumption in the EU is now heading for South Africa. Vic representatives visited the Southern Cross shortly after Easter and found the first and second floors fit for habitatio", "n. However as long as the ship had lifeboats on board it was fit to travel. Synonymssuitable, good enough1.1 Having the requisite qualities or skills to undertake something competently. he felt himself quite fit for battlewith infinitive Ted was ghastly pale and fit to do no more than switch channels Example sentencesExamples Normally I do not drink at lunchtime because all I am fit for is a siesta; evening is a different matter &lt; g &gt;. He got in his van and drove, was clearly not in a fit state, and accepted now he made the wrong decisio", "n. If he is deemed by the court to not be fit and proper to operate the pub then we would look at reopening with a new tenant. And after 10 weeks in hospital, numerous complications and surgery, he was fit enough to return home. Neither of these men is stupid enough to believe that churches are fit to govern a secular society, unlike many of their junior colleagues. Even if he didn't betray his secret, he would never be deemed fit to return to work. Doctors will be regularly asked to demonstrate their competence, so that they are fit to practise throughout their lives. Now, does Professor Collins believe that a professor at his university is fit for his job if the professor lies in his research? Between now and the next general election we have to persuade millions of people up and down the country that this Conservative party is fit for government. If we can persuade a few more to stay on rather then retire if they are fit and able to do the job, then that is a good thing. In attempting to limit the damage by lying about his own words, he has merely raised the most serious question of all: whether or not he is fit for public office. That must go as far as not working excessive hours and being fit for the job they are doing at the time. New aspects require policies to ensure that rail personnel are fit for duty and, in particular, that they are not impaired by drugs or alcohol. A Member who no longer thinks his party is fit to govern should in conscience resign from that party, and the party should be able to expel him if he doesn't. He was quite useless here and the only thing he was fit for was to run things like Hampton Court entertainment… They will make rings round him. William Hague hopes to use this week's Conservative conference to prove he is fit for government. And those who would seek to give us that kind of politics are very happy to indulge the patronising fantasies of those who think it is all we are fit for. But does taking a certificate guarantee that someone will be fit for purpose? Luckily, the doctor in charge kept on giving her a chit that she was fit and able to work although she was not. It's right to question, as the Royal Gazette does today, whether such gross negligence means the Government is fit to gover", "n. Synonymscompetent, able, capable1.2 Suitable and correct according to accepted social standards. a fit subject on which to correspond Example sentencesExamples How could any Court of Review determine whether leave ought to be given or not without hearing and determining upon the hearing whether it was a fit case for an appeal? But religion is a private matter, and thus not a fit subject for an inaugural address. While the results demonstrated an abundance of creativity in the audience, not all of the sculptures would be fit for public display! Many former stars say it is not a fit subject for the soap. It is not for the Speaker to judge whether it is fit and proper for a Minister to have access to official informatio", "n. The concept of the early modern period ", "also enabled an exploration of topics and subjects not previously thought fit for consideration in relation to the Renaissance. What objective criteria decide what is fit to print? Synonymssuitable, good enough1.3informal with infinitive (of a person or thing) having reached such an extreme condition as to be on the point of doing the thing specified. he baited even his close companions until they were fit to kill him Example sentencesExamples Allen's eyeballs looked fit to pop out of his head on several occasions as he exhorted his players. The water hurt his nose and stung his lungs and he felt fit to burst. Rhyann looked fit to kill, but it was nothing compared to Gavin's anger when Alex had first fallen under. We were both fit to explode but managed to share a peanut butter and chocolate cheesecake. He is so excited about his aspiration that his bubble is fit to burst. Synonymsready, prepared, on the point of, set, all set, in a fit state, primed, disposed, likely, about1.4informalReady. well, are you fit? Example sentencesExamples Are you fit then to return to the lecture? Now just put on these boots and you're fit to go!2In good health, especially because of regular physical exercise. figurative the measures would ensure a leaner, fitter company I swim regularly to keep fit Example sentencesExamples Being as fit and healthy as possible maximises the chances of a healthy pregnancy. The 13-mile run may still be three months away but participants are being urged to get in training now to ensure they are fit for the event. The ecologically sound version of working out involves joining in with conservation work to get fit and help the environment at the same time. He appreciates how fortunate he is to be fit and able to meet such a challenge. He is prone to being overweight, to having a dodgy knee, to not being able to stay fit for a full seaso", "n. People who are physically fit are happier, healthier and more productive than those who are not. The only way to get fit is to make exercise a regularly scheduled part of every week, even every day. But we can at least keep ourselves physically fit and healthy, capable of working tirelessly for ourselves and others. Being always on the move, they are a very fit and strong people. You have to be fit to play competitively, and all younger players are competitive. A Rossendale councillor has taken on a mammoth training regime to get fit for the ultimate challenge - a trek to Everest Base Camp. Whisper it, but some players on the circuit are even less fit than your average county cricketer. Research has shown that most of us regularly over-estimate how fit we are and how much real physical activity we do. Football isn't just about committing yourself to training and being fit. We think that we will get very fit by the years end. A healthy body is one that is strong, flexible and aerobically fit. Dancing is great fun and a great way to keep fit during the winter months. For me being physically fit is beneficial as it helps with my mental capacities when I'm driving. Volunteers will need to be fit and will be able to make their own way to Tatton Park. Would you like to become fit without the pounding and perspiration of an aerobic class or a gym? Synonymshealthy, well, in good health2.1British informalSexually attractive; good-looking. Example sentencesExamples Who is that guy? Oh he's so fit! Some really fit guy wearing a gorgeous top came wandering down the stairs. I have got a girlfriend from college but I have recently been introduced to a really fit girl through a friend of mine. Go and chat up her fit friend!verbfitfɪt[with object]1Be of the right shape and size for. those jeans still fit meno object the shoes fit better after being stretched Example sentencesExamples Another approach is to take a shirt that fits you perfectly and determine the distance between the middle of its collar button to the far end of the buttonhole. Try shoes on both feet and buy the size that best fits the larger foot. We have a large range of picture frames of all shapes and sizes to fit any photo, from a back yard snapshot to a professional portrait or even a personal artwork. Although many fire guards can be adjusted to fit a range of widths, check that the guard you buy is suitable for your style of fire and make sure that it is firmly secured. A visible callus that forms on the feet is known as a corn and usually results from shoes that do not fit properly. The three-point adjustable strap adjusts to fit all heads and helmets. She looks sleek in a beige, almost flesh-tone, summer dress and a slightly darker cardigan that fits her like a sealski", "n. I find that a lot of professional clothing with a tailored look doesn't fit me well. The trousers were a little long in the leg but other than that the clothes fit fine. Lydia wore her favorite blue dress, one from Maude's trunk, which Joscelyn had graciously altered to fit her. It was ", "also clear to me as the viewer that the equipment she was using was not sized to fit her. I looked around and grabbed a pair of trousers that actually fit me and a purple shirt, and ", "also some undergarments. To preclude gloves from wrapping around the bar, you have to choose the size that fits you well - not too tight, loose, small or long - just the right size. None of my size 10 clothes fitted me anymore, I was upset and became depressed just because my clothes size had gone up one level. My jeans from Italy, for example, have no hope of fitting me any more. The crisp polo shirt and slacks fit him perfectly, setting off his muscular arms and blue eyes. You can look amazingly sexy in beautiful plus size dresses that actually fit you and flatter your figure. And just where did he think I was going to get something to fit a child that size? Don't get yourself depressed searching for items of clothing that will fit you perfectly off the rack. Forget about size when choosing clothes and choose something that fits well regardless of size and that's comfortable on you. Synonymsbe the correct size, be the right size, be the correct size for, be the right size for, be big enough, be small enough, be big enough for, be small enough for, be the right shape, be the right shape for1.1usually be fitted for Try clothing on (someone) in order to make or alter it to the correct size. she was about to be fitted for her costume Example sentencesExamples The preparations for the engagement event consisted mostly of Marigold and her mother being fitted for gowns at the Earl's expense. Once I was fitted for my suit they told me it would be done by next week so I'd have enough time to qualify for the race. One of the most embarrassing moments in Deirdre's life was when she had to be fitted for protective clothing at work and they had to use two tape measures end to end to go round her. Others may have looked at it and decided it was time he was fitted for one of those jackets with the long sleeves that tie round the back. When you are fitted for your tuxedo a small deposit is usually required. The only scars from that 20-minute procedure are four barely visible dots around his head where he was fitted for a protective metal halo.1.2no object, with adverbial of place Be of the right size, shape, or number to occupy a particular position or place. Angela says we can all fit in her car Example sentencesExamples Originally a pasty, it developed its characteristic shape to fit better into huntsmen's saddlebags. Cut the slices of bread to a size that will fit inside your soup bowls, and toast them until dark brown on both sides. The shape of the carton fits more conveniently into home freezers. The slightly ovoid shape fits nicely in your hand. These planes are normally characterized by their diminutive size so as to fit comfortably in their user's small hands. Most of the eight Democratic candidates fit snugly into two categories. The radio body fits nicely in a jersey pocket. Amazingly, the hermit crab's body is asymmetrically twisted so that it fits snugly into the shape of the shell. Unlike other computers, PDAs are lightweight - designed to fit comfortably in a jacket pocket. The first prototype is small enough to fit in the palm of your hand. Science doesn't usually fit neatly into categories of all good or all bad. Picking the strategy that best fits into your schedule will help you maintain optimum weed management. Drain the water and set the spears on a plate, and cut them to size so they can fit on top of the muffins without drooping over the sides too much. Spar have come up with ingenious pocket Eco Bag which is a small, wallet size bag that fits neatly into a pocket or handbag so you're always armed and ready to shop. Actually, most of the girls in the drama club fit into this category.2Fix or put (something) into place. they fitted smoke alarms to their home Example sentencesExamples Inspectors will look at whether the correct equipment is being used, work platforms are properly installed and scaffolding is securely fitted. So he came round, and we positioned it and fitted the great drive-belt. These could serve as additional bedrooms and there is plumbing in place to fit a shower room in one of them. They pronounced the pipework ‘impeccably installed’, and recommended we fit an independent water supply. Work began on Monday to fit a disabled lift, due to be installed in May but delayed because the Italian manufacturer wasn't able to supply it until recently. The announcement comes just a week after rail bosses responsible for redeveloping the railway station got round to fitting new clocks on the platforms, more than 18 months after the station revamp was completed. Selby fire station has previously held car-seat open days, showing people how to properly fit child seats in cars. Mr Sanderson said one of the most successful schemes helped the victims of burglary being targeted a second time by swiftly fitting new locks on doors and windows. If not, why didn't you call a local Sky Installation Engineer to fit your dish? One Sunday our neighbour says could I please ask our landlord to fit draft excluders on our front door. Adam, our installer, was fitting some other stuff and left to go on to another job whilst I changed 16 of the handles. A restraining net is fitted as standard, as is a decent luggage cover. Power assisted steering, fitted as standard, makes manoeuvring the vehicle effortless. With his help, she has transformed the one-bed house in Crawley, West Sussex, fitting a new bathroom, installing storage, laying flooring and doing plenty of rewiring. So fitting sensors in the rear rooms of the house and in the hallway is often considered sufficient for the ground floor. After a medical centre in West Bowling was targeted by vandals, fences were fitted out of the centre's own funds. A council spokesman said today there was no council policy of fitting child locks on windows in York, although it did fit locks on replacement windows as a crime prevention measure. Police are warning homeowners to fit strong locks on sheds and garages, cover windows with old curtains, install an expensive but noisy alarm and ensure that the household insurance policy covers the value of shed contents. Police have fitted new locks on the windows and doors since the break-i", "n. The team can fit grab-rails on staircases and in doorways, fix defective carpets or floor coverings, remove trailing wires and generally reduce trip hazards. Synonymslay, put in place, put in position, position, place, fix, insert2.1often be fitted with Provide (something) with a particular component or article. most tools can be fitted with a new handle Example sentencesExamples The traffic car was fitted with child locks in the rear to prevent people escaping. It is understood the vehicle used by the gang was ", "also fitted with false number plates. The massive bike was fitted with a stereo and a foghorn to attract the maximum amount of attentio", "n. The cars are all left hand drive and had not yet been fitted with tracking devices. The room is fitted with special low lighting and window blinds to allow fragile works to be displayed. Make sure you lock windows and doors, which should be fitted with security deadlocks Fire chiefs yesterday said that lives could have been saved if the house had been fitted with a smoke alarm. Their front door was fitted with a Yale lock, two bolts and a security chai", "n. The coach was fitted with lap belts but parents are concerned they are inadequate to protect childre", "n. She called for all new properties to be fitted with meters so people were aware how much water they were using. Her cot is fitted with a sleep monitor that sounds an alarm if her breathing stops. The car was fitted with a roll cage and sports seats and drivers had to wear crash helmets and be strapped i", "n. Each table is fitted with a grill for you to cook the deliciously marinated meat. It is hoped the park will be fitted with floodlights and CCTV cameras for extra security. The café has been fitted with a new kitchen and outside seating with parasols. Typically, a motorcycle may be fitted with a horn that would usually go on a jeep or a truck. The airship will be fitted with cameras and infra-red equipment for night visio", "n. The kitchen has been fitted with new equipment and furniture will be replaced throughout the pub. The bag is fitted with a special alarm programmed to go off if someone reaches inside. She claims it was sheer luck that the blaze was caught in time, because her kitchen was not fitted with a smoke alarm. Synonymsequip, provide, supply, fit out, rig out, furnish, outfit, endow2.2 Join or cause to join together to form a whole.with object many physicists tried to fit together the various pieces of the puzzleno object it took a while to figure out how the confounded things fit together Example sentencesExamples When these were fitted together, they were hammered to make the joint watertight. He wished to cut them into as few pieces as possible so that they could be fitted together, without waste, to form a perfectly square table-top. There is no doubt that a certain consistency of outlook is present throughout, but the pieces do not always fit together well. As the pieces start to fit together the characters' dilemmas begin to take on a different shape. Instead, when you crack open this thing, all you get are busted pieces that don't fit together and don't work. The limestone is produced in special moulds and can be fitted together like a jigsaw to form any configuratio", "n. It was a place where two separate pieces of metal fitted together, like the barrel of a lock. Understanding how the three pieces fit together and what to do about them is a big part of choosing the right project and getting it done. What they didn't know is when or if the pieces would fit together. Extra fuel tanks may need to be fitted together with spare jerricans. Finding which pieces fit together in order make the complete picture is one of the more difficult tasks. Seven remain, which can be fitted together with only small gaps. These are fitted together and built up as you need them, providing a versatile solution to changing needs. The little pieces fit together, each part representing something small but vital. Once inside you can see how the upper and lower receivers have been carefully fitted together by hand. You know what the picture's going to look like at the end, but you want to see how all the pieces will fit together. Currently sheet metal barriers were being fitted together behind the factory. The seven pieces will never fit together to make any sense. Drawing a plan forces you to think through your project from beginning to end, what you are going to need and how your are going to get the pieces to fit together. It just brings everything into balance and all the pieces fit together. Synonymsjoin, connect, put together, piece together, attach, unite, link, splice, fuse, weld3Be in agreement or harmony with; match. the punishment should fit the crime Example sentencesExamples Dewey observed that this model does not fit what we know about childre", "n. Take a volunteer position that fits your interest, and may even enhance your career goals. The Edmonton author, publisher, and former social worker has fit that description for at least 25 years. In some respects the description had fitted Naylor, while in others it did not. I'd seen her once or twice at school, and she fitted the description Travis gave me of her perfectly. Unfortunately, no candidate perfectly fits this descriptio", "n. After a while, a newcomer walks in who perfectly fits the description of the spy her husband gave to her. Fast, simple and delicious, these dishes can be adjusted to fit your schedule, grocery list and occasio", "n. The descriptions the woman gave fitted those of the two girls Tessa had seen before. I haven't met anyone who fits the commonly held definition of sane. I certainly don't fit any of the ideals presented in the media. It was clear that none of the six men who claimed to be at the warehouse could possibly fit the police officer's descriptio", "n. He said: ‘It happened in the city centre and the man fits the same physical descriptio", "n.’ Canada's judges have moved boldly into the public policy arena, shaping laws to fit their own peculiar biases and ideologies. Ten minutes later there were a number of sightings close to the Brittons' home of a man fitting Mark Hobson's descriptio", "n. We can and should form opinions about guilt or innocence in the same as we form other opinions, by choosing the position that best fits the available evidence. She has adjusted her services to fit the customer's budget. However modern scholars claim that Newton sometimes adjusted his calculations to fit his theories. So if you fit any of these descriptions and are interested in auditioning, the producers would love to see you. I learned that the job description was written to fit the individual whom the department wanted to hire.3.1 (of an attribute, qualification, or skill) make (someone) suitable to fulfill a particular role or undertake a particular task. an MS fits the student for a professional career Example sentencesExamples He regarded his own intellectual gifts and cast of mind as properly fitting him for the task. I was playing the part of Polonius - a part my mature years obviously fitted me for. His passion for lists, dates and details fits him well for this task. Dr Cherry's specialisation and experience fitted him ideally for involvement in the development of the project. One biographer assumes that he was a boy of somewhat ordinary talents that would fit him only for the mercantile trade. His freshness, his directness and his capacity for making connections with people both in person and on the television screen certainly fitted him for the task. Synonymsqualify, prepare, make ready, make suitable, prime, condition, train, coach, groom, tailornounfitfɪt1The particular way in which something, especially a garment or component, fits around or into something. the dress was a perfect fit Example sentencesExamples The dress was fabulous, a perfect fit, slim fitting with two thin shoulder straps and a more loose, flowing bottom part that ended just above the knee. All new windows offer a tight fit between components to limit the rate of infiltratio", "n. If you find a pair of black pants or a skirt that are the perfect fit, consider buying more than one pair. Again, I strongly encourage choosing pants with a drawstring or an elastic waistband for an easy fit. It means a lot to me; I didn't exchange it for the correct fit because I wanted the original one. Not every shirt or jeans will have a perfect fit for everybody. Perfect fit is accomplished when garments just skim the body, without pulling or sagging. I got up and borrowed a pair of Jon's jeans which were the perfect fit. The firm has developed mathematical algorithms to simulate fabric drape and garment fit. The pants feature a full elastic waistband and cuffs for a comfortable fit. The harness is adjusted on the shoulder and waist straps for a perfect fit. You might want to get your shirts altered at waist level to give them a slimmer fit. The pants have a roomy cargo pocket on the right leg and unhemmed cuffs so woman hunters can achieve the perfect fit. Is your saddle a correct fit and not put too far up the back. However, the shoulder seam plays a key role in the fit of garments that cover the upper body. Both the skirt and shirt were a perfect fit. Sometimes, you can help the fit of your garments by sewing these darts a little differently. A belt that doesn't have holes is even easier, as it's fully adjustable for a perfect fit. Despite the general lack of fit, the best fitting model seems to be the one-factor model. We look at clothing as an investment, so we consider the quality of a garment as well as the fit.1.1 The particular way in which a thing matches something else. a close fit between teachers' qualifications and their teaching responsibilities Example sentencesExamples A great deal of the power and impact of the preached Word comes from the fit between the preacher and the words being preached. There's a very good fit between the ideals of our two organisations. The band may be sore because there's a close fit between their own fan base and the kind of campus kids who have got into illegal downloading big time. It is ", "also a way to gain knowledge of what is a good fit or match for your personality type. The nurse must carefully examine the fit between the diagnosis and the client for whom it is intended. Marketing is a dynamic process of ensuring a close fit between the capabilities of an organization and the demands placed upon it by its external environment. Synonymscorrelation, correspondence, agreement, consistency, equivalence, match, similarity, resemblance, comparability, compatibility, affinity, concurrence1.2StatisticsThe correspondence between observed data and the values expected by theory. Example sentencesExamples Accurate measurements of these parameters could lead to a better fit of the theory to experiment. A smaller ratio score signifies good fit, and values near 2.0 are considered acceptable. The results indicate a good overall fit of the model. A thermal history involving two discrete episodes of heating and cooling clearly provides the best fit to the measured data. The greatest deviation from a good fit between the component figures occurs near the proximal end.Phrasesfit to be tiedinformal Very angry. Daddy was fit to be tied when I separated from Hugh Example sentencesExamples They clucked and fussed and were fit to be tied at the wanton waste they witnessed. When she learns from the doctor that she's not sick after all but sound as a dollar, she's fit to be tied. I listen to her set out her latest jargon-laden agenda for interfering in the lives and habits of British families, and after a few paragraphs I am afraid I am fit to be tied. We know that his family was fit to be tied with him during that time, and for good reaso", "n. Those wee ones love the man and are fit to be tied when it's time for him to leave. Synonymslivid, furious, angry, infuriated, irate, fuming, raging, seething, incensed, enraged, angered, beside oneself, wrathful, ireful, maddened, cross, annoyed, irritated, exasperated, indignantfit to bustinformal With great energy. they laughed fit to bust Example sentencesExamples Everywhere you go there's someone coughing fit to bust and looking miserable, or cross, or plain old-fashioned resigned to their fate. Algernon laughed sufficiently for the two of them, wheezing and hee-hee-heeing fit to bust, having to support himself on Simpson's shoulder. Already, his kitchen was full of brightly clad, bright-faced students talking fit to bust, helping themselves to coffee, and to stuff out of the pantry. The flower beds are brimming with rhododendrons, the birds are singing fit to bust. An hour later I woke from a vivid dream with my heart pounding away fit to bust. I get a face full of sherbet, in my eyes and up my nose and I'm coughing fit to bust. It might be that they have snow blizzards up in Scotland just now but down here we've got grass growing, buds budding, and, to my great delight, huge swathes of snowdrops, flowering fit to bust. I looked on in disbelief and her mother walked in and started screaming fit to bust. Now, late in the evening, it's blowing fit to bust outside. The brother she mentioned is laughing fit to bust.see (or think) fitConsider it correct or acceptable to do something. why did the company see fit to give you the job? Example sentencesExamples I am pretty shocked that you thought fit to send this email out today. Once it was confirmed that there was no further asbestos the site would be vested in the community, which could decide to use or dispose of it as they thought fit. I told the news editor he could break all the rules and do as he thought fit on the front page. You may add or subtract from my suggested text as you see fit, but please keep it polite. I have not had any academic training in film-making and planned the shots the way I thought fit. He needs to raise some money, so if you see fit, please make a donatio", "n. I am sure the learned trial judge felt she did her best to consider the arguments and rule as she saw fit, according to law. Over the next six months, consider all your career options and make changes as you see fit. The prime minister is free to do as he pleases when he sees fit. Feel free to choose more or less as you see fit, but please explain why you picked them.Phrasal Verbsfit in1(of a person) be socially compatible with other members of a group. he feels he should become tough to fit in with his friends Example sentencesExamples Early on, his drinking was linked to loneliness and an inability to fit in socially with his fellow players. I never fitted in with the cool kids, and trying to do so was making me unhappy as a teenager. What if he realized how little she fitted in with those he loved? I never fitted in with the Catholic community of my home. Does your teen have trouble fitting in at school? Other issues included feelings of social isolation, with students saying they had difficulties fitting in because of a culture clash between university and their home life. They may have poor social skills, have problems fitting in and probably cannot meet the expectations of their family or school. She was confident of fitting in socially but, during her first term, the workload caused a few concerns. On an endless search for what is needed to fit in and be socially acceptable, all sense of self is lost. Synonymsconform, be in harmony, belong, blend in1.1(of a thing) be in harmony with other things within a larger structure. produce ideas that fit in with an established approach Example sentencesExamples People were satisfied and extremely elated with the overall results, as they fitted in with the concept of a truly national party, even on face value. This fits in perfectly with the general social and economic policy of the SPD-Green government. He said the deals were ‘a good package’ and fitted in with their strategy of expanding on both sides of the Atlantic. Throughout the meal we were treated to a varied array of music which fitted in with the friendly atmosphere of the pub. This fitted in with the free trade approach of the time. Needless to say, the service was attentive, without being overbearing, and fitted in with the relaxed, classy atmosphere. The drive to increase access to universities fits in with New Labour pronouncements on social inclusion and the ilk. Helen Kidman, chairman of Ilkley Civic Society, said the guide was meant to inspire finer architecture that fitted in with the surrounding area. ‘We picked up the project because it was a good idea and because it fitted in with our health agenda,’ said a spokesma", "n. It was none the less an amusing portrayal, which fitted in with the high spirits of the evening if not into the household.1.2(of a person or thing) constitute part of a particular situation or larger structure. where do your sisters fit in? Example sentencesExamples She just wasn't fitting into his plan at all tonight. What I hope is that the coaching staff and my team-mates think that I'm steadily getting better as a player and fitting into the team. They are training very hard and have acquired a number of new players this year that are fitting into the team very well. We don't have any children of our own yet but I don't see how any child of ours would fit into such a situatio", "n. He has not been hampered by timidity or uncertainty, fitting into the side with calm assurance and revealing the extent of his ability. How do you see those alliances fitting into your long-term business plan? Where did you see yourself fitting into all that? It certainly fits into my plans to really look at mammals to understand birds better. Where do you see broadband and videostreaming fitting into your plans? He has been in tremendous form and is a fantastic talent who fits into Saints' future plans.fit someone/something in (or into)1Find room or have sufficient space for someone or something. can you fit any more books into the box? Example sentencesExamples The space inside seems too small to fit the elaborate furniture in the room. He only just fit his belongings into the room, cramming his clothes and most of his toys into the roll-out drawers and using the shelves for his books and stand-alone objects. There was not enough room to fit people in and no access for the disabled. There is enough room to fit the power cable in there, but I think a bit more space would make it easier for people with large hands to connect and disconnect the cable. I have been focusing on fitting my things into the very limited space this apartment affords. If your club/organisation is missing out on valuable publicity for vital fundraising events, we will always find space each week to fit you i", "n. I have, however, seen that people with slightly larger cars have experienced difficulty trying to fit their cars into the spaces. He disappeared without payment when he had completed the extraordinary task of fitting a spiral staircase into a space deemed impossibly small. Do you think that some people don't realise that there is a trade off, that okay if you don't want to have high-rise, you're going to have to take up more space to fit people in? And it could be the answer to the prayers of weekend shoppers who frequently struggle to fit their vehicles into precious spaces.1.1Succeed in finding time in a busy schedule to see someone or do something. you're never too busy to fit exercise into your life Example sentencesExamples The organisers were hoping the champion runner would fit the event into her busy schedule. This enabled her to decide when she worked and to fit it in around her busy schedule, which included picking up the kids from school. We've been looking to play this venue for ages, because it is such a good reputation, but either we were busy or they were busy and couldn't fit us i", "n. I tried to eat well and exercised when I could fit it into my busy life. Added to the business of choosing a topic, I must ", "also consider where I will fit the actual writing into my schedule. Johnny raised his eyebrows and shrugged, ‘I suppose I could fit you into my extremely busy schedule.’ How do you fit your workouts into such a busy schedule? I fitted my degree into a busy fire service life - it was a case of interrupted study for six years. Mr Simpson said on both occasions that he was unable to fit the openings into his busy calendar of events. Just follow our 10 steps for fitting a new activity into an already busy lifestyle, and you'll be sure to achieve success.fit someone/something out (or up)Provide with the necessary equipment, supplies, clothes, or other items for a particular situatio", "n. the cabin had been fitted out to a high standard Example sentencesExamples The next four weeks will be very busy fitting it out with furniture and equipment and making it clinically clea", "n. The properties can be fitted out at a cost of €15,000. These houses are fitted up in first-rate style, with gas and water laid o", "n. The cells are fitted out with televisions, sanitary and tea making facilities. He said doctors on duty will have a taxi available to them at all times to drive them to patients and the car will be fitted out with high quality medical equipment, like a mini-ambulance. The interior of both buildings are fitted out with the highest of standards of modern fittings. And the opportunity is not restricted to the able-bodied - the vessel is fitted out to accommodate people of all types of physical ability and disability. On leaving the school the boys were fitted out with clothes and given a bible and a Book Of Common Prayer. The bathrooms are fitted out in granite, oak and glass. The Learning and Skills Council spent £40,000 on refurbishing space at the station, fitting it out with six new computers with Internet access, printers, a digital camera and scanner. Synonymsequip, provide, supply, furnish, kit out, rig out, outfit, accoutre, array, stockfit someone upIncriminate someone by falsifying evidence against them. Example sentencesExamples We need people who have the skills to smell out somebody who comes along to try to fit us up. The confessor's claims that Stuart had been fitted up shook the parochial world of late 1950s Australia, a country just waking up to the notion of civil rights. He added: ‘After 27 years of being a thorn in the side of the police they fitted him up for something serious to put him away for a long time.’ That was a really pathetic job of fitting someone up. He admitted in early 1997 he was a prime suspect for the murder and conducted a series of interviews denying the charge and claiming police were out to fit him up. Your basic complaint is that they fitted you up for something you did not do. He told the Standing Committee on Legal and Constitutional Affairs he had been fitted up with the help of covert recordings for falsely accusing police officers of corruptio", "n. Thus does the movie have its cake and eat it: the drama and glamour of real mob violence, plus the sentimental suggestion that our Charlie was fitted up. Synonymsfalsely incriminate, entrap, fabricate charges against, fabricate evidence againstfit something onTry on (a garment). Example sentencesExamples I always fit the clothes on myself because that way I can feel the garment. They do offer you the opportunity to try and fit the clothes on you want.OriginLate Middle English: of unknown origi", "n. fit2nounfɪtfit1A sudden uncontrollable outbreak of intense emotion, laughter, coughing, or other action or activity. in a fit of temper he got coughing fits Example sentencesExamples The model is already facing claims from three former assistants who say she allegedly assaulted them in fits of rage. Alex is extremely intelligent with a propensity for fits of anger and uncontrollable rage. Yes, authors and creators can suffer fits of pique that can hurt the markets for secondary works. He is prone to fits of jealousy when he sees Primrose in the company of another male. He even had his own wife murdered in a fit of jealousy. He was suddenly seized by a fit of panic. Reane, in a fit of pure rage, slashed him across the back. He was frantically jealous, beat her, begged forgiveness in fits of remorse which became as repellent as his rage, and demanded she abort the pregnancy that came along in the second month of the hasty match. To leave now would suggest that he'd gone in a fit of pique. Her mother's fits of anger and the threats and beatings dealt to the girl resolve themselves in a grudging acceptance of the financial favours handed out by the lover. He lives off the earnings of his wife, Eva, succumbs to fits of paranoia and anger, engages in a desultory affair, hates the physical decay around him and is haunted by the prospect of death. In a fit of fury Calvert who was known to be a violent and irrational person burst into Smedleys home and hurled a heavy stone ornament at him. He acknowledges these fits of anger, such as the one that caused him to slay his wife with an ax, but he nevertheless shows some remorse for what he has done. Hearing such music does not usually send you into a fit of rage immediately. Lisa suffers from fits of sudden rage and unbearable fatigue. If at all he became angry, he would keep quiet rather than burst out in a fit of temper. Another time, while Elie is working at the electrical warehouse, he goes on one of his fits of rage and beats the boy. Synonymstantrum, fit of temper, outburst of anger, outburst of rage, frenzy, fury1.1 A sudden attack of convulsions and/or loss of consciousness, typical of epilepsy and some other medical conditions. he thought she was having a fit Example sentencesExamples Febrile convulsions are fits that sometimes happen in a child with a high temperature. The problems began after the woman was admitted to a medical ward in a local hospital suffering from fits and nightmares. Always phone for an ambulance if a fit lasts longer than five minutes. If the child has fits, they may be prescribed anticonvulsant drugs. One prisoner suffered an epileptic fit, and all the others shouted for help. Her ordeal began in November when she started having fits and convulsions despite no previous history of health problems. His frequent fits result in painful injuries, and medication has failed to control the traumatic episodes. He collapsed and died suddenly after not suffering an epileptic fit for several years. Concerned about the number of fits Slater was having, her doctor decided to operate to disconnect the right and left hemispheres of her brai", "n. She cannot work as she now suffers frequent, violent epileptic fits. It is believed he suffered a fit as he was watching a football match. At his parents' Flamborough home, his condition worsened, and he suffered several prolonged epileptic fits. Alexandra has cerebral palsy, is confined to a wheelchair and suffers from frequent epileptic fits. Julie Ann now suffers from daily fits and seizures. If the child has a history of epilepsy, it can be difficult to tell the difference between febrile convulsions and epileptic fits. Kirstie has had epilepsy since she was 18 and until recently suffered daily epileptic fits. His master and friends all said he was a clever, well-behaved boy, and had never been known to have fits, or walk in his sleep. Othello, told by Iago that Cassio has admitted sleeping with Desdemona, falls into a fit. During this state one keeps on getting epileptic fits without regaining consciousness in betwee", "n. Her sister, Lucy, suffers from cerebral palsy and epilepsy and is often treated in York Hospital for fits and chest infections. Synonymsconvulsion, spasm, paroxysm, seizure, attackPhraseshave (or throw) a fitinformal Be very surprised or angry. my mother would have a fit if she heard that Example sentencesExamples I was in a line of folks standing behind a woman at the bookstore who was throwing a fit because the clerk could not find the copy of The Great Gatsby she'd called to reserve. Mother will be having a fit if she knows I'm sitting out in the cold air - for even though it seems warm she'll fuss. This hardly seems like the kind of thing to be throwing a fit about. The rental company is sent away by the filming crew and my friend's husband throws a fit. Better get a move on so mother doesn't throw a fit when I get back. His mother had a fit, so they married again on New Year's Day 1937, this time with the family present. If people don't want to listen to what he wants to listen to, he throws a fit. They were used to him throwing a fit when he was in bad mood. You know my mother will throw a fit if she sees me like this. My mother would have a fit if she knew I spent a lot of time at Deane's.in fits (of laughter)informal Highly amused. he had us all in fits Example sentencesExamples Both the staging and acting are universally superb and we were in fits of laughter throughout. Eventually, after half an hour rolling around on the floor in fits of laughter, I managed to regain my composure. Peter had one of the locals in fits of laughter when he was doing a line dance. His quick wit and confident delivery had the audience in fits of laughter. For starters, I was in fits of laughter at the sight of him, and his swearing and shouting just made me worse. We collapsed in fits, the tutor had overheard and was almost wetting herself, and the 5 others were demanding to know what we'd said. The rest of us collapsed in fits of laughter at poor old Dave. There was a time when circus was a popular form of entertainment - with acrobats and bold ring-masters to whose crack of the whip wild animals played awesome tricks and the clowns left packed audiences in fits. At one point, she had the audience in fits. Once we were out of harm's way, we all ended up breaking down in fits of uncontrollable laughter - partly to relieve the tension of the near-miss situation, but mostly because of the absurdity of what had just happened.in (or by) fits and startsWith irregular bursts of activity. the machine tends to go forward in fits and starts Example sentencesExamples It was built in 1961, and it's been renovated in fits and starts, so it's sort of an architectural Frankenstei", "n. Like my wife's slimming programme, this year's harvest is going in fits and starts, punctuated by incredibly hot days of activity and frustrating rest periods. I've started adding mine, but it'll be done in fits and starts… All too often, science progresses in fits and starts, re-examining data, reinterpreting evidence - a path that can be hard to accept in medicine, when answers are needed now. Progress has come in fits and starts and is still fragile. However, like in any sport, those who play well throughout the whole contest - not just in fits and starts - more often than not end up victorious. The improvement came slowly, sporadically, in fits and starts. The poetry is moving forward in fits and starts. The Roman occupation of Britain advanced in fits and starts with the occasional disaster - the bloody revolt of Queen Boadicea in 61 AD is the best known example. We played in fits and starts and never really clicked and opened up, but we're happy with the points. Synonymsspasmodically, intermittently, sporadically, erratically, irregularly, interruptedly, fitfully, haphazardly, on and off, off and on, now and then, now and againOriginOld English fitt ‘conflict’, in Middle English ‘position of danger or excitement’, ", "also ‘short period’; the sense ‘sudden attack of illness’ dates from the mid 16th century. fit3(", "also fytte)nounfɪtfitarchaic A section of a poem. Example sentencesExamples Percy has written a long ballad in many fits: it is pretty enough. When the knight is introduced in a later fytte of the poem, he is called Sir Richard-at-the-Lee. The balance of this first fytte consists mostly of lengthy dialogue detailing the knight's impoverishment.OriginOld English fitt, perhaps the same word as fit, or related to German Fitze ‘skein of yarn’, in the obsolete sense ‘thread with which weavers mark off a day's work’.", "adj.1 phr. phr.", "v. nou", "n.1 phr. nou", "n.2"]}, {"dict": "Oxford5000", "values": ["fit inSee fit1fit someone/something in (or into)See fit1fit1 adjectivefittest, fitter fɪtfɪt1predicative Of a suitable quality, standard, or type to meet the required purpose. the house was not fit for human habitationwith infinitive is the water clean and fit to drink? Example sentencesExamples The Roadmen's cottages have been used for no more than rough storage for some years and would require considerable work before they were fit for habitatio", "n. Regulations requiring that the houses be deemed fit for habitation have been waived so that they can move i", "n. Vic representatives visited the Southern Cross shortly after Easter and found the first and second floors fit for habitatio", "n. The Association executive have had talks with the club, who indicated that they will do their utmost to ensure the playing surface is fit for cricket to be played. However as long as the ship had lifeboats on board it was fit to travel. But up to 150 council workers based at the Fashion Corner council tax office were waiting to find out whether the building was fit for work. Look at some of the buildings, run down and no longer fit for purpose. First, the food and drink had to be certified fit for human consumptio", "n. He pronounced them fit for consumption, upon which we all fell to them hungrily. Nothing can enter these kitchens that isn't deemed fit for human consumptio", "n. Under the Sale of Goods Act retailers must sell goods that are of a satisfactory quality, are accurately described on the packaging and are fit for their purpose. Mr. Saunders apparently thinks that the boat, as delivered, was fit for the purpose for which it was intended. But brains from younger animals will still be considered fit for human consumptio", "n. I contacted a wine merchant in London and told him I wanted to buy some that would be fit for drinking in ten years time. The chancellor's upbeat pre-budget report hammered home the message that the economy will be fit to meet challenges from Asia and China. Perhaps the trauma of that August day, when he was forced to spend so many hours in an outfit not fit for any particular athletic activity was just too much for him. Meat which is not fit for consumption in the EU is now heading for South Africa. The van was fit for the purpose for which it was purchased. He says that the property is not fit for human habitation and is in serious disrepair. They spent at least another £7,000 making the launch watertight and fit for habitatio", "n. Synonymssuitable, good enoughrelevant, pertinent, apt, appropriate, suited, apposite, apropos, -worthyfitting, befitting, proper, due, seemly, decorous, decent, right, correctFrench comme il fautarchaic meet1.1 Having the requisite qualities or skills to undertake something competently.with infinitive the party was fit to govern Example sentencesExamples Neither of these men is stupid enough to believe that churches are fit to govern a secular society, unlike many of their junior colleagues. If he is deemed by the court to not be fit and proper to operate the pub then we would look at reopening with a new tenant. It's right to question, as the Royal Gazette does today, whether such gross negligence means the Government is fit to gover", "n. And those who would seek to give us that kind of politics are very happy to indulge the patronising fantasies of those who think it is all we are fit for. A Member who no longer thinks his party is fit to govern should in conscience resign from that party, and the party should be able to expel him if he doesn't. He got in his van and drove, was clearly not in a fit state, and accepted now he made the wrong decisio", "n. New aspects require policies to ensure that rail personnel are fit for duty and, in particular, that they are not impaired by drugs or alcohol. He was quite useless here and the only thing he was fit for was to run things like Hampton Court entertainment… They will make rings round him. And after 10 weeks in hospital, numerous complications and surgery, he was fit enough to return home. Even if he didn't betray his secret, he would never be deemed fit to return to work. Doctors will be regularly asked to demonstrate their competence, so that they are fit to practise throughout their lives. Now, does Professor Collins believe that a professor at his university is fit for his job if the professor lies in his research? But does taking a certificate guarantee that someone will be fit for purpose? William Hague hopes to use this week's Conservative conference to prove he is fit for government. If we can persuade a few more to stay on rather then retire if they are fit and able to do the job, then that is a good thing. Between now and the next general election we have to persuade millions of people up and down the country that this Conservative party is fit for government. In attempting to limit the damage by lying about his own words, he has merely raised the most serious question of all: whether or not he is fit for public office. Luckily, the doctor in charge kept on giving her a chit that she was fit and able to work although she was not. That must go as far as not working excessive hours and being fit for the job they are doing at the time. Normally I do not drink at lunchtime because all I am fit for is a siesta; evening is a different matter &lt; g &gt;. Synonymscompetent, able, capableadequate, good enough, satisfactory, proficientready, prepared, qualified, trained, equipped, eligible, worthyinformal up to scratch1.2 Suitable and correct according to accepted social standards. a fit subject on which to correspond Example sentencesExamples It is not for the Speaker to judge whether it is fit and proper for a Minister to have access to official informatio", "n. Many former stars say it is not a fit subject for the soap. The concept of the early modern period ", "also enabled an exploration of topics and subjects not previously thought fit for consideration in relation to the Renaissance. What objective criteria decide what is fit to print? How could any Court of Review determine whether leave ought to be given or not without hearing and determining upon the hearing whether it was a fit case for an appeal? But religion is a private matter, and thus not a fit subject for an inaugural address. While the results demonstrated an abundance of creativity in the audience, not all of the sculptures would be fit for public display! Synonymssuitable, good enough1.3informal with infinitive Having reached such an extreme condition as to be on the point of doing the thing specified. he baited even his close companions until they were fit to kill him Example sentencesExamples Rhyann looked fit to kill, but it was nothing compared to Gavin's anger when Alex had first fallen under. The water hurt his nose and stung his lungs and he felt fit to burst. Allen's eyeballs looked fit to pop out of his head on several occasions as he exhorted his players. We were both fit to explode but managed to share a peanut butter and chocolate cheesecake. He is so excited about his aspiration that his bubble is fit to burst. Synonymsready, prepared, on the point of, set, all set, in a fit state, primed, disposed, likely, aboutinformal up for, geared up, psyched up1.4informalReady. well, are you fit? Example sentencesExamples Now just put on these boots and you're fit to go! Are you fit then to return to the lecture?2In good health, especially because of regular physical exercise. my family keep fit by walking and cycling figurative the measures would ensure a leaner, fitter company Example sentencesExamples He appreciates how fortunate he is to be fit and able to meet such a challenge. Being always on the move, they are a very fit and strong people. A healthy body is one that is strong, flexible and aerobically fit. Dancing is great fun and a great way to keep fit during the winter months. But we can at least keep ourselves physically fit and healthy, capable of working tirelessly for ourselves and others. Football isn't just about committing yourself to training and being fit. Whisper it, but some players on the circuit are even less fit than your average county cricketer. People who are physically fit are happier, healthier and more productive than those who are not. You have to be fit to play competitively, and all younger players are competitive. The ecologically sound version of working out involves joining in with conservation work to get fit and help the environment at the same time. A Rossendale councillor has taken on a mammoth training regime to get fit for the ultimate challenge - a trek to Everest Base Camp. Would you like to become fit without the pounding and perspiration of an aerobic class or a gym? The 13-mile run may still be three months away but participants are being urged to get in training now to ensure they are fit for the event. For me being physically fit is beneficial as it helps with my mental capacities when I'm driving. Volunteers will need to be fit and will be able to make their own way to Tatton Park. Research has shown that most of us regularly over-estimate how fit we are and how much real physical activity we do. Being as fit and healthy as possible maximises the chances of a healthy pregnancy. We think that we will get very fit by the years end. He is prone to being overweight, to having a dodgy knee, to not being able to stay fit for a full seaso", "n. The only way to get fit is to make exercise a regularly scheduled part of every week, even every day. Synonymshealthy, well, in good healthin good shape, in shape, in good trim, in trim, in good condition, in tip-top condition, in fine fettle, fighting fit, as fit as a fiddle, as fit as a flea, as strong as an oxstrong, robust, hale and hearty, sturdy, hardy, stalwart, lusty, vigorous, soundathletic, muscular, strapping, tough, powerful, ruggedinformal right as rain, husky, ripped, shreddedNorth American informal buff2.1British informalSexually attractive; good-looking. who's this fit babe? Example sentencesExamples I have got a girlfriend from college but I have recently been introduced to a really fit girl through a friend of mine. Who is that guy? Oh he's so fit! Go and chat up her fit friend! Some really fit guy wearing a gorgeous top came wandering down the stairs.verbfitted, fits, fitting fɪtfɪt[with object]1Be of the right shape and size for. those jeans still fit meno object the shoes fitted better after being stretched Example sentencesExamples We have a large range of picture frames of all shapes and sizes to fit any photo, from a back yard snapshot to a professional portrait or even a personal artwork. Another approach is to take a shirt that fits you perfectly and determine the distance between the middle of its collar button to the far end of the buttonhole. She looks sleek in a beige, almost flesh-tone, summer dress and a slightly darker cardigan that fits her like a sealski", "n. I find that a lot of professional clothing with a tailored look doesn't fit me well. Don't get yourself depressed searching for items of clothing that will fit you perfectly off the rack. It was ", "also clear to me as the viewer that the equipment she was using was not sized to fit her. Although many fire guards can be adjusted to fit a range of widths, check that the guard you buy is suitable for your style of fire and make sure that it is firmly secured. Forget about size when choosing clothes and choose something that fits well regardless of size and that's comfortable on you. A visible callus that forms on the feet is known as a corn and usually results from shoes that do not fit properly. The crisp polo shirt and slacks fit him perfectly, setting off his muscular arms and blue eyes. None of my size 10 clothes fitted me anymore, I was upset and became depressed just because my clothes size had gone up one level. The trousers were a little long in the leg but other than that the clothes fit fine. You can look amazingly sexy in beautiful plus size dresses that actually fit you and flatter your figure. My jeans from Italy, for example, have no hope of fitting me any more. Lydia wore her favorite blue dress, one from Maude's trunk, which Joscelyn had graciously altered to fit her. And just where did he think I was going to get something to fit a child that size? To preclude gloves from wrapping around the bar, you have to choose the size that fits you well - not too tight, loose, small or long - just the right size. Try shoes on both feet and buy the size that best fits the larger foot. I looked around and grabbed a pair of trousers that actually fit me and a purple shirt, and ", "also some undergarments. The three-point adjustable strap adjusts to fit all heads and helmets. Synonymsbe the right/correct size (for), be big/small enough (for), be the right shape (for)informal fit like a glove1.1usually be fitted for Try clothing on (someone) in order to make or alter it to the correct size. she was about to be fitted for her costume Example sentencesExamples One of the most embarrassing moments in Deirdre's life was when she had to be fitted for protective clothing at work and they had to use two tape measures end to end to go round her. The only scars from that 20-minute procedure are four barely visible dots around his head where he was fitted for a protective metal halo. Others may have looked at it and decided it was time he was fitted for one of those jackets with the long sleeves that tie round the back. When you are fitted for your tuxedo a small deposit is usually required. The preparations for the engagement event consisted mostly of Marigold and her mother being fitted for gowns at the Earl's expense. Once I was fitted for my suit they told me it would be done by next week so I'd have enough time to qualify for the race.1.2no object, with adverbial of place Be of the right size, shape, or number to occupy a particular place. Fiona says we can all fit in her car Example sentencesExamples Originally a pasty, it developed its characteristic shape to fit better into huntsmen's saddlebags. The radio body fits nicely in a jersey pocket. The first prototype is small enough to fit in the palm of your hand. Amazingly, the hermit crab's body is asymmetrically twisted so that it fits snugly into the shape of the shell. Actually, most of the girls in the drama club fit into this category. Cut the slices of bread to a size that will fit inside your soup bowls, and toast them until dark brown on both sides. Unlike other computers, PDAs are lightweight - designed to fit comfortably in a jacket pocket. These planes are normally characterized by their diminutive size so as to fit comfortably in their user's small hands. The shape of the carton fits more conveniently into home freezers. Most of the eight Democratic candidates fit snugly into two categories. Science doesn't usually fit neatly into categories of all good or all bad. Picking the strategy that best fits into your schedule will help you maintain optimum weed management. The slightly ovoid shape fits nicely in your hand. Drain the water and set the spears on a plate, and cut them to size so they can fit on top of the muffins without drooping over the sides too much. Spar have come up with ingenious pocket Eco Bag which is a small, wallet size bag that fits neatly into a pocket or handbag so you're always armed and ready to shop.2Install or fix (something) into place. they fitted smoke alarms to their home Example sentencesExamples One Sunday our neighbour says could I please ask our landlord to fit draft excluders on our front door. With his help, she has transformed the one-bed house in Crawley, West Sussex, fitting a new bathroom, installing storage, laying flooring and doing plenty of rewiring. They pronounced the pipework ‘impeccably installed’, and recommended we fit an independent water supply. The announcement comes just a week after rail bosses responsible for redeveloping the railway station got round to fitting new clocks on the platforms, more than 18 months after the station revamp was completed. Work began on Monday to fit a disabled lift, due to be installed in May but delayed because the Italian manufacturer wasn't able to supply it until recently. Mr Sanderson said one of the most successful schemes helped the victims of burglary being targeted a second time by swiftly fitting new locks on doors and windows. Police have fitted new locks on the windows and doors since the break-i", "n. If not, why didn't you call a local Sky Installation Engineer to fit your dish? The team can fit grab-rails on staircases and in doorways, fix defective carpets or floor coverings, remove trailing wires and generally reduce trip hazards. A restraining net is fitted as standard, as is a decent luggage cover. Police are warning homeowners to fit strong locks on sheds and garages, cover windows with old curtains, install an expensive but noisy alarm and ensure that the household insurance policy covers the value of shed contents. Power assisted steering, fitted as standard, makes manoeuvring the vehicle effortless. These could serve as additional bedrooms and there is plumbing in place to fit a shower room in one of them. After a medical centre in West Bowling was targeted by vandals, fences were fitted out of the centre's own funds. Adam, our installer, was fitting some other stuff and left to go on to another job whilst I changed 16 of the handles. Selby fire station has previously held car-seat open days, showing people how to properly fit child seats in cars. Inspectors will look at whether the correct equipment is being used, work platforms are properly installed and scaffolding is securely fitted. A council spokesman said today there was no council policy of fitting child locks on windows in York, although it did fit locks on replacement windows as a crime prevention measure. So he came round, and we positioned it and fitted the great drive-belt. So fitting sensors in the rear rooms of the house and in the hallway is often considered sufficient for the ground floor. Synonymslay, put in place/position, position, place, fix, insertarrange, adjust, shape2.1often be fitted with Provide (something) with a particular component or article. most tools can be fitted with a new handle Example sentencesExamples She claims it was sheer luck that the blaze was caught in time, because her kitchen was not fitted with a smoke alarm. Their front door was fitted with a Yale lock, two bolts and a security chai", "n. The traffic car was fitted with child locks in the rear to prevent people escaping. The café has been fitted with a new kitchen and outside seating with parasols. Her cot is fitted with a sleep monitor that sounds an alarm if her breathing stops. The massive bike was fitted with a stereo and a foghorn to attract the maximum amount of attentio", "n. The room is fitted with special low lighting and window blinds to allow fragile works to be displayed. Fire chiefs yesterday said that lives could have been saved if the house had been fitted with a smoke alarm. Each table is fitted with a grill for you to cook the deliciously marinated meat. The airship will be fitted with cameras and infra-red equipment for night visio", "n. The car was fitted with a roll cage and sports seats and drivers had to wear crash helmets and be strapped i", "n. It is hoped the park will be fitted with floodlights and CCTV cameras for extra security. Typically, a motorcycle may be fitted with a horn that would usually go on a jeep or a truck. The cars are all left hand drive and had not yet been fitted with tracking devices. It is understood the vehicle used by the gang was ", "also fitted with false number plates. The kitchen has been fitted with new equipment and furniture will be replaced throughout the pub. Make sure you lock windows and doors, which should be fitted with security deadlocks The bag is fitted with a special alarm programmed to go off if someone reaches inside. She called for all new properties to be fitted with meters so people were aware how much water they were using. The coach was fitted with lap belts but parents are concerned they are inadequate to protect childre", "n. Synonymsequip, provide, supply, fit out, rig out, furnish, outfit, endow2.2 Join or cause to join together to form a whole.no object their bodies fitted together perfectlywith object many physicists tried to fit together the various pieces of the puzzle Example sentencesExamples Extra fuel tanks may need to be fitted together with spare jerricans. What they didn't know is when or if the pieces would fit together. He wished to cut them into as few pieces as possible so that they could be fitted together, without waste, to form a perfectly square table-top. The little pieces fit together, each part representing something small but vital. The limestone is produced in special moulds and can be fitted together like a jigsaw to form any configuratio", "n. Seven remain, which can be fitted together with only small gaps. It just brings everything into balance and all the pieces fit together. You know what the picture's going to look like at the end, but you want to see how all the pieces will fit together. Finding which pieces fit together in order make the complete picture is one of the more difficult tasks. As the pieces start to fit together the characters' dilemmas begin to take on a different shape. Once inside you can see how the upper and lower receivers have been carefully fitted together by hand. The seven pieces will never fit together to make any sense. Currently sheet metal barriers were being fitted together behind the factory. It was a place where two separate pieces of metal fitted together, like the barrel of a lock. Instead, when you crack open this thing, all you get are busted pieces that don't fit together and don't work. These are fitted together and built up as you need them, providing a versatile solution to changing needs. Drawing a plan forces you to think through your project from beginning to end, what you are going to need and how your are going to get the pieces to fit together. There is no doubt that a certain consistency of outlook is present throughout, but the pieces do not always fit together well. When these were fitted together, they were hammered to make the joint watertight. Understanding how the three pieces fit together and what to do about them is a big part of choosing the right project and getting it done. Synonymsjoin, connect, put together, piece together, attach, unite, link, splice, fuse, weld3Be compatible or in agreement with; match. the landlord had not seen anyone fitting that description Example sentencesExamples Dewey observed that this model does not fit what we know about childre", "n. I'd seen her once or twice at school, and she fitted the description Travis gave me of her perfectly. He said: ‘It happened in the city centre and the man fits the same physical descriptio", "n.’ Take a volunteer position that fits your interest, and may even enhance your career goals. The Edmonton author, publisher, and former social worker has fit that description for at least 25 years. However modern scholars claim that Newton sometimes adjusted his calculations to fit his theories. The descriptions the woman gave fitted those of the two girls Tessa had seen before. Canada's judges have moved boldly into the public policy arena, shaping laws to fit their own peculiar biases and ideologies. After a while, a newcomer walks in who perfectly fits the description of the spy her husband gave to her. I learned that the job description was written to fit the individual whom the department wanted to hire. We can and should form opinions about guilt or innocence in the same as we form other opinions, by choosing the position that best fits the available evidence. I certainly don't fit any of the ideals presented in the media. So if you fit any of these descriptions and are interested in auditioning, the producers would love to see you. Ten minutes later there were a number of sightings close to the Brittons' home of a man fitting Mark Hobson's descriptio", "n. Unfortunately, no candidate perfectly fits this descriptio", "n. I haven't met anyone who fits the commonly held definition of sane. She has adjusted her services to fit the customer's budget. Fast, simple and delicious, these dishes can be adjusted to fit your schedule, grocery list and occasio", "n. It was clear that none of the six men who claimed to be at the warehouse could possibly fit the police officer's descriptio", "n. In some respects the description had fitted Naylor, while in others it did not.3.1 Be suitable or appropriate for. the punishment should fit the crime Example sentencesExamples But it must be for independent judges, not party political ministers, to decide what particular punishment fits what particular crime. To some no punishment fits such a crime, and these people honestly believe the murderers deserve no sympathy at all. Plus, they come in a variety of sizes and shapes to fit your specific needs. Unfortunately, regulations, society and employers' attitudes have not been adjusted to fit the new situatio", "n. The sound effects are used suitably and fit perfectly in the game. That means criminalizing behavior such as the spreading of viruses and setting up a punishment that fits the resulting economic damage. They can adjust their temperature to fit their surroundings. My dad suggested getting a one-level house and adjusting it to fit her needs, but she flat-out refused. The great vocal melody is still there, and the arrangement on the album fits the theme of the song. Are separate vacations in our future, or is there a destination that can fit us both? Synonymsbe appropriate to, suit, correspond toagree with, tally with, go with, be in agreement with, accord with, correlate to, be congruous with, be congruent with, concur with, dovetail with, conform to, be consonant with, match3.2 (of an attribute, qualification, or skill) make (someone) suitable to fulfil a particular role or undertake a particular task. an MSc fits the student for a professional career Example sentencesExamples His passion for lists, dates and details fits him well for this task. Dr Cherry's specialisation and experience fitted him ideally for involvement in the development of the project. His freshness, his directness and his capacity for making connections with people both in person and on the television screen certainly fitted him for the task. I was playing the part of Polonius - a part my mature years obviously fitted me for. He regarded his own intellectual gifts and cast of mind as properly fitting him for the task. One biographer assumes that he was a boy of somewhat ordinary talents that would fit him only for the mercantile trade. Synonymsqualify, prepare, make ready, make suitable, prime, condition, train, coach, groom, tailornounPlural fits fɪtfɪt1The particular way in which something, especially a garment or component, fits. the dress was a perfect fit Example sentencesExamples However, the shoulder seam plays a key role in the fit of garments that cover the upper body. It means a lot to me; I didn't exchange it for the correct fit because I wanted the original one. I got up and borrowed a pair of Jon's jeans which were the perfect fit. The pants have a roomy cargo pocket on the right leg and unhemmed cuffs so woman hunters can achieve the perfect fit. The dress was fabulous, a perfect fit, slim fitting with two thin shoulder straps and a more loose, flowing bottom part that ended just above the knee. If you find a pair of black pants or a skirt that are the perfect fit, consider buying more than one pair. The firm has developed mathematical algorithms to simulate fabric drape and garment fit. Not every shirt or jeans will have a perfect fit for everybody. Again, I strongly encourage choosing pants with a drawstring or an elastic waistband for an easy fit. Sometimes, you can help the fit of your garments by sewing these darts a little differently. Perfect fit is accomplished when garments just skim the body, without pulling or sagging. We look at clothing as an investment, so we consider the quality of a garment as well as the fit. The pants feature a full elastic waistband and cuffs for a comfortable fit. Is your saddle a correct fit and not put too far up the back. Both the skirt and shirt were a perfect fit. All new windows offer a tight fit between components to limit the rate of infiltratio", "n. The harness is adjusted on the shoulder and waist straps for a perfect fit. You might want to get your shirts altered at waist level to give them a slimmer fit. A belt that doesn't have holes is even easier, as it's fully adjustable for a perfect fit. Despite the general lack of fit, the best fitting model seems to be the one-factor model.1.1 The particular way in which things match. a close fit between teachers' qualifications and their teaching responsibilities Example sentencesExamples It is ", "also a way to gain knowledge of what is a good fit or match for your personality type. A great deal of the power and impact of the preached Word comes from the fit between the preacher and the words being preached. There's a very good fit between the ideals of our two organisations. The band may be sore because there's a close fit between their own fan base and the kind of campus kids who have got into illegal downloading big time. The nurse must carefully examine the fit between the diagnosis and the client for whom it is intended. Marketing is a dynamic process of ensuring a close fit between the capabilities of an organization and the demands placed upon it by its external environment. Synonymscorrelation, correspondence, agreement, consistency, equivalence, match, similarity, resemblance, comparability, compatibility, affinity, concurrence1.2StatisticsThe correspondence between observed data and the values expected by theory. Example sentencesExamples A thermal history involving two discrete episodes of heating and cooling clearly provides the best fit to the measured data. The greatest deviation from a good fit between the component figures occurs near the proximal end. The results indicate a good overall fit of the model. Accurate measurements of these parameters could lead to a better fit of the theory to experiment. A smaller ratio score signifies good fit, and values near 2.0 are considered acceptable.Phrasesfit for purpose(of an institution, facility, etc.) well equipped or well suited for its designated role or purpose. Example sentencesExamples A policy of armed neutrality with an emphasis on quality kit, fit for purpose. Validation means making sure the information the customer sends you is fit for purpose. Everyone except the government seems to have acknowledged that the assessment system is no longer fit for purpose. Product specification/quality not fit for purpose or meet regulatory standards. What is currently on offer is simply not fit for purpose, in terms of funding or scale. Murray is, at the moment, not fit for purpose. Five years in Iraq demonstrated that the vehicle was not fit for purpose. A high quality attractive, \"fit for purpose\" estate does not come cheap. The only approximation of the classification which could have been created would not have been fit for purpose. Quality is inextricably linked with being fit for purpose.fit for a king (or queen)Of very high quality. your bedroom is fit for a king Example sentencesExamples One can quickly whip up a meal fit for a king or quee", "n. You love luxury and sensual comforts such as silky satin sheets, robes fit for a king or queen and beautiful surroundings. We grill up a feast fit for a king. New windows, a brighter floral display, and an external paint job have left the place fit for a quee", "n. The city hall is taking steps to make an arts and cultural centre fit for a quee", "n.fit to be tiedinformal Very angry. Daddy was fit to be tied when I separated from Hugh Example sentencesExamples They clucked and fussed and were fit to be tied at the wanton waste they witnessed. We know that his family was fit to be tied with him during that time, and for good reaso", "n. I listen to her set out her latest jargon-laden agenda for interfering in the lives and habits of British families, and after a few paragraphs I am afraid I am fit to be tied. When she learns from the doctor that she's not sick after all but sound as a dollar, she's fit to be tied. Those wee ones love the man and are fit to be tied when it's time for him to leave. Synonymslivid, furious, angry, infuriated, irate, fuming, raging, seething, incensed, enraged, angered, beside oneself, wrathful, ireful, maddened, cross, annoyed, irritated, exasperated, indignantinformal mad, boiling, wild, hot under the collar, foaming at the mouth, steamed upfit to bustinformal With great energy. they laughed fit to bust Example sentencesExamples I get a face full of sherbet, in my eyes and up my nose and I'm coughing fit to bust. The flower beds are brimming with rhododendrons, the birds are singing fit to bust. It might be that they have snow blizzards up in Scotland just now but down here we've got grass growing, buds budding, and, to my great delight, huge swathes of snowdrops, flowering fit to bust. An hour later I woke from a vivid dream with my heart pounding away fit to bust. Everywhere you go there's someone coughing fit to bust and looking miserable, or cross, or plain old-fashioned resigned to their fate. Algernon laughed sufficiently for the two of them, wheezing and hee-hee-heeing fit to bust, having to support himself on Simpson's shoulder. I looked on in disbelief and her mother walked in and started screaming fit to bust. The brother she mentioned is laughing fit to bust. Already, his kitchen was full of brightly clad, bright-faced students talking fit to bust, helping themselves to coffee, and to stuff out of the pantry. Now, late in the evening, it's blowing fit to bust outside.see (or think) fitConsider it correct or acceptable to do something. why did the company see fit to give you the job? Example sentencesExamples Once it was confirmed that there was no further asbestos the site would be vested in the community, which could decide to use or dispose of it as they thought fit. Over the next six months, consider all your career options and make changes as you see fit. He needs to raise some money, so if you see fit, please make a donatio", "n. The prime minister is free to do as he pleases when he sees fit. Feel free to choose more or less as you see fit, but please explain why you picked them. You may add or subtract from my suggested text as you see fit, but please keep it polite. I told the news editor he could break all the rules and do as he thought fit on the front page. I am sure the learned trial judge felt she did her best to consider the arguments and rule as she saw fit, according to law. I am pretty shocked that you thought fit to send this email out today. I have not had any academic training in film-making and planned the shots the way I thought fit.Phrasal Verbsfit in1Be socially compatible with other members of a group. he feels he should become tough to fit in with his friends Example sentencesExamples What if he realized how little she fitted in with those he loved? Other issues included feelings of social isolation, with students saying they had difficulties fitting in because of a culture clash between university and their home life. I never fitted in with the cool kids, and trying to do so was making me unhappy as a teenager. She was confident of fitting in socially but, during her first term, the workload caused a few concerns. Does your teen have trouble fitting in at school? I never fitted in with the Catholic community of my home. They may have poor social skills, have problems fitting in and probably cannot meet the expectations of their family or school. Early on, his drinking was linked to loneliness and an inability to fit in socially with his fellow players. On an endless search for what is needed to fit in and be socially acceptable, all sense of self is lost. Synonymsconform, be in harmony, belong, blend inaccord, agree, concur, be in linebe assimilated intomatch, square withinformal click1.1Be in harmony with other elements in a situatio", "n. her project fitted in with the organization's general aims Example sentencesExamples Helen Kidman, chairman of Ilkley Civic Society, said the guide was meant to inspire finer architecture that fitted in with the surrounding area. Needless to say, the service was attentive, without being overbearing, and fitted in with the relaxed, classy atmosphere. The drive to increase access to universities fits in with New Labour pronouncements on social inclusion and the ilk. This fits in perfectly with the general social and economic policy of the SPD-Green government. Throughout the meal we were treated to a varied array of music which fitted in with the friendly atmosphere of the pub. He said the deals were ‘a good package’ and fitted in with their strategy of expanding on both sides of the Atlantic. ‘We picked up the project because it was a good idea and because it fitted in with our health agenda,’ said a spokesma", "n. It was none the less an amusing portrayal, which fitted in with the high spirits of the evening if not into the household. People were satisfied and extremely elated with the overall results, as they fitted in with the concept of a truly national party, even on face value. This fitted in with the free trade approach of the time.1.2Constitute part of a situation or larger structure. I don't think I fit into his plans for next season Example sentencesExamples Where did you see yourself fitting into all that? She just wasn't fitting into his plan at all tonight. What I hope is that the coaching staff and my team-mates think that I'm steadily getting better as a player and fitting into the team. It certainly fits into my plans to really look at mammals to understand birds better. He has not been hampered by timidity or uncertainty, fitting into the side with calm assurance and revealing the extent of his ability. Where do you see broadband and videostreaming fitting into your plans? They are training very hard and have acquired a number of new players this year that are fitting into the team very well. He has been in tremendous form and is a fantastic talent who fits into Saints' future plans. We don't have any children of our own yet but I don't see how any child of ours would fit into such a situatio", "n. How do you see those alliances fitting into your long-term business plan?fit someone/something in (or into)1Find room or have sufficient space for someone or something. can you fit any more water into the jug? Example sentencesExamples Do you think that some people don't realise that there is a trade off, that okay if you don't want to have high-rise, you're going to have to take up more space to fit people in? There was not enough room to fit people in and no access for the disabled. If your club/organisation is missing out on valuable publicity for vital fundraising events, we will always find space each week to fit you i", "n. And it could be the answer to the prayers of weekend shoppers who frequently struggle to fit their vehicles into precious spaces. I have been focusing on fitting my things into the very limited space this apartment affords. He only just fit his belongings into the room, cramming his clothes and most of his toys into the roll-out drawers and using the shelves for his books and stand-alone objects. The space inside seems too small to fit the elaborate furniture in the room. He disappeared without payment when he had completed the extraordinary task of fitting a spiral staircase into a space deemed impossibly small. There is enough room to fit the power cable in there, but I think a bit more space would make it easier for people with large hands to connect and disconnect the cable. I have, however, seen that people with slightly larger cars have experienced difficulty trying to fit their cars into the spaces.1.1Succeed in finding time in a busy schedule to see someone or do something. I could fit you in at 3.45 this afternoon Example sentencesExamples The organisers were hoping the champion runner would fit the event into her busy schedule. How do you fit your workouts into such a busy schedule? I fitted my degree into a busy fire service life - it was a case of interrupted study for six years. We've been looking to play this venue for ages, because it is such a good reputation, but either we were busy or they were busy and couldn't fit us i", "n. Johnny raised his eyebrows and shrugged, ‘I suppose I could fit you into my extremely busy schedule.’ Just follow our 10 steps for fitting a new activity into an already busy lifestyle, and you'll be sure to achieve success. Mr Simpson said on both occasions that he was unable to fit the openings into his busy calendar of events. I tried to eat well and exercised when I could fit it into my busy life. Added to the business of choosing a topic, I must ", "also consider where I will fit the actual writing into my schedule. This enabled her to decide when she worked and to fit it in around her busy schedule, which included picking up the kids from school.fit someone/something out (or up)Provide someone or something with the necessary equipment, clothes, or other items for a particular situatio", "n. the cabin had been fitted out to a high standard Example sentencesExamples The properties can be fitted out at a cost of €15,000. And the opportunity is not restricted to the able-bodied - the vessel is fitted out to accommodate people of all types of physical ability and disability. The next four weeks will be very busy fitting it out with furniture and equipment and making it clinically clea", "n. He said doctors on duty will have a taxi available to them at all times to drive them to patients and the car will be fitted out with high quality medical equipment, like a mini-ambulance. These houses are fitted up in first-rate style, with gas and water laid o", "n. The bathrooms are fitted out in granite, oak and glass. The Learning and Skills Council spent £40,000 on refurbishing space at the station, fitting it out with six new computers with Internet access, printers, a digital camera and scanner. On leaving the school the boys were fitted out with clothes and given a bible and a Book Of Common Prayer. The interior of both buildings are fitted out with the highest of standards of modern fittings. The cells are fitted out with televisions, sanitary and tea making facilities. Synonymsequip, provide, supply, furnish, kit out, rig out, outfit, accoutre, array, stockfit someone upIncriminate someone by falsifying evidence against them. Example sentencesExamples He admitted in early 1997 he was a prime suspect for the murder and conducted a series of interviews denying the charge and claiming police were out to fit him up. Thus does the movie have its cake and eat it: the drama and glamour of real mob violence, plus the sentimental suggestion that our Charlie was fitted up. He added: ‘After 27 years of being a thorn in the side of the police they fitted him up for something serious to put him away for a long time.’ The confessor's claims that Stuart had been fitted up shook the parochial world of late 1950s Australia, a country just waking up to the notion of civil rights. That was a really pathetic job of fitting someone up. We need people who have the skills to smell out somebody who comes along to try to fit us up. He told the Standing Committee on Legal and Constitutional Affairs he had been fitted up with the help of covert recordings for falsely accusing police officers of corruptio", "n. Your basic complaint is that they fitted you up for something you did not do. Synonymsfalsely incriminate, entrap, fabricate charges/evidence againstinformal frame, set upDerivativesfitlyadverb ˈfɪtliˈfɪtli Science since Darwin is fact upon fact, instance upon instance, experiment upon experiment, principle upon principle, which fitly joined together by some master mind may establish some great truth. Example sentencesExamples He runs fitly and trimly around the racetrack. In the beginning, it seemed to be a very happy marriage, since the two poets could inspire and parallel each other so fitly. She denied she was a strong-minded woman, but ‘if a word fitly spoken and in due season can be urged at a time like this, we should not withhold it.’ The vine has less beauty than many other trees, but it is exceedingly fruitful; fitly representing the low condition in which our Lord was in, yet bringing many sons to glory.OriginLate Middle English: of unknown origi", "n.Rhymesacquit, admit, backlit, bedsit, befit, bit, Brit, Britt, chit, commit, demit, dit, emit, flit, frit, git, grit, hit, intermit, it, kit, knit, legit, lickety-split, lit, manumit, mishit, mitt, nit, omit, outsit, outwit, permit, pit, Pitt, pretermit, quit, remit, retrofit, sit, skit, slit, snit, spit, split, sprit, squit, submit, transmit, twit, whit, wit, writ, zit fit2nounPlural fits fɪtfɪt1A sudden attack of convulsions and/or loss of consciousness, typical of epilepsy and some other medical conditions. the child had frequent fits Example sentencesExamples She cannot work as she now suffers frequent, violent epileptic fits. Kirstie has had epilepsy since she was 18 and until recently suffered daily epileptic fits. One prisoner suffered an epileptic fit, and all the others shouted for help. During this state one keeps on getting epileptic fits without regaining consciousness in betwee", "n. Julie Ann now suffers from daily fits and seizures. Alexandra has cerebral palsy, is confined to a wheelchair and suffers from frequent epileptic fits. If the child has fits, they may be prescribed anticonvulsant drugs. Othello, told by Iago that Cassio has admitted sleeping with Desdemona, falls into a fit. His master and friends all said he was a clever, well-behaved boy, and had never been known to have fits, or walk in his sleep. At his parents' Flamborough home, his condition worsened, and he suffered several prolonged epileptic fits. The problems began after the woman was admitted to a medical ward in a local hospital suffering from fits and nightmares. Concerned about the number of fits Slater was having, her doctor decided to operate to disconnect the right and left hemispheres of her brai", "n. His frequent fits result in painful injuries, and medication has failed to control the traumatic episodes. It is believed he suffered a fit as he was watching a football match. Her sister, Lucy, suffers from cerebral palsy and epilepsy and is often treated in York Hospital for fits and chest infections. He collapsed and died suddenly after not suffering an epileptic fit for several years. If the child has a history of epilepsy, it can be difficult to tell the difference between febrile convulsions and epileptic fits. Febrile convulsions are fits that sometimes happen in a child with a high temperature. Always phone for an ambulance if a fit lasts longer than five minutes. Her ordeal began in November when she started having fits and convulsions despite no previous history of health problems. Synonymsconvulsion, spasm, paroxysm, seizure, attack(fits) throesMedicine ictus2A sudden short period of uncontrollable coughing, laughter, etc. Example sentencesExamples One rehearsal we were supposed to look lovingly into each other's eyes but kept bursting into uncontrollable fits of laughter. Promptly she was seized by a sneezing fit agai", "n. They burst into a fit of giggles once again and collapsed onto the floor, each pulling their piece of the supposed French ensemble off and placing it on the floor between them. In fits of laughter, he told them I was his so", "n. He muffled his sudden fit of laughter, coughing rather violently to disguise it. Next she would burst into a fit of sobbing, wailing on and on about how good she had been to him. She kept erupting into fits of maniacal chuckles at some secret joke. Victor whacked her hard on the back and Antonia burst into a fit of coughs. And as he watched her in confusion, Shelley's chuckle turned into an uncontrollable, hysterical fit of laughter. The first day, she had burst into a fit of coughs after opening her mouth only having to have a fly swarm into her mouth. We where in the middle of singing when I had a coughing fit. Michelle burst into a fit of giggles, rolling back onto her tiny bunk. He ", "also has a name that reduces grown men to uncontrollable laughing fits at the slightest mentio", "n. The match flew by as the fans went through fits of shouting, singing, tension and passio", "n. Her eyes danced with amusement and then she burst into a fit of giggles. She seemed to dissolve into hysterical fits of laughter when she looked at me. She whispered this last part to me and we both had a fit of giggles. One of the kids standing behind him broke out into an uncontrollable fit of giggles. Francesca tried to cover her giggles by throwing a coughing fit. I'm sure you all have experienced those sudden fits of laughter that make you cry and make your sides hurt and you want to stop but you can't? Synonymsoutbreak, outburst, burst, attack, bout, spell, eruption, explosion, flare-up, blow-uprare access2.1 A sudden burst of intense emotio", "n. he had killed her in a fit of jealous rage Example sentencesExamples He acknowledges these fits of anger, such as the one that caused him to slay his wife with an ax, but he nevertheless shows some remorse for what he has done. Hearing such music does not usually send you into a fit of rage immediately. Lisa suffers from fits of sudden rage and unbearable fatigue. If at all he became angry, he would keep quiet rather than burst out in a fit of temper. He even had his own wife murdered in a fit of jealousy. Another time, while Elie is working at the electrical warehouse, he goes on one of his fits of rage and beats the boy. He lives off the earnings of his wife, Eva, succumbs to fits of paranoia and anger, engages in a desultory affair, hates the physical decay around him and is haunted by the prospect of death. To leave now would suggest that he'd gone in a fit of pique. He was suddenly seized by a fit of panic. He was frantically jealous, beat her, begged forgiveness in fits of remorse which became as repellent as his rage, and demanded she abort the pregnancy that came along in the second month of the hasty match. In a fit of fury Calvert who was known to be a violent and irrational person burst into Smedleys home and hurled a heavy stone ornament at him. Her mother's fits of anger and the threats and beatings dealt to the girl resolve themselves in a grudging acceptance of the financial favours handed out by the lover. Yes, authors and creators can suffer fits of pique that can hurt the markets for secondary works. Reane, in a fit of pure rage, slashed him across the back. Alex is extremely intelligent with a propensity for fits of anger and uncontrollable rage. The model is already facing claims from three former assistants who say she allegedly assaulted them in fits of rage. He is prone to fits of jealousy when he sees Primrose in the company of another male. Synonymstantrum, fit of temper, outburst of anger, outburst of rage, frenzy, furyinformal paddy, state, stressNorth American informal blowout, hissy fitrare ebullition, boutadeverbfitted, fits, fitting fɪt[no object]Have an epileptic fit. he started fitting uncontrollably Example sentencesExamples He had had no medication and so he was fitting four to five times a day. She fitted twice more on the way up, the second time slipping dangerously out of the chair at the top of some steps. He has been fitting every day for the last six days.Phrasesgive someone a fitinformal Greatly shock or anger someone. Example sentencesExamples My liking of jam and cheese sandwiches always gave my mum a fit. Should I go see Mr. Mercader tonight and give Brexton a fit, or go home? Emma has another tooth that came through Saturday night, but it gave her a fit! Bugs, and anything that crawled, used to give her a fit.have (or throw) a fitinformal Be very shocked or angry. Example sentencesExamples If people don't want to listen to what he wants to listen to, he throws a fit. I was in a line of folks standing behind a woman at the bookstore who was throwing a fit because the clerk could not find the copy of The Great Gatsby she'd called to reserve. You know my mother will throw a fit if she sees me like this. His mother had a fit, so they married again on New Year's Day 1937, this time with the family present. Mother will be having a fit if she knows I'm sitting out in the cold air - for even though it seems warm she'll fuss. This hardly seems like the kind of thing to be throwing a fit about. Better get a move on so mother doesn't throw a fit when I get back. They were used to him throwing a fit when he was in bad mood. My mother would have a fit if she knew I spent a lot of time at Deane's. The rental company is sent away by the filming crew and my friend's husband throws a fit.in fits (of laughter)informal Highly amused. he had us all in fits Example sentencesExamples At one point, she had the audience in fits. For starters, I was in fits of laughter at the sight of him, and his swearing and shouting just made me worse. His quick wit and confident delivery had the audience in fits of laughter. Once we were out of harm's way, we all ended up breaking down in fits of uncontrollable laughter - partly to relieve the tension of the near-miss situation, but mostly because of the absurdity of what had just happened. Peter had one of the locals in fits of laughter when he was doing a line dance. Eventually, after half an hour rolling around on the floor in fits of laughter, I managed to regain my composure. The rest of us collapsed in fits of laughter at poor old Dave. We collapsed in fits, the tutor had overheard and was almost wetting herself, and the 5 others were demanding to know what we'd said. There was a time when circus was a popular form of entertainment - with acrobats and bold ring-masters to whose crack of the whip wild animals played awesome tricks and the clowns left packed audiences in fits. Both the staging and acting are universally superb and we were in fits of laughter throughout.in (or by) fits and startsWith irregular bursts of activity. the economy was recovering in fits and starts Example sentencesExamples The poetry is moving forward in fits and starts. The improvement came slowly, sporadically, in fits and starts. The Roman occupation of Britain advanced in fits and starts with the occasional disaster - the bloody revolt of Queen Boadicea in 61 AD is the best known example. It was built in 1961, and it's been renovated in fits and starts, so it's sort of an architectural Frankenstei", "n. Progress has come in fits and starts and is still fragile. I've started adding mine, but it'll be done in fits and starts… All too often, science progresses in fits and starts, re-examining data, reinterpreting evidence - a path that can be hard to accept in medicine, when answers are needed now. Like my wife's slimming programme, this year's harvest is going in fits and starts, punctuated by incredibly hot days of activity and frustrating rest periods. We played in fits and starts and never really clicked and opened up, but we're happy with the points. However, like in any sport, those who play well throughout the whole contest - not just in fits and starts - more often than not end up victorious. Synonymsspasmodically, intermittently, sporadically, erratically, irregularly, interruptedly, fitfully, haphazardly, on and off, off and on, now and then, now and againOriginOld English fitt 'conflict', in Middle English 'position of danger or excitement', ", "also 'short period'; the sense 'sudden attack of illness' dates from the mid 16th century. fit3(", "also fytte)nounPlural fits fɪtfɪtarchaic A section of a poem. Example sentencesExamples The balance of this first fytte consists mostly of lengthy dialogue detailing the knight's impoverishment. When the knight is introduced in a later fytte of the poem, he is called Sir Richard-at-the-Lee. Percy has written a long ballad in many fits: it is pretty enough.OriginOld English fitt, perhaps the same word as fit2, or related to German Fitze 'skein of yarn', in the obsolete sense 'thread with which weavers mark off a day's work'.", "adj.1 phr. phr.", "v. nou", "n.1 phr. nou", "n.2fit1 adjectivefitfɪt1predicative Of a suitable quality, standard, or type to meet the required purpose. the meat is fit for human consumptionwith infinitive is the water clean and fit to drink? Example sentencesExamples I contacted a wine merchant in London and told him I wanted to buy some that would be fit for drinking in ten years time. Regulations requiring that the houses be deemed fit for habitation have been waived so that they can move i", "n. Look at some of the buildings, run down and no longer fit for purpose. But brains from younger animals will still be considered fit for human consumptio", "n. Nothing can enter these kitchens that isn't deemed fit for human consumptio", "n. He says that the property is not fit for human habitation and is in serious disrepair. Perhaps the trauma of that August day, when he was forced to spend so many hours in an outfit not fit for any particular athletic activity was just too much for him. He pronounced them fit for consumption, upon which we all fell to them hungrily. The Roadmen's cottages have been used for no more than rough storage for some years and would require considerable work before they were fit for habitatio", "n. The chancellor's upbeat pre-budget report hammered home the message that the economy will be fit to meet challenges from Asia and China. The Association executive have had talks with the club, who indicated that they will do their utmost to ensure the playing surface is fit for cricket to be played. Mr. Saunders apparently thinks that the boat, as delivered, was fit for the purpose for which it was intended. Under the Sale of Goods Act retailers must sell goods that are of a satisfactory quality, are accurately described on the packaging and are fit for their purpose. The van was fit for the purpose for which it was purchased. First, the food and drink had to be certified fit for human consumptio", "n. They spent at least another £7,000 making the launch watertight and fit for habitatio", "n. But up to 150 council workers based at the Fashion Corner council tax office were waiting to find out whether the building was fit for work. Meat which is not fit for consumption in the EU is now heading for South Africa. Vic representatives visited the Southern Cross shortly after Easter and found the first and second floors fit for habitatio", "n. However as long as the ship had lifeboats on board it was fit to travel. Synonymssuitable, good enough1.1 Having the requisite qualities or skills to undertake something competently. he felt himself quite fit for battlewith infinitive Ted was ghastly pale and fit to do no more than switch channels Example sentencesExamples Normally I do not drink at lunchtime because all I am fit for is a siesta; evening is a different matter &lt; g &gt;. He got in his van and drove, was clearly not in a fit state, and accepted now he made the wrong decisio", "n. If he is deemed by the court to not be fit and proper to operate the pub then we would look at reopening with a new tenant. And after 10 weeks in hospital, numerous complications and surgery, he was fit enough to return home. Neither of these men is stupid enough to believe that churches are fit to govern a secular society, unlike many of their junior colleagues. Even if he didn't betray his secret, he would never be deemed fit to return to work. Doctors will be regularly asked to demonstrate their competence, so that they are fit to practise throughout their lives. Now, does Professor Collins believe that a professor at his university is fit for his job if the professor lies in his research? Between now and the next general election we have to persuade millions of people up and down the country that this Conservative party is fit for government. If we can persuade a few more to stay on rather then retire if they are fit and able to do the job, then that is a good thing. In attempting to limit the damage by lying about his own words, he has merely raised the most serious question of all: whether or not he is fit for public office. That must go as far as not working excessive hours and being fit for the job they are doing at the time. New aspects require policies to ensure that rail personnel are fit for duty and, in particular, that they are not impaired by drugs or alcohol. A Member who no longer thinks his party is fit to govern should in conscience resign from that party, and the party should be able to expel him if he doesn't. He was quite useless here and the only thing he was fit for was to run things like Hampton Court entertainment… They will make rings round him. William Hague hopes to use this week's Conservative conference to prove he is fit for government. And those who would seek to give us that kind of politics are very happy to indulge the patronising fantasies of those who think it is all we are fit for. But does taking a certificate guarantee that someone will be fit for purpose? Luckily, the doctor in charge kept on giving her a chit that she was fit and able to work although she was not. It's right to question, as the Royal Gazette does today, whether such gross negligence means the Government is fit to gover", "n. Synonymscompetent, able, capable1.2 Suitable and correct according to accepted social standards. a fit subject on which to correspond Example sentencesExamples How could any Court of Review determine whether leave ought to be given or not without hearing and determining upon the hearing whether it was a fit case for an appeal? But religion is a private matter, and thus not a fit subject for an inaugural address. While the results demonstrated an abundance of creativity in the audience, not all of the sculptures would be fit for public display! Many former stars say it is not a fit subject for the soap. It is not for the Speaker to judge whether it is fit and proper for a Minister to have access to official informatio", "n. The concept of the early modern period ", "also enabled an exploration of topics and subjects not previously thought fit for consideration in relation to the Renaissance. What objective criteria decide what is fit to print? Synonymssuitable, good enough1.3informal with infinitive (of a person or thing) having reached such an extreme condition as to be on the point of doing the thing specified. he baited even his close companions until they were fit to kill him Example sentencesExamples Allen's eyeballs looked fit to pop out of his head on several occasions as he exhorted his players. The water hurt his nose and stung his lungs and he felt fit to burst. Rhyann looked fit to kill, but it was nothing compared to Gavin's anger when Alex had first fallen under. We were both fit to explode but managed to share a peanut butter and chocolate cheesecake. He is so excited about his aspiration that his bubble is fit to burst. Synonymsready, prepared, on the point of, set, all set, in a fit state, primed, disposed, likely, about1.4informalReady. well, are you fit? Example sentencesExamples Are you fit then to return to the lecture? Now just put on these boots and you're fit to go!2In good health, especially because of regular physical exercise. figurative the measures would ensure a leaner, fitter company I swim regularly to keep fit Example sentencesExamples Being as fit and healthy as possible maximises the chances of a healthy pregnancy. The 13-mile run may still be three months away but participants are being urged to get in training now to ensure they are fit for the event. The ecologically sound version of working out involves joining in with conservation work to get fit and help the environment at the same time. He appreciates how fortunate he is to be fit and able to meet such a challenge. He is prone to being overweight, to having a dodgy knee, to not being able to stay fit for a full seaso", "n. People who are physically fit are happier, healthier and more productive than those who are not. The only way to get fit is to make exercise a regularly scheduled part of every week, even every day. But we can at least keep ourselves physically fit and healthy, capable of working tirelessly for ourselves and others. Being always on the move, they are a very fit and strong people. You have to be fit to play competitively, and all younger players are competitive. A Rossendale councillor has taken on a mammoth training regime to get fit for the ultimate challenge - a trek to Everest Base Camp. Whisper it, but some players on the circuit are even less fit than your average county cricketer. Research has shown that most of us regularly over-estimate how fit we are and how much real physical activity we do. Football isn't just about committing yourself to training and being fit. We think that we will get very fit by the years end. A healthy body is one that is strong, flexible and aerobically fit. Dancing is great fun and a great way to keep fit during the winter months. For me being physically fit is beneficial as it helps with my mental capacities when I'm driving. Volunteers will need to be fit and will be able to make their own way to Tatton Park. Would you like to become fit without the pounding and perspiration of an aerobic class or a gym? Synonymshealthy, well, in good health2.1British informalSexually attractive; good-looking. Example sentencesExamples Who is that guy? Oh he's so fit! Some really fit guy wearing a gorgeous top came wandering down the stairs. I have got a girlfriend from college but I have recently been introduced to a really fit girl through a friend of mine. Go and chat up her fit friend!verbfitfɪt[with object]1Be of the right shape and size for. those jeans still fit meno object the shoes fit better after being stretched Example sentencesExamples Another approach is to take a shirt that fits you perfectly and determine the distance between the middle of its collar button to the far end of the buttonhole. Try shoes on both feet and buy the size that best fits the larger foot. We have a large range of picture frames of all shapes and sizes to fit any photo, from a back yard snapshot to a professional portrait or even a personal artwork. Although many fire guards can be adjusted to fit a range of widths, check that the guard you buy is suitable for your style of fire and make sure that it is firmly secured. A visible callus that forms on the feet is known as a corn and usually results from shoes that do not fit properly. The three-point adjustable strap adjusts to fit all heads and helmets. She looks sleek in a beige, almost flesh-tone, summer dress and a slightly darker cardigan that fits her like a sealski", "n. I find that a lot of professional clothing with a tailored look doesn't fit me well. The trousers were a little long in the leg but other than that the clothes fit fine. Lydia wore her favorite blue dress, one from Maude's trunk, which Joscelyn had graciously altered to fit her. It was ", "also clear to me as the viewer that the equipment she was using was not sized to fit her. I looked around and grabbed a pair of trousers that actually fit me and a purple shirt, and ", "also some undergarments. To preclude gloves from wrapping around the bar, you have to choose the size that fits you well - not too tight, loose, small or long - just the right size. None of my size 10 clothes fitted me anymore, I was upset and became depressed just because my clothes size had gone up one level. My jeans from Italy, for example, have no hope of fitting me any more. The crisp polo shirt and slacks fit him perfectly, setting off his muscular arms and blue eyes. You can look amazingly sexy in beautiful plus size dresses that actually fit you and flatter your figure. And just where did he think I was going to get something to fit a child that size? Don't get yourself depressed searching for items of clothing that will fit you perfectly off the rack. Forget about size when choosing clothes and choose something that fits well regardless of size and that's comfortable on you. Synonymsbe the correct size, be the right size, be the correct size for, be the right size for, be big enough, be small enough, be big enough for, be small enough for, be the right shape, be the right shape for1.1usually be fitted for Try clothing on (someone) in order to make or alter it to the correct size. she was about to be fitted for her costume Example sentencesExamples The preparations for the engagement event consisted mostly of Marigold and her mother being fitted for gowns at the Earl's expense. Once I was fitted for my suit they told me it would be done by next week so I'd have enough time to qualify for the race. One of the most embarrassing moments in Deirdre's life was when she had to be fitted for protective clothing at work and they had to use two tape measures end to end to go round her. Others may have looked at it and decided it was time he was fitted for one of those jackets with the long sleeves that tie round the back. When you are fitted for your tuxedo a small deposit is usually required. The only scars from that 20-minute procedure are four barely visible dots around his head where he was fitted for a protective metal halo.1.2no object, with adverbial of place Be of the right size, shape, or number to occupy a particular position or place. Angela says we can all fit in her car Example sentencesExamples Originally a pasty, it developed its characteristic shape to fit better into huntsmen's saddlebags. Cut the slices of bread to a size that will fit inside your soup bowls, and toast them until dark brown on both sides. The shape of the carton fits more conveniently into home freezers. The slightly ovoid shape fits nicely in your hand. These planes are normally characterized by their diminutive size so as to fit comfortably in their user's small hands. Most of the eight Democratic candidates fit snugly into two categories. The radio body fits nicely in a jersey pocket. Amazingly, the hermit crab's body is asymmetrically twisted so that it fits snugly into the shape of the shell. Unlike other computers, PDAs are lightweight - designed to fit comfortably in a jacket pocket. The first prototype is small enough to fit in the palm of your hand. Science doesn't usually fit neatly into categories of all good or all bad. Picking the strategy that best fits into your schedule will help you maintain optimum weed management. Drain the water and set the spears on a plate, and cut them to size so they can fit on top of the muffins without drooping over the sides too much. Spar have come up with ingenious pocket Eco Bag which is a small, wallet size bag that fits neatly into a pocket or handbag so you're always armed and ready to shop. Actually, most of the girls in the drama club fit into this category.2Fix or put (something) into place. they fitted smoke alarms to their home Example sentencesExamples Inspectors will look at whether the correct equipment is being used, work platforms are properly installed and scaffolding is securely fitted. So he came round, and we positioned it and fitted the great drive-belt. These could serve as additional bedrooms and there is plumbing in place to fit a shower room in one of them. They pronounced the pipework ‘impeccably installed’, and recommended we fit an independent water supply. Work began on Monday to fit a disabled lift, due to be installed in May but delayed because the Italian manufacturer wasn't able to supply it until recently. The announcement comes just a week after rail bosses responsible for redeveloping the railway station got round to fitting new clocks on the platforms, more than 18 months after the station revamp was completed. Selby fire station has previously held car-seat open days, showing people how to properly fit child seats in cars. Mr Sanderson said one of the most successful schemes helped the victims of burglary being targeted a second time by swiftly fitting new locks on doors and windows. If not, why didn't you call a local Sky Installation Engineer to fit your dish? One Sunday our neighbour says could I please ask our landlord to fit draft excluders on our front door. Adam, our installer, was fitting some other stuff and left to go on to another job whilst I changed 16 of the handles. A restraining net is fitted as standard, as is a decent luggage cover. Power assisted steering, fitted as standard, makes manoeuvring the vehicle effortless. With his help, she has transformed the one-bed house in Crawley, West Sussex, fitting a new bathroom, installing storage, laying flooring and doing plenty of rewiring. So fitting sensors in the rear rooms of the house and in the hallway is often considered sufficient for the ground floor. After a medical centre in West Bowling was targeted by vandals, fences were fitted out of the centre's own funds. A council spokesman said today there was no council policy of fitting child locks on windows in York, although it did fit locks on replacement windows as a crime prevention measure. Police are warning homeowners to fit strong locks on sheds and garages, cover windows with old curtains, install an expensive but noisy alarm and ensure that the household insurance policy covers the value of shed contents. Police have fitted new locks on the windows and doors since the break-i", "n. The team can fit grab-rails on staircases and in doorways, fix defective carpets or floor coverings, remove trailing wires and generally reduce trip hazards. Synonymslay, put in place, put in position, position, place, fix, insert2.1often be fitted with Provide (something) with a particular component or article. most tools can be fitted with a new handle Example sentencesExamples The traffic car was fitted with child locks in the rear to prevent people escaping. It is understood the vehicle used by the gang was ", "also fitted with false number plates. The massive bike was fitted with a stereo and a foghorn to attract the maximum amount of attentio", "n. The cars are all left hand drive and had not yet been fitted with tracking devices. The room is fitted with special low lighting and window blinds to allow fragile works to be displayed. Make sure you lock windows and doors, which should be fitted with security deadlocks Fire chiefs yesterday said that lives could have been saved if the house had been fitted with a smoke alarm. Their front door was fitted with a Yale lock, two bolts and a security chai", "n. The coach was fitted with lap belts but parents are concerned they are inadequate to protect childre", "n. She called for all new properties to be fitted with meters so people were aware how much water they were using. Her cot is fitted with a sleep monitor that sounds an alarm if her breathing stops. The car was fitted with a roll cage and sports seats and drivers had to wear crash helmets and be strapped i", "n. Each table is fitted with a grill for you to cook the deliciously marinated meat. It is hoped the park will be fitted with floodlights and CCTV cameras for extra security. The café has been fitted with a new kitchen and outside seating with parasols. Typically, a motorcycle may be fitted with a horn that would usually go on a jeep or a truck. The airship will be fitted with cameras and infra-red equipment for night visio", "n. The kitchen has been fitted with new equipment and furniture will be replaced throughout the pub. The bag is fitted with a special alarm programmed to go off if someone reaches inside. She claims it was sheer luck that the blaze was caught in time, because her kitchen was not fitted with a smoke alarm. Synonymsequip, provide, supply, fit out, rig out, furnish, outfit, endow2.2 Join or cause to join together to form a whole.with object many physicists tried to fit together the various pieces of the puzzleno object it took a while to figure out how the confounded things fit together Example sentencesExamples When these were fitted together, they were hammered to make the joint watertight. He wished to cut them into as few pieces as possible so that they could be fitted together, without waste, to form a perfectly square table-top. There is no doubt that a certain consistency of outlook is present throughout, but the pieces do not always fit together well. As the pieces start to fit together the characters' dilemmas begin to take on a different shape. Instead, when you crack open this thing, all you get are busted pieces that don't fit together and don't work. The limestone is produced in special moulds and can be fitted together like a jigsaw to form any configuratio", "n. It was a place where two separate pieces of metal fitted together, like the barrel of a lock. Understanding how the three pieces fit together and what to do about them is a big part of choosing the right project and getting it done. What they didn't know is when or if the pieces would fit together. Extra fuel tanks may need to be fitted together with spare jerricans. Finding which pieces fit together in order make the complete picture is one of the more difficult tasks. Seven remain, which can be fitted together with only small gaps. These are fitted together and built up as you need them, providing a versatile solution to changing needs. The little pieces fit together, each part representing something small but vital. Once inside you can see how the upper and lower receivers have been carefully fitted together by hand. You know what the picture's going to look like at the end, but you want to see how all the pieces will fit together. Currently sheet metal barriers were being fitted together behind the factory. The seven pieces will never fit together to make any sense. Drawing a plan forces you to think through your project from beginning to end, what you are going to need and how your are going to get the pieces to fit together. It just brings everything into balance and all the pieces fit together. Synonymsjoin, connect, put together, piece together, attach, unite, link, splice, fuse, weld3Be in agreement or harmony with; match. the punishment should fit the crime Example sentencesExamples Dewey observed that this model does not fit what we know about childre", "n. Take a volunteer position that fits your interest, and may even enhance your career goals. The Edmonton author, publisher, and former social worker has fit that description for at least 25 years. In some respects the description had fitted Naylor, while in others it did not. I'd seen her once or twice at school, and she fitted the description Travis gave me of her perfectly. Unfortunately, no candidate perfectly fits this descriptio", "n. After a while, a newcomer walks in who perfectly fits the description of the spy her husband gave to her. Fast, simple and delicious, these dishes can be adjusted to fit your schedule, grocery list and occasio", "n. The descriptions the woman gave fitted those of the two girls Tessa had seen before. I haven't met anyone who fits the commonly held definition of sane. I certainly don't fit any of the ideals presented in the media. It was clear that none of the six men who claimed to be at the warehouse could possibly fit the police officer's descriptio", "n. He said: ‘It happened in the city centre and the man fits the same physical descriptio", "n.’ Canada's judges have moved boldly into the public policy arena, shaping laws to fit their own peculiar biases and ideologies. Ten minutes later there were a number of sightings close to the Brittons' home of a man fitting Mark Hobson's descriptio", "n. We can and should form opinions about guilt or innocence in the same as we form other opinions, by choosing the position that best fits the available evidence. She has adjusted her services to fit the customer's budget. However modern scholars claim that Newton sometimes adjusted his calculations to fit his theories. So if you fit any of these descriptions and are interested in auditioning, the producers would love to see you. I learned that the job description was written to fit the individual whom the department wanted to hire.3.1 (of an attribute, qualification, or skill) make (someone) suitable to fulfill a particular role or undertake a particular task. an MS fits the student for a professional career Example sentencesExamples He regarded his own intellectual gifts and cast of mind as properly fitting him for the task. I was playing the part of Polonius - a part my mature years obviously fitted me for. His passion for lists, dates and details fits him well for this task. Dr Cherry's specialisation and experience fitted him ideally for involvement in the development of the project. One biographer assumes that he was a boy of somewhat ordinary talents that would fit him only for the mercantile trade. His freshness, his directness and his capacity for making connections with people both in person and on the television screen certainly fitted him for the task. Synonymsqualify, prepare, make ready, make suitable, prime, condition, train, coach, groom, tailornounfitfɪt1The particular way in which something, especially a garment or component, fits around or into something. the dress was a perfect fit Example sentencesExamples The dress was fabulous, a perfect fit, slim fitting with two thin shoulder straps and a more loose, flowing bottom part that ended just above the knee. All new windows offer a tight fit between components to limit the rate of infiltratio", "n. If you find a pair of black pants or a skirt that are the perfect fit, consider buying more than one pair. Again, I strongly encourage choosing pants with a drawstring or an elastic waistband for an easy fit. It means a lot to me; I didn't exchange it for the correct fit because I wanted the original one. Not every shirt or jeans will have a perfect fit for everybody. Perfect fit is accomplished when garments just skim the body, without pulling or sagging. I got up and borrowed a pair of Jon's jeans which were the perfect fit. The firm has developed mathematical algorithms to simulate fabric drape and garment fit. The pants feature a full elastic waistband and cuffs for a comfortable fit. The harness is adjusted on the shoulder and waist straps for a perfect fit. You might want to get your shirts altered at waist level to give them a slimmer fit. The pants have a roomy cargo pocket on the right leg and unhemmed cuffs so woman hunters can achieve the perfect fit. Is your saddle a correct fit and not put too far up the back. However, the shoulder seam plays a key role in the fit of garments that cover the upper body. Both the skirt and shirt were a perfect fit. Sometimes, you can help the fit of your garments by sewing these darts a little differently. A belt that doesn't have holes is even easier, as it's fully adjustable for a perfect fit. Despite the general lack of fit, the best fitting model seems to be the one-factor model. We look at clothing as an investment, so we consider the quality of a garment as well as the fit.1.1 The particular way in which a thing matches something else. a close fit between teachers' qualifications and their teaching responsibilities Example sentencesExamples A great deal of the power and impact of the preached Word comes from the fit between the preacher and the words being preached. There's a very good fit between the ideals of our two organisations. The band may be sore because there's a close fit between their own fan base and the kind of campus kids who have got into illegal downloading big time. It is ", "also a way to gain knowledge of what is a good fit or match for your personality type. The nurse must carefully examine the fit between the diagnosis and the client for whom it is intended. Marketing is a dynamic process of ensuring a close fit between the capabilities of an organization and the demands placed upon it by its external environment. Synonymscorrelation, correspondence, agreement, consistency, equivalence, match, similarity, resemblance, comparability, compatibility, affinity, concurrence1.2StatisticsThe correspondence between observed data and the values expected by theory. Example sentencesExamples Accurate measurements of these parameters could lead to a better fit of the theory to experiment. A smaller ratio score signifies good fit, and values near 2.0 are considered acceptable. The results indicate a good overall fit of the model. A thermal history involving two discrete episodes of heating and cooling clearly provides the best fit to the measured data. The greatest deviation from a good fit between the component figures occurs near the proximal end.Phrasesfit to be tiedinformal Very angry. Daddy was fit to be tied when I separated from Hugh Example sentencesExamples They clucked and fussed and were fit to be tied at the wanton waste they witnessed. When she learns from the doctor that she's not sick after all but sound as a dollar, she's fit to be tied. I listen to her set out her latest jargon-laden agenda for interfering in the lives and habits of British families, and after a few paragraphs I am afraid I am fit to be tied. We know that his family was fit to be tied with him during that time, and for good reaso", "n. Those wee ones love the man and are fit to be tied when it's time for him to leave. Synonymslivid, furious, angry, infuriated, irate, fuming, raging, seething, incensed, enraged, angered, beside oneself, wrathful, ireful, maddened, cross, annoyed, irritated, exasperated, indignantfit to bustinformal With great energy. they laughed fit to bust Example sentencesExamples Everywhere you go there's someone coughing fit to bust and looking miserable, or cross, or plain old-fashioned resigned to their fate. Algernon laughed sufficiently for the two of them, wheezing and hee-hee-heeing fit to bust, having to support himself on Simpson's shoulder. Already, his kitchen was full of brightly clad, bright-faced students talking fit to bust, helping themselves to coffee, and to stuff out of the pantry. The flower beds are brimming with rhododendrons, the birds are singing fit to bust. An hour later I woke from a vivid dream with my heart pounding away fit to bust. I get a face full of sherbet, in my eyes and up my nose and I'm coughing fit to bust. It might be that they have snow blizzards up in Scotland just now but down here we've got grass growing, buds budding, and, to my great delight, huge swathes of snowdrops, flowering fit to bust. I looked on in disbelief and her mother walked in and started screaming fit to bust. Now, late in the evening, it's blowing fit to bust outside. The brother she mentioned is laughing fit to bust.see (or think) fitConsider it correct or acceptable to do something. why did the company see fit to give you the job? Example sentencesExamples I am pretty shocked that you thought fit to send this email out today. Once it was confirmed that there was no further asbestos the site would be vested in the community, which could decide to use or dispose of it as they thought fit. I told the news editor he could break all the rules and do as he thought fit on the front page. You may add or subtract from my suggested text as you see fit, but please keep it polite. I have not had any academic training in film-making and planned the shots the way I thought fit. He needs to raise some money, so if you see fit, please make a donatio", "n. I am sure the learned trial judge felt she did her best to consider the arguments and rule as she saw fit, according to law. Over the next six months, consider all your career options and make changes as you see fit. The prime minister is free to do as he pleases when he sees fit. Feel free to choose more or less as you see fit, but please explain why you picked them.Phrasal Verbsfit in1(of a person) be socially compatible with other members of a group. he feels he should become tough to fit in with his friends Example sentencesExamples Early on, his drinking was linked to loneliness and an inability to fit in socially with his fellow players. I never fitted in with the cool kids, and trying to do so was making me unhappy as a teenager. What if he realized how little she fitted in with those he loved? I never fitted in with the Catholic community of my home. Does your teen have trouble fitting in at school? Other issues included feelings of social isolation, with students saying they had difficulties fitting in because of a culture clash between university and their home life. They may have poor social skills, have problems fitting in and probably cannot meet the expectations of their family or school. She was confident of fitting in socially but, during her first term, the workload caused a few concerns. On an endless search for what is needed to fit in and be socially acceptable, all sense of self is lost. Synonymsconform, be in harmony, belong, blend in1.1(of a thing) be in harmony with other things within a larger structure. produce ideas that fit in with an established approach Example sentencesExamples People were satisfied and extremely elated with the overall results, as they fitted in with the concept of a truly national party, even on face value. This fits in perfectly with the general social and economic policy of the SPD-Green government. He said the deals were ‘a good package’ and fitted in with their strategy of expanding on both sides of the Atlantic. Throughout the meal we were treated to a varied array of music which fitted in with the friendly atmosphere of the pub. This fitted in with the free trade approach of the time. Needless to say, the service was attentive, without being overbearing, and fitted in with the relaxed, classy atmosphere. The drive to increase access to universities fits in with New Labour pronouncements on social inclusion and the ilk. Helen Kidman, chairman of Ilkley Civic Society, said the guide was meant to inspire finer architecture that fitted in with the surrounding area. ‘We picked up the project because it was a good idea and because it fitted in with our health agenda,’ said a spokesma", "n. It was none the less an amusing portrayal, which fitted in with the high spirits of the evening if not into the household.1.2(of a person or thing) constitute part of a particular situation or larger structure. where do your sisters fit in? Example sentencesExamples She just wasn't fitting into his plan at all tonight. What I hope is that the coaching staff and my team-mates think that I'm steadily getting better as a player and fitting into the team. They are training very hard and have acquired a number of new players this year that are fitting into the team very well. We don't have any children of our own yet but I don't see how any child of ours would fit into such a situatio", "n. He has not been hampered by timidity or uncertainty, fitting into the side with calm assurance and revealing the extent of his ability. How do you see those alliances fitting into your long-term business plan? Where did you see yourself fitting into all that? It certainly fits into my plans to really look at mammals to understand birds better. Where do you see broadband and videostreaming fitting into your plans? He has been in tremendous form and is a fantastic talent who fits into Saints' future plans.fit someone/something in (or into)1Find room or have sufficient space for someone or something. can you fit any more books into the box? Example sentencesExamples The space inside seems too small to fit the elaborate furniture in the room. He only just fit his belongings into the room, cramming his clothes and most of his toys into the roll-out drawers and using the shelves for his books and stand-alone objects. There was not enough room to fit people in and no access for the disabled. There is enough room to fit the power cable in there, but I think a bit more space would make it easier for people with large hands to connect and disconnect the cable. I have been focusing on fitting my things into the very limited space this apartment affords. If your club/organisation is missing out on valuable publicity for vital fundraising events, we will always find space each week to fit you i", "n. I have, however, seen that people with slightly larger cars have experienced difficulty trying to fit their cars into the spaces. He disappeared without payment when he had completed the extraordinary task of fitting a spiral staircase into a space deemed impossibly small. Do you think that some people don't realise that there is a trade off, that okay if you don't want to have high-rise, you're going to have to take up more space to fit people in? And it could be the answer to the prayers of weekend shoppers who frequently struggle to fit their vehicles into precious spaces.1.1Succeed in finding time in a busy schedule to see someone or do something. you're never too busy to fit exercise into your life Example sentencesExamples The organisers were hoping the champion runner would fit the event into her busy schedule. This enabled her to decide when she worked and to fit it in around her busy schedule, which included picking up the kids from school. We've been looking to play this venue for ages, because it is such a good reputation, but either we were busy or they were busy and couldn't fit us i", "n. I tried to eat well and exercised when I could fit it into my busy life. Added to the business of choosing a topic, I must ", "also consider where I will fit the actual writing into my schedule. Johnny raised his eyebrows and shrugged, ‘I suppose I could fit you into my extremely busy schedule.’ How do you fit your workouts into such a busy schedule? I fitted my degree into a busy fire service life - it was a case of interrupted study for six years. Mr Simpson said on both occasions that he was unable to fit the openings into his busy calendar of events. Just follow our 10 steps for fitting a new activity into an already busy lifestyle, and you'll be sure to achieve success.fit someone/something out (or up)Provide with the necessary equipment, supplies, clothes, or other items for a particular situatio", "n. the cabin had been fitted out to a high standard Example sentencesExamples The next four weeks will be very busy fitting it out with furniture and equipment and making it clinically clea", "n. The properties can be fitted out at a cost of €15,000. These houses are fitted up in first-rate style, with gas and water laid o", "n. The cells are fitted out with televisions, sanitary and tea making facilities. He said doctors on duty will have a taxi available to them at all times to drive them to patients and the car will be fitted out with high quality medical equipment, like a mini-ambulance. The interior of both buildings are fitted out with the highest of standards of modern fittings. And the opportunity is not restricted to the able-bodied - the vessel is fitted out to accommodate people of all types of physical ability and disability. On leaving the school the boys were fitted out with clothes and given a bible and a Book Of Common Prayer. The bathrooms are fitted out in granite, oak and glass. The Learning and Skills Council spent £40,000 on refurbishing space at the station, fitting it out with six new computers with Internet access, printers, a digital camera and scanner. Synonymsequip, provide, supply, furnish, kit out, rig out, outfit, accoutre, array, stockfit someone upIncriminate someone by falsifying evidence against them. Example sentencesExamples We need people who have the skills to smell out somebody who comes along to try to fit us up. The confessor's claims that Stuart had been fitted up shook the parochial world of late 1950s Australia, a country just waking up to the notion of civil rights. He added: ‘After 27 years of being a thorn in the side of the police they fitted him up for something serious to put him away for a long time.’ That was a really pathetic job of fitting someone up. He admitted in early 1997 he was a prime suspect for the murder and conducted a series of interviews denying the charge and claiming police were out to fit him up. Your basic complaint is that they fitted you up for something you did not do. He told the Standing Committee on Legal and Constitutional Affairs he had been fitted up with the help of covert recordings for falsely accusing police officers of corruptio", "n. Thus does the movie have its cake and eat it: the drama and glamour of real mob violence, plus the sentimental suggestion that our Charlie was fitted up. Synonymsfalsely incriminate, entrap, fabricate charges against, fabricate evidence againstfit something onTry on (a garment). Example sentencesExamples I always fit the clothes on myself because that way I can feel the garment. They do offer you the opportunity to try and fit the clothes on you want.OriginLate Middle English: of unknown origi", "n. fit2nounfɪtfit1A sudden uncontrollable outbreak of intense emotion, laughter, coughing, or other action or activity. in a fit of temper he got coughing fits Example sentencesExamples The model is already facing claims from three former assistants who say she allegedly assaulted them in fits of rage. Alex is extremely intelligent with a propensity for fits of anger and uncontrollable rage. Yes, authors and creators can suffer fits of pique that can hurt the markets for secondary works. He is prone to fits of jealousy when he sees Primrose in the company of another male. He even had his own wife murdered in a fit of jealousy. He was suddenly seized by a fit of panic. Reane, in a fit of pure rage, slashed him across the back. He was frantically jealous, beat her, begged forgiveness in fits of remorse which became as repellent as his rage, and demanded she abort the pregnancy that came along in the second month of the hasty match. To leave now would suggest that he'd gone in a fit of pique. Her mother's fits of anger and the threats and beatings dealt to the girl resolve themselves in a grudging acceptance of the financial favours handed out by the lover. He lives off the earnings of his wife, Eva, succumbs to fits of paranoia and anger, engages in a desultory affair, hates the physical decay around him and is haunted by the prospect of death. In a fit of fury Calvert who was known to be a violent and irrational person burst into Smedleys home and hurled a heavy stone ornament at him. He acknowledges these fits of anger, such as the one that caused him to slay his wife with an ax, but he nevertheless shows some remorse for what he has done. Hearing such music does not usually send you into a fit of rage immediately. Lisa suffers from fits of sudden rage and unbearable fatigue. If at all he became angry, he would keep quiet rather than burst out in a fit of temper. Another time, while Elie is working at the electrical warehouse, he goes on one of his fits of rage and beats the boy. Synonymstantrum, fit of temper, outburst of anger, outburst of rage, frenzy, fury1.1 A sudden attack of convulsions and/or loss of consciousness, typical of epilepsy and some other medical conditions. he thought she was having a fit Example sentencesExamples Febrile convulsions are fits that sometimes happen in a child with a high temperature. The problems began after the woman was admitted to a medical ward in a local hospital suffering from fits and nightmares. Always phone for an ambulance if a fit lasts longer than five minutes. If the child has fits, they may be prescribed anticonvulsant drugs. One prisoner suffered an epileptic fit, and all the others shouted for help. Her ordeal began in November when she started having fits and convulsions despite no previous history of health problems. His frequent fits result in painful injuries, and medication has failed to control the traumatic episodes. He collapsed and died suddenly after not suffering an epileptic fit for several years. Concerned about the number of fits Slater was having, her doctor decided to operate to disconnect the right and left hemispheres of her brai", "n. She cannot work as she now suffers frequent, violent epileptic fits. It is believed he suffered a fit as he was watching a football match. At his parents' Flamborough home, his condition worsened, and he suffered several prolonged epileptic fits. Alexandra has cerebral palsy, is confined to a wheelchair and suffers from frequent epileptic fits. Julie Ann now suffers from daily fits and seizures. If the child has a history of epilepsy, it can be difficult to tell the difference between febrile convulsions and epileptic fits. Kirstie has had epilepsy since she was 18 and until recently suffered daily epileptic fits. His master and friends all said he was a clever, well-behaved boy, and had never been known to have fits, or walk in his sleep. Othello, told by Iago that Cassio has admitted sleeping with Desdemona, falls into a fit. During this state one keeps on getting epileptic fits without regaining consciousness in betwee", "n. Her sister, Lucy, suffers from cerebral palsy and epilepsy and is often treated in York Hospital for fits and chest infections. Synonymsconvulsion, spasm, paroxysm, seizure, attackPhraseshave (or throw) a fitinformal Be very surprised or angry. my mother would have a fit if she heard that Example sentencesExamples I was in a line of folks standing behind a woman at the bookstore who was throwing a fit because the clerk could not find the copy of The Great Gatsby she'd called to reserve. Mother will be having a fit if she knows I'm sitting out in the cold air - for even though it seems warm she'll fuss. This hardly seems like the kind of thing to be throwing a fit about. The rental company is sent away by the filming crew and my friend's husband throws a fit. Better get a move on so mother doesn't throw a fit when I get back. His mother had a fit, so they married again on New Year's Day 1937, this time with the family present. If people don't want to listen to what he wants to listen to, he throws a fit. They were used to him throwing a fit when he was in bad mood. You know my mother will throw a fit if she sees me like this. My mother would have a fit if she knew I spent a lot of time at Deane's.in fits (of laughter)informal Highly amused. he had us all in fits Example sentencesExamples Both the staging and acting are universally superb and we were in fits of laughter throughout. Eventually, after half an hour rolling around on the floor in fits of laughter, I managed to regain my composure. Peter had one of the locals in fits of laughter when he was doing a line dance. His quick wit and confident delivery had the audience in fits of laughter. For starters, I was in fits of laughter at the sight of him, and his swearing and shouting just made me worse. We collapsed in fits, the tutor had overheard and was almost wetting herself, and the 5 others were demanding to know what we'd said. The rest of us collapsed in fits of laughter at poor old Dave. There was a time when circus was a popular form of entertainment - with acrobats and bold ring-masters to whose crack of the whip wild animals played awesome tricks and the clowns left packed audiences in fits. At one point, she had the audience in fits. Once we were out of harm's way, we all ended up breaking down in fits of uncontrollable laughter - partly to relieve the tension of the near-miss situation, but mostly because of the absurdity of what had just happened.in (or by) fits and startsWith irregular bursts of activity. the machine tends to go forward in fits and starts Example sentencesExamples It was built in 1961, and it's been renovated in fits and starts, so it's sort of an architectural Frankenstei", "n. Like my wife's slimming programme, this year's harvest is going in fits and starts, punctuated by incredibly hot days of activity and frustrating rest periods. I've started adding mine, but it'll be done in fits and starts… All too often, science progresses in fits and starts, re-examining data, reinterpreting evidence - a path that can be hard to accept in medicine, when answers are needed now. Progress has come in fits and starts and is still fragile. However, like in any sport, those who play well throughout the whole contest - not just in fits and starts - more often than not end up victorious. The improvement came slowly, sporadically, in fits and starts. The poetry is moving forward in fits and starts. The Roman occupation of Britain advanced in fits and starts with the occasional disaster - the bloody revolt of Queen Boadicea in 61 AD is the best known example. We played in fits and starts and never really clicked and opened up, but we're happy with the points. Synonymsspasmodically, intermittently, sporadically, erratically, irregularly, interruptedly, fitfully, haphazardly, on and off, off and on, now and then, now and againOriginOld English fitt ‘conflict’, in Middle English ‘position of danger or excitement’, ", "also ‘short period’; the sense ‘sudden attack of illness’ dates from the mid 16th century. fit3(", "also fytte)nounfɪtfitarchaic A section of a poem. Example sentencesExamples Percy has written a long ballad in many fits: it is pretty enough. When the knight is introduced in a later fytte of the poem, he is called Sir Richard-at-the-Lee. The balance of this first fytte consists mostly of lengthy dialogue detailing the knight's impoverishment.OriginOld English fitt, perhaps the same word as fit, or related to German Fitze ‘skein of yarn’, in the obsolete sense ‘thread with which weavers mark off a day's work’.", "adj.1 phr. phr.", "v. nou", "n.1 phr. nou", "n.2"]}], "usphone": "", "ukphone": ""}