{"name": "function as", "trans": [{"dict": "Oxford5000", "values": ["function asSee functionDefinition of function in English: function noun ˈfʌŋ(k)ʃ(ə)nˈfəŋ(k)ʃ(ə)n1An activity that is natural to or the purpose of a person or thing. bridges perform the function of providing access across water bodily functions Example sentencesExamples Four important bodily functions are provided by the muscles of our bodies. It is on a pivotal city centre site and we do not see the two other city centre post offices performing the functio", "n. When a breast can't perform its natural functions, many women find it difficult to accept it as part of their body. According to Dr. Jose, the opening up of micro-vascular channels enhances the natural physiological functions. These priorities will be driven by the needs of the organization, which are a function of the business purposes and current problems. This is because, the article argues, they are a similar frequency to the type of electrical activity natural to cellular functions and so may cause interference. In nearly all cases, the best that can be hoped for is an alternative to natural functions which is almost as good as the real thing. Today the centre is in full use with sporting activities, meetings, courses, functions and other activities such as the very successful play group. But it does play on social mores and our embarrassment about natural bodily functions, albeit in a crude way. Grammar is just a natural function of children's brains, and they apply it to whatever they find. Apparently they have very important natural functions in the brain but, like everything else, can go awry sometimes - a bit like cells going wrong and turning into cancer. There was a presentation which looked at what a Parish Pastoral Council is, its role, functions and activities. What the dogs do is a natural function but where they do it is chosen by humans. One of the great things about getting older is that you become less embarrassed about your body and its natural functions. New Forestry aimed to mimic natural forest functions while providing for conventional timber objectives. One plus of physical stores, says Sinnreich, is that they perform educational and informational functions in ways a Web site can't duplicate. This bill sets out in minute detail the functions and purposes of this new entity in a way that I have never seen before. But its increased economic insularity is more likely to be a natural function of its financial predicament. In both cases, the ultimate goal is to understand how suites of traits and trade-offs between competing functions respond to natural selectio", "n. The law regulates the establishment, scope, functions and the activity of the Commission on Financial Supervisio", "n. Synonymspurpose, task, use, rolereason, basis, justificationresponsibility, duty, concern, province, aim, activity, assignment, obligation, chargetask, chore, job, role, errand, mission, detail, undertaking, commissioncapacity, post, situation, office, occupation, employment, business, operationFrench raison d'êtreinformal thing, bag, line of country, pigeon1.1mass noun Practical use or purpose in desig", "n. building designs that prioritize style over function Example sentencesExamples The bed - area was clearly designed for function rather than comfort. This discourse of function is transparent in design, but only occasionally with ", "art. I'll do my best to keep the overall design and function clean and simple but I'm looking forward to getting properly to grips with the new methodology. The one-piece design is no-frills, designed for function rather than beauty. Hargrave believed that good function was good design and that every boat should look attractive without a lot of decoration or trim. We're not trying to attack anybody here: We're trying to talk about the status and function of design in culture. Its roof can politely be described as a victory for design over functio", "n. Constantia was designed with function and flexibility in mind. The radio controls are designed more for style than function and are awkward to use. The reasons for docking originated in aesthetic design, function, early medical theory and even tax minimisatio", "n. The idea of function sounds very practical, very sensible, whereas beauty sounds a bit airy-fairy and a bit off in the clouds. We offer a wide range, good design and function, and ", "also low prices. It's a case of function dictating similar design, but more of that later. The only real drawback is an interior where design has triumphed over function, as any kind of storage space is very hard to find. I ", "also found that the mirrors appeared to be a product of design over functio", "n. The models presented here represent the state of the art in function, design and manufacture. He stressed the importance of engineering and function in art and design courses. Its architecture, furniture, design, function and systems are charmingly retro. Motorcycle exhausts are designed with style and function in mind. Often, the product's physical form becomes smaller, more compact, and more efficient in design functio", "n.1.2 A basic task of a computer, especially one that corresponds to a single instruction from the user. Example sentencesExamples The Deskbar has the added advantage (for Google) that you end up using Google's search functions more than you even did previously. The capacity to spell and write grammatically correct sentences is abated by the availability of spell- and grammar-checking functions in word processing software. Maybe this is not exactly up to the point, but one of the Google search functions is called ‘I am feeling lucky!’ While you're able to see what each icon does, there is very little if any instructions about what these functions mea", "n. Medical billing software with quick searching functions enables offices to quickly and effectively manage multiple databases worth of informatio", "n. An undo function permits users to undo the most recent configuratio", "n. The package has an invitation function, calling available users to conference and giving them the option of accepting or not. Each gesture performed on the touch pad corresponds to a control functio", "n. Take as an example a situation where you've created a keyboard hack for your arcade controls but still need to be able to operate your computer for non-gaming functions. Method and apparatus for presenting new computer software functions to a user based upon actual usage Many pieces lay bare digital networks: various vertical and horizontal scrolling functions on the computer screen reveal the image structure. An icon is a graphic image that represents an available function on a computer's graphical user interface. You can actually add a button with an exit function to the user interface. On the right section of the taskbar are icons for general computer functions like speaker volume, clock and printer status. Selection of functions lets image-processing software branch out. Control and user interface functions, if needed for a particular application can ", "also be functionally partitioned.2Mathematics A relation or expression involving one or more variables. the function (bx + c) Example sentencesExamples His work is almost exclusively on calculus, in particular differential equations and functions of a real variable. Then of course the relevant integrals involve odd functions, and it results that the centroid lies on the y-axis. There is only one way to represent any amount as the sum of pennies which is expressed as the generating functio", "n. A chapter follows covering algorithms for computing key elementary functions on integers. However, the coefficients are expressed as functions of water potential thus allowing the model to be applied under all conditions of temperature and water potential. Since most functions defined by simple algebraic expressions are differentiable, on a sufficiently fine scale the points will appear to fall on a straight line. A function which expresses the relation between the coefficient of permeability and the effective stress is presented. For example, the exponent b in the rate functions of the expressions in Eq. 5 was assigned a universal value. To calculate the selection coefficients, the fitness function must be expressed as a polynomial. His work was in number theory, in particular the zeta functio", "n.2.1 A variable quantity regarded in relation to one or more other variables in terms of which it may be expressed or on which its value depends. the magnetic field has varied as a function of time Example sentencesExamples Solving the equations of the best response functions gives expressions for equilibrium outputs. This work led him to the Dirichlet problem concerning harmonic functions with given boundary conditions. Jacobi presented a paper concerning iterated functions to the Berlin Academy of Sciences in 1825. Spectral analysis decomposes a variable into underlying sine and cosine functions of particular wavelengths or cycles. He found expressions for the Bessel functions as integrals involving Legendre functions.2.2ChemistryA functional group. the carboxyl group was replaced by functions that included tetrazolyl-, sulphonyl-, and phosphoryl- Example sentencesExamples Single-site analysis and one-dimensional window analysis can be used to detect selection when the biological functions of amino acid sites are unknow", "n. The primary function of this system is the exchange of oxygen and carbon dioxide; secondary functions are phonation and olfactio", "n. Ozone is especially menacing when it reacts with molecules involved in the functions of living organisms. This points to the importance of this stretch of amino acids for the function of both proteins. For instance, in the case of the two active stereoisomers we showed that only the stereochemistry at the amine and hydroxyl functions on the scaffold were important - the third chiral centre is not.3A thing dependent on another factor or factors. class shame is a function of social power Example sentencesExamples Rabbinical courts throughout the rest of the world function without such powers of coercio", "n. However, given the small sample size and degree of variability, it is possible that this result is a function of low statistical power. Obviously, its quality is partly a function of its power to persuade, but its persuasiveness is in the eye of the beholder. These factors are a function of sampling effort and sampling strategy. The children's flirtation with radicalism and terrorism is a function of two factors - time and opportunity. The mental mindgames the three plays chillingly reveal truth to be a function of power. The final decision as to whether or not to seek help is a function of all these factors. It is such an enormous power, no one is going to resist its interpretation of the law, and the law therefore becomes a function of power, as it has always bee", "n. The different results may be a function of cultural, social, and geographical influences. Actual economic results, including the goods and the bads, are a function of numerous factors and forces. Thus the optimal leaf lifespan may be a function of two factors: the rate of nitrogen uptake and of PNUE reductio", "n. Interference is a function of peak power, not average. Because they concretely challenged the function of power rather than engage in symbolic ritual protest of it, right? In this case, the Soviet nostalgia is not a function of crude economic or social factors, but of the acute sense of geo-political loss. ANOVA was conducted to examine whether the factors varied as a function of geographical region or section membership in CPA. Anger is often a function of power and the need to dominate and control. On another level, the play chillingly shows ‘truth’ to be a function of power. Where an agency is headed by a strong and credible leader, given a clear mandate to deliver, and the power to influence the functions of other departments and agencies, success can be achieved. If one part fails, all dependent functions fail too because of the interdependencies among the components. In summary, the type of deformation observed in rocks presently exposed at the Earth's surface is a function of many factors, not the least of which is the level of exposure. Synonymsconsequence, result, outcome, ramification, corollary, concomitantdated issue4A large or formal social event or ceremony. he was obliged to attend party functions Example sentencesExamples Apart from the blacksmith shop he ", "also became the owner of a large assembly hall, which was used for meetings, parties and other community functions of a social nature. They drive a Rolls-Royce, live at Vaucluse, attend exclusive social functions and have been lunch guests of Governor-General Mike Jeffery. Some consider that it is connected with ‘high society’ and formal social functions. Parties, functions, dinners and gatherings are most avoidable outings in his notebook. Besides, the members get together for occasional functions such as birthday parties and weddings. Mulchay notes that the outside area is popular with families during the summer and provides a comfortable environment for functions and social events. If your family has formal festive functions, this one's for you. My husband is a university professor, and we get many invitations to dinner parties, formal gatherings, and other social functions. Ross, as club's co-founder and Chairman, manages the 40-strong warmwater branch, and the two sides come together for social events and other functions. He recorded his thanks and appreciation to the many organisations and individuals who invited him to attend their functions or events over the last 12 months. The crops of spring onions, lettuce and Chinese cabbage were given free to guests at a formal function to celebrate the event on Friday. And since Mathilde was again pregnant, she will not have been keen to have a full diary of cultural events and social functions. This groundswell of patriotism has been nurtured and strengthened by political functions and religious ceremonies in remembrance of the September attacks. ‘Oh, he's the smart one,’ she'd say with admiration at dinner parties and social functions. They attended on the mayor at civic functions and ceremonial occasions, and sometimes played in the street at night. As we walked around to thank our supporters after the final whistle, I recognised many fans that we all knew so well through the many functions and events we attended together. It was traditionally worn by kings, queens and other great figures of state during ceremonial events and functions. He finds himself at various functions, meetings, ceremonies and openings, at a plethora of venues such as hospitals, colleges, sports centres and theatres. Castlehill Catering has recently joined the Ballina Chamber of Commerce and specialises in Catering for private functions and social events. In addition to subsistence benefits from direct consumption and trading, whale hunting and its associated components fulfilled important ceremonial and social functions for the Makah. Synonymssocial event, party, occasion, social occasion, affair, gathering, reception, soirée, celebration, jamboree, galaNorth American leveeinformal do, bash, shindig, shindy, blowoutBritish informal rave-up, thrash, knees-up, jolly, beanfeast, bunfight, beano, ligverb ˈfʌŋ(k)ʃ(ə)nˈfəŋ(k)ʃ(ə)n[no object]1Work or operate in a proper or particular way. her liver is functioning normally Example sentencesExamples However, it keeps on functioning, regenerates itself, and discovers new limits. It's hard enough to read that theatrical prose when my brain is functioning. Fortunately for me, my poetry bone is not functioning at all just now, so there's no conflict. My other alarm system is still functioning though, so don't think about breaking in burglars. The room would be lit up and a fan ", "also starts functioning once the cradle starts rocking. Her kidneys had stopped functioning and she must have put on 30 pounds of fluid. Our engines have ceased functioning and we will attempt an emergency landing. Going there certainly made me understand better who we all are as people functioning in a society and a culture. We are not truly functioning in the way God intended for us if we are not givers. Her kidneys are working again, but we couldn't say they are functioning normally. But the group has been using two old laptops one of which is not functioning properly. If Iraq was a deeply dysfunctional society, its sport was barely functioning. Team efforts and long hours of work meant that the town was soon functioning normally. Great news for people who have a hunger control switch that is functioning well in the brai", "n. The only outstanding issue is related to the archive links not functioning. Of course, Egg's plans to break even depend on its Web site functioning and fully operational. He said the system had functioned well in the past and did not serve any specific group. But even though her attacks could last up to three days, she could carry on functioning. Secondly, make sure the technology is functioning smoothly so that candidates are not put off. If the Lord wants to keep you alive and functioning then he doesn't need any artificial help from mankind. Synonymswork, go, run, be in working/running order, operate, perform, be in action, be operative1.1function as Fulfil the purpose or task of (a specified thing) the museum intends to function as an educational and study centre Example sentencesExamples In former times local headmen functioned as war chiefs, but paramount chiefs over various local communities were absent. This gadget not only controls the presence of employees but ", "also functions as a security device. The more isolated the tasks are, the more you inhibit their ability to function as a team. What I didn't know then was that this form of prejudice functioned as a way to express the values I had grown up with. There is an excellent listing of the large number of ways in which environmentalism functions as a religion here. She accompanies the bride to her new home and functions as a companion, adviser and confidante. Although hydrogen peroxide functions as a disinfectant, it contains toxins harmful to the health. A permanent body that functions as an external examination institute is still only wishful thinking. It is an installation, which means that the artwork functions as the whole room. All of this is to say that the new digital environment functions as, well, a web. Most recently I functioned as opponent in a PhD thesis at the Institut d'études politiques de Paris This joint thus functions as a tapas bar, but replaces typical tapas dishes with North African panache. The tree was designed for a specific purpose, but it could no longer function as a tree. American Jews found themselves notable in the history of the Jewish diaspora in that they never functioned as their nation's most stigmatized group. His odyssey functions as a satire of the war, the leaders, and the army. This executive branch of government never functions as accurate and honest mirrors of the president. It functions as a summerhouse and office with attached potting shed. The London Underground functioned as a series of bomb shelters during the Blitz of World War II. Boniface was ", "also prominent in Frankish church reform and functioned as representative of the pope to the Franks. Synonymsserve, act, operate, perform, work, behavehave/do the job of, play the role of, act the part of, perform the function of, do duty as, constitute, formDerivativesfunctionlessadjectiveHe chuckled at a perky, muff-like dog tottering along as if to remind the Swedes a British dog is what a dog is - unexpendable, functionless, highly ridiculous. Example sentencesExamples They are functionless things, and Rashid prefers his objects to have form and functio", "n. The gargoyles are functionless and the half-timbered effect of the East wing, which is a later addition and houses a billiard room, is entirely bogus, the timbers being painted on to a surface of scabrous cement. The general consensus is that the majority of the non-coding, non-regulatory DNA is functionless (the so called ‘junk DNA’). Part of this functionless, ‘junk’ DNA is made up of long stretches of repeated sequences of the four nucleotide building blocks from which DNA is constructed. One of the reasons for this seems to be to do with the current obsession of video game developers with creating amazingly detailed but functionless graphics that look good in adverts and shop windows.OriginMid 16th century: from French fonction, from Latin functio(n-), from fungi 'perform'.Rhymescompunction, conjunction, dysfunction, expunction, junction, malfunction, multifunction, unctionDefinition of function in US English: function nounˈfəŋ(k)ʃ(ə)nˈfəNG(k)SH(ə)n1An activity or purpose natural to or intended for a person or thing. bridges perform the function of providing access across water Vitamin A is required for good eye function Example sentencesExamples Four important bodily functions are provided by the muscles of our bodies. Grammar is just a natural function of children's brains, and they apply it to whatever they find. These priorities will be driven by the needs of the organization, which are a function of the business purposes and current problems. It is on a pivotal city centre site and we do not see the two other city centre post offices performing the functio", "n. Today the centre is in full use with sporting activities, meetings, courses, functions and other activities such as the very successful play group. There was a presentation which looked at what a Parish Pastoral Council is, its role, functions and activities. This bill sets out in minute detail the functions and purposes of this new entity in a way that I have never seen before. New Forestry aimed to mimic natural forest functions while providing for conventional timber objectives. Apparently they have very important natural functions in the brain but, like everything else, can go awry sometimes - a bit like cells going wrong and turning into cancer. What the dogs do is a natural function but where they do it is chosen by humans. The law regulates the establishment, scope, functions and the activity of the Commission on Financial Supervisio", "n. When a breast can't perform its natural functions, many women find it difficult to accept it as part of their body. One plus of physical stores, says Sinnreich, is that they perform educational and informational functions in ways a Web site can't duplicate. In nearly all cases, the best that can be hoped for is an alternative to natural functions which is almost as good as the real thing. One of the great things about getting older is that you become less embarrassed about your body and its natural functions. But it does play on social mores and our embarrassment about natural bodily functions, albeit in a crude way. According to Dr. Jose, the opening up of micro-vascular channels enhances the natural physiological functions. But its increased economic insularity is more likely to be a natural function of its financial predicament. In both cases, the ultimate goal is to understand how suites of traits and trade-offs between competing functions respond to natural selectio", "n. This is because, the article argues, they are a similar frequency to the type of electrical activity natural to cellular functions and so may cause interference. Synonymspurpose, task, use, roleresponsibility, duty, concern, province, aim, activity, assignment, obligation, charge1.1 Practical use or purpose in desig", "n. building designs that prioritize style over function Example sentencesExamples Its architecture, furniture, design, function and systems are charmingly retro. Often, the product's physical form becomes smaller, more compact, and more efficient in design functio", "n. The idea of function sounds very practical, very sensible, whereas beauty sounds a bit airy-fairy and a bit off in the clouds. It's a case of function dictating similar design, but more of that later. The bed - area was clearly designed for function rather than comfort. Motorcycle exhausts are designed with style and function in mind. I'll do my best to keep the overall design and function clean and simple but I'm looking forward to getting properly to grips with the new methodology. Its roof can politely be described as a victory for design over functio", "n. This discourse of function is transparent in design, but only occasionally with ", "art. We're not trying to attack anybody here: We're trying to talk about the status and function of design in culture. The only real drawback is an interior where design has triumphed over function, as any kind of storage space is very hard to find. The reasons for docking originated in aesthetic design, function, early medical theory and even tax minimisatio", "n. The one-piece design is no-frills, designed for function rather than beauty. The radio controls are designed more for style than function and are awkward to use. I ", "also found that the mirrors appeared to be a product of design over functio", "n. He stressed the importance of engineering and function in art and design courses. Constantia was designed with function and flexibility in mind. We offer a wide range, good design and function, and ", "also low prices. The models presented here represent the state of the art in function, design and manufacture. Hargrave believed that good function was good design and that every boat should look attractive without a lot of decoration or trim.1.2 A basic task of a computer, especially one that corresponds to a single instruction from the user. Example sentencesExamples Method and apparatus for presenting new computer software functions to a user based upon actual usage Maybe this is not exactly up to the point, but one of the Google search functions is called ‘I am feeling lucky!’ An undo function permits users to undo the most recent configuratio", "n. Medical billing software with quick searching functions enables offices to quickly and effectively manage multiple databases worth of informatio", "n. The Deskbar has the added advantage (for Google) that you end up using Google's search functions more than you even did previously. Each gesture performed on the touch pad corresponds to a control functio", "n. Many pieces lay bare digital networks: various vertical and horizontal scrolling functions on the computer screen reveal the image structure. On the right section of the taskbar are icons for general computer functions like speaker volume, clock and printer status. The package has an invitation function, calling available users to conference and giving them the option of accepting or not. Control and user interface functions, if needed for a particular application can ", "also be functionally partitioned. The capacity to spell and write grammatically correct sentences is abated by the availability of spell- and grammar-checking functions in word processing software. Take as an example a situation where you've created a keyboard hack for your arcade controls but still need to be able to operate your computer for non-gaming functions. An icon is a graphic image that represents an available function on a computer's graphical user interface. While you're able to see what each icon does, there is very little if any instructions about what these functions mea", "n. You can actually add a button with an exit function to the user interface. Selection of functions lets image-processing software branch out.2Mathematics A relationship or expression involving one or more variables. the function (bx + c) Example sentencesExamples Since most functions defined by simple algebraic expressions are differentiable, on a sufficiently fine scale the points will appear to fall on a straight line. A function which expresses the relation between the coefficient of permeability and the effective stress is presented. There is only one way to represent any amount as the sum of pennies which is expressed as the generating functio", "n. However, the coefficients are expressed as functions of water potential thus allowing the model to be applied under all conditions of temperature and water potential. To calculate the selection coefficients, the fitness function must be expressed as a polynomial. His work is almost exclusively on calculus, in particular differential equations and functions of a real variable. Then of course the relevant integrals involve odd functions, and it results that the centroid lies on the y-axis. His work was in number theory, in particular the zeta functio", "n. For example, the exponent b in the rate functions of the expressions in Eq. 5 was assigned a universal value. A chapter follows covering algorithms for computing key elementary functions on integers.2.1 A variable quantity regarded in relation to one or more other variables in terms of which it may be expressed or on which its value depends. Example sentencesExamples Solving the equations of the best response functions gives expressions for equilibrium outputs. He found expressions for the Bessel functions as integrals involving Legendre functions. This work led him to the Dirichlet problem concerning harmonic functions with given boundary conditions. Jacobi presented a paper concerning iterated functions to the Berlin Academy of Sciences in 1825. Spectral analysis decomposes a variable into underlying sine and cosine functions of particular wavelengths or cycles.2.2ChemistryA functional group. Example sentencesExamples This points to the importance of this stretch of amino acids for the function of both proteins. Ozone is especially menacing when it reacts with molecules involved in the functions of living organisms. The primary function of this system is the exchange of oxygen and carbon dioxide; secondary functions are phonation and olfactio", "n. Single-site analysis and one-dimensional window analysis can be used to detect selection when the biological functions of amino acid sites are unknow", "n. For instance, in the case of the two active stereoisomers we showed that only the stereochemistry at the amine and hydroxyl functions on the scaffold were important - the third chiral centre is not.3A thing dependent on another factor or factors. class shame is a function of social power Example sentencesExamples Anger is often a function of power and the need to dominate and control. Where an agency is headed by a strong and credible leader, given a clear mandate to deliver, and the power to influence the functions of other departments and agencies, success can be achieved. Actual economic results, including the goods and the bads, are a function of numerous factors and forces. On another level, the play chillingly shows ‘truth’ to be a function of power. The different results may be a function of cultural, social, and geographical influences. The children's flirtation with radicalism and terrorism is a function of two factors - time and opportunity. The final decision as to whether or not to seek help is a function of all these factors. ANOVA was conducted to examine whether the factors varied as a function of geographical region or section membership in CPA. Interference is a function of peak power, not average. In summary, the type of deformation observed in rocks presently exposed at the Earth's surface is a function of many factors, not the least of which is the level of exposure. Rabbinical courts throughout the rest of the world function without such powers of coercio", "n. The mental mindgames the three plays chillingly reveal truth to be a function of power. In this case, the Soviet nostalgia is not a function of crude economic or social factors, but of the acute sense of geo-political loss. It is such an enormous power, no one is going to resist its interpretation of the law, and the law therefore becomes a function of power, as it has always bee", "n. Because they concretely challenged the function of power rather than engage in symbolic ritual protest of it, right? These factors are a function of sampling effort and sampling strategy. However, given the small sample size and degree of variability, it is possible that this result is a function of low statistical power. Thus the optimal leaf lifespan may be a function of two factors: the rate of nitrogen uptake and of PNUE reductio", "n. Obviously, its quality is partly a function of its power to persuade, but its persuasiveness is in the eye of the beholder. If one part fails, all dependent functions fail too because of the interdependencies among the components. Synonymsconsequence, result, outcome, ramification, corollary, concomitant4A large or formal social event or ceremony. he was obliged to attend party functions Example sentencesExamples If your family has formal festive functions, this one's for you. He finds himself at various functions, meetings, ceremonies and openings, at a plethora of venues such as hospitals, colleges, sports centres and theatres. In addition to subsistence benefits from direct consumption and trading, whale hunting and its associated components fulfilled important ceremonial and social functions for the Makah. He recorded his thanks and appreciation to the many organisations and individuals who invited him to attend their functions or events over the last 12 months. The crops of spring onions, lettuce and Chinese cabbage were given free to guests at a formal function to celebrate the event on Friday. As we walked around to thank our supporters after the final whistle, I recognised many fans that we all knew so well through the many functions and events we attended together. Parties, functions, dinners and gatherings are most avoidable outings in his notebook. It was traditionally worn by kings, queens and other great figures of state during ceremonial events and functions. They drive a Rolls-Royce, live at Vaucluse, attend exclusive social functions and have been lunch guests of Governor-General Mike Jeffery. Some consider that it is connected with ‘high society’ and formal social functions. Ross, as club's co-founder and Chairman, manages the 40-strong warmwater branch, and the two sides come together for social events and other functions. Castlehill Catering has recently joined the Ballina Chamber of Commerce and specialises in Catering for private functions and social events. Besides, the members get together for occasional functions such as birthday parties and weddings. My husband is a university professor, and we get many invitations to dinner parties, formal gatherings, and other social functions. This groundswell of patriotism has been nurtured and strengthened by political functions and religious ceremonies in remembrance of the September attacks. ‘Oh, he's the smart one,’ she'd say with admiration at dinner parties and social functions. And since Mathilde was again pregnant, she will not have been keen to have a full diary of cultural events and social functions. Mulchay notes that the outside area is popular with families during the summer and provides a comfortable environment for functions and social events. Apart from the blacksmith shop he ", "also became the owner of a large assembly hall, which was used for meetings, parties and other community functions of a social nature. They attended on the mayor at civic functions and ceremonial occasions, and sometimes played in the street at night. Synonymssocial event, party, occasion, social occasion, affair, gathering, reception, soirée, celebration, jamboree, galaverbˈfəŋ(k)ʃ(ə)nˈfəNG(k)SH(ə)n[no object]1Work or operate in a proper or particular way. her liver is functioning normally Example sentencesExamples If the Lord wants to keep you alive and functioning then he doesn't need any artificial help from mankind. It's hard enough to read that theatrical prose when my brain is functioning. Of course, Egg's plans to break even depend on its Web site functioning and fully operational. However, it keeps on functioning, regenerates itself, and discovers new limits. Team efforts and long hours of work meant that the town was soon functioning normally. Going there certainly made me understand better who we all are as people functioning in a society and a culture. But even though her attacks could last up to three days, she could carry on functioning. Great news for people who have a hunger control switch that is functioning well in the brai", "n. Our engines have ceased functioning and we will attempt an emergency landing. Fortunately for me, my poetry bone is not functioning at all just now, so there's no conflict. Her kidneys had stopped functioning and she must have put on 30 pounds of fluid. Secondly, make sure the technology is functioning smoothly so that candidates are not put off. We are not truly functioning in the way God intended for us if we are not givers. Her kidneys are working again, but we couldn't say they are functioning normally. The room would be lit up and a fan ", "also starts functioning once the cradle starts rocking. But the group has been using two old laptops one of which is not functioning properly. The only outstanding issue is related to the archive links not functioning. He said the system had functioned well in the past and did not serve any specific group. If Iraq was a deeply dysfunctional society, its sport was barely functioning. My other alarm system is still functioning though, so don't think about breaking in burglars. Synonymswork, go, run, be in running order, be in working order, operate, perform, be in action, be operative1.1function as Fulfill the purpose or task of (a specified thing) the museum intends to function as an educational and study center Example sentencesExamples She accompanies the bride to her new home and functions as a companion, adviser and confidante. Boniface was ", "also prominent in Frankish church reform and functioned as representative of the pope to the Franks. The more isolated the tasks are, the more you inhibit their ability to function as a team. A permanent body that functions as an external examination institute is still only wishful thinking. In former times local headmen functioned as war chiefs, but paramount chiefs over various local communities were absent. It functions as a summerhouse and office with attached potting shed. There is an excellent listing of the large number of ways in which environmentalism functions as a religion here. This joint thus functions as a tapas bar, but replaces typical tapas dishes with North African panache. What I didn't know then was that this form of prejudice functioned as a way to express the values I had grown up with. All of this is to say that the new digital environment functions as, well, a web. Most recently I functioned as opponent in a PhD thesis at the Institut d'études politiques de Paris The tree was designed for a specific purpose, but it could no longer function as a tree. This gadget not only controls the presence of employees but ", "also functions as a security device. His odyssey functions as a satire of the war, the leaders, and the army. It is an installation, which means that the artwork functions as the whole room. The London Underground functioned as a series of bomb shelters during the Blitz of World War II. Although hydrogen peroxide functions as a disinfectant, it contains toxins harmful to the health. American Jews found themselves notable in the history of the Jewish diaspora in that they never functioned as their nation's most stigmatized group. This executive branch of government never functions as accurate and honest mirrors of the president. Synonymsserve, act, operate, perform, work, behaveOriginMid 16th century: from French fonction, from Latin functio(n-), from fungi ‘perform’."]}, {"dict": "Oxford5000", "values": ["function asSee functionDefinition of function in English: function noun ˈfʌŋ(k)ʃ(ə)nˈfəŋ(k)ʃ(ə)n1An activity that is natural to or the purpose of a person or thing. bridges perform the function of providing access across water bodily functions Example sentencesExamples Four important bodily functions are provided by the muscles of our bodies. It is on a pivotal city centre site and we do not see the two other city centre post offices performing the functio", "n. When a breast can't perform its natural functions, many women find it difficult to accept it as part of their body. According to Dr. Jose, the opening up of micro-vascular channels enhances the natural physiological functions. These priorities will be driven by the needs of the organization, which are a function of the business purposes and current problems. This is because, the article argues, they are a similar frequency to the type of electrical activity natural to cellular functions and so may cause interference. In nearly all cases, the best that can be hoped for is an alternative to natural functions which is almost as good as the real thing. Today the centre is in full use with sporting activities, meetings, courses, functions and other activities such as the very successful play group. But it does play on social mores and our embarrassment about natural bodily functions, albeit in a crude way. Grammar is just a natural function of children's brains, and they apply it to whatever they find. Apparently they have very important natural functions in the brain but, like everything else, can go awry sometimes - a bit like cells going wrong and turning into cancer. There was a presentation which looked at what a Parish Pastoral Council is, its role, functions and activities. What the dogs do is a natural function but where they do it is chosen by humans. One of the great things about getting older is that you become less embarrassed about your body and its natural functions. New Forestry aimed to mimic natural forest functions while providing for conventional timber objectives. One plus of physical stores, says Sinnreich, is that they perform educational and informational functions in ways a Web site can't duplicate. This bill sets out in minute detail the functions and purposes of this new entity in a way that I have never seen before. But its increased economic insularity is more likely to be a natural function of its financial predicament. In both cases, the ultimate goal is to understand how suites of traits and trade-offs between competing functions respond to natural selectio", "n. The law regulates the establishment, scope, functions and the activity of the Commission on Financial Supervisio", "n. Synonymspurpose, task, use, rolereason, basis, justificationresponsibility, duty, concern, province, aim, activity, assignment, obligation, chargetask, chore, job, role, errand, mission, detail, undertaking, commissioncapacity, post, situation, office, occupation, employment, business, operationFrench raison d'êtreinformal thing, bag, line of country, pigeon1.1mass noun Practical use or purpose in desig", "n. building designs that prioritize style over function Example sentencesExamples The bed - area was clearly designed for function rather than comfort. This discourse of function is transparent in design, but only occasionally with ", "art. I'll do my best to keep the overall design and function clean and simple but I'm looking forward to getting properly to grips with the new methodology. The one-piece design is no-frills, designed for function rather than beauty. Hargrave believed that good function was good design and that every boat should look attractive without a lot of decoration or trim. We're not trying to attack anybody here: We're trying to talk about the status and function of design in culture. Its roof can politely be described as a victory for design over functio", "n. Constantia was designed with function and flexibility in mind. The radio controls are designed more for style than function and are awkward to use. The reasons for docking originated in aesthetic design, function, early medical theory and even tax minimisatio", "n. The idea of function sounds very practical, very sensible, whereas beauty sounds a bit airy-fairy and a bit off in the clouds. We offer a wide range, good design and function, and ", "also low prices. It's a case of function dictating similar design, but more of that later. The only real drawback is an interior where design has triumphed over function, as any kind of storage space is very hard to find. I ", "also found that the mirrors appeared to be a product of design over functio", "n. The models presented here represent the state of the art in function, design and manufacture. He stressed the importance of engineering and function in art and design courses. Its architecture, furniture, design, function and systems are charmingly retro. Motorcycle exhausts are designed with style and function in mind. Often, the product's physical form becomes smaller, more compact, and more efficient in design functio", "n.1.2 A basic task of a computer, especially one that corresponds to a single instruction from the user. Example sentencesExamples The Deskbar has the added advantage (for Google) that you end up using Google's search functions more than you even did previously. The capacity to spell and write grammatically correct sentences is abated by the availability of spell- and grammar-checking functions in word processing software. Maybe this is not exactly up to the point, but one of the Google search functions is called ‘I am feeling lucky!’ While you're able to see what each icon does, there is very little if any instructions about what these functions mea", "n. Medical billing software with quick searching functions enables offices to quickly and effectively manage multiple databases worth of informatio", "n. An undo function permits users to undo the most recent configuratio", "n. The package has an invitation function, calling available users to conference and giving them the option of accepting or not. Each gesture performed on the touch pad corresponds to a control functio", "n. Take as an example a situation where you've created a keyboard hack for your arcade controls but still need to be able to operate your computer for non-gaming functions. Method and apparatus for presenting new computer software functions to a user based upon actual usage Many pieces lay bare digital networks: various vertical and horizontal scrolling functions on the computer screen reveal the image structure. An icon is a graphic image that represents an available function on a computer's graphical user interface. You can actually add a button with an exit function to the user interface. On the right section of the taskbar are icons for general computer functions like speaker volume, clock and printer status. Selection of functions lets image-processing software branch out. Control and user interface functions, if needed for a particular application can ", "also be functionally partitioned.2Mathematics A relation or expression involving one or more variables. the function (bx + c) Example sentencesExamples His work is almost exclusively on calculus, in particular differential equations and functions of a real variable. Then of course the relevant integrals involve odd functions, and it results that the centroid lies on the y-axis. There is only one way to represent any amount as the sum of pennies which is expressed as the generating functio", "n. A chapter follows covering algorithms for computing key elementary functions on integers. However, the coefficients are expressed as functions of water potential thus allowing the model to be applied under all conditions of temperature and water potential. Since most functions defined by simple algebraic expressions are differentiable, on a sufficiently fine scale the points will appear to fall on a straight line. A function which expresses the relation between the coefficient of permeability and the effective stress is presented. For example, the exponent b in the rate functions of the expressions in Eq. 5 was assigned a universal value. To calculate the selection coefficients, the fitness function must be expressed as a polynomial. His work was in number theory, in particular the zeta functio", "n.2.1 A variable quantity regarded in relation to one or more other variables in terms of which it may be expressed or on which its value depends. the magnetic field has varied as a function of time Example sentencesExamples Solving the equations of the best response functions gives expressions for equilibrium outputs. This work led him to the Dirichlet problem concerning harmonic functions with given boundary conditions. Jacobi presented a paper concerning iterated functions to the Berlin Academy of Sciences in 1825. Spectral analysis decomposes a variable into underlying sine and cosine functions of particular wavelengths or cycles. He found expressions for the Bessel functions as integrals involving Legendre functions.2.2ChemistryA functional group. the carboxyl group was replaced by functions that included tetrazolyl-, sulphonyl-, and phosphoryl- Example sentencesExamples Single-site analysis and one-dimensional window analysis can be used to detect selection when the biological functions of amino acid sites are unknow", "n. The primary function of this system is the exchange of oxygen and carbon dioxide; secondary functions are phonation and olfactio", "n. Ozone is especially menacing when it reacts with molecules involved in the functions of living organisms. This points to the importance of this stretch of amino acids for the function of both proteins. For instance, in the case of the two active stereoisomers we showed that only the stereochemistry at the amine and hydroxyl functions on the scaffold were important - the third chiral centre is not.3A thing dependent on another factor or factors. class shame is a function of social power Example sentencesExamples Rabbinical courts throughout the rest of the world function without such powers of coercio", "n. However, given the small sample size and degree of variability, it is possible that this result is a function of low statistical power. Obviously, its quality is partly a function of its power to persuade, but its persuasiveness is in the eye of the beholder. These factors are a function of sampling effort and sampling strategy. The children's flirtation with radicalism and terrorism is a function of two factors - time and opportunity. The mental mindgames the three plays chillingly reveal truth to be a function of power. The final decision as to whether or not to seek help is a function of all these factors. It is such an enormous power, no one is going to resist its interpretation of the law, and the law therefore becomes a function of power, as it has always bee", "n. The different results may be a function of cultural, social, and geographical influences. Actual economic results, including the goods and the bads, are a function of numerous factors and forces. Thus the optimal leaf lifespan may be a function of two factors: the rate of nitrogen uptake and of PNUE reductio", "n. Interference is a function of peak power, not average. Because they concretely challenged the function of power rather than engage in symbolic ritual protest of it, right? In this case, the Soviet nostalgia is not a function of crude economic or social factors, but of the acute sense of geo-political loss. ANOVA was conducted to examine whether the factors varied as a function of geographical region or section membership in CPA. Anger is often a function of power and the need to dominate and control. On another level, the play chillingly shows ‘truth’ to be a function of power. Where an agency is headed by a strong and credible leader, given a clear mandate to deliver, and the power to influence the functions of other departments and agencies, success can be achieved. If one part fails, all dependent functions fail too because of the interdependencies among the components. In summary, the type of deformation observed in rocks presently exposed at the Earth's surface is a function of many factors, not the least of which is the level of exposure. Synonymsconsequence, result, outcome, ramification, corollary, concomitantdated issue4A large or formal social event or ceremony. he was obliged to attend party functions Example sentencesExamples Apart from the blacksmith shop he ", "also became the owner of a large assembly hall, which was used for meetings, parties and other community functions of a social nature. They drive a Rolls-Royce, live at Vaucluse, attend exclusive social functions and have been lunch guests of Governor-General Mike Jeffery. Some consider that it is connected with ‘high society’ and formal social functions. Parties, functions, dinners and gatherings are most avoidable outings in his notebook. Besides, the members get together for occasional functions such as birthday parties and weddings. Mulchay notes that the outside area is popular with families during the summer and provides a comfortable environment for functions and social events. If your family has formal festive functions, this one's for you. My husband is a university professor, and we get many invitations to dinner parties, formal gatherings, and other social functions. Ross, as club's co-founder and Chairman, manages the 40-strong warmwater branch, and the two sides come together for social events and other functions. He recorded his thanks and appreciation to the many organisations and individuals who invited him to attend their functions or events over the last 12 months. The crops of spring onions, lettuce and Chinese cabbage were given free to guests at a formal function to celebrate the event on Friday. And since Mathilde was again pregnant, she will not have been keen to have a full diary of cultural events and social functions. This groundswell of patriotism has been nurtured and strengthened by political functions and religious ceremonies in remembrance of the September attacks. ‘Oh, he's the smart one,’ she'd say with admiration at dinner parties and social functions. They attended on the mayor at civic functions and ceremonial occasions, and sometimes played in the street at night. As we walked around to thank our supporters after the final whistle, I recognised many fans that we all knew so well through the many functions and events we attended together. It was traditionally worn by kings, queens and other great figures of state during ceremonial events and functions. He finds himself at various functions, meetings, ceremonies and openings, at a plethora of venues such as hospitals, colleges, sports centres and theatres. Castlehill Catering has recently joined the Ballina Chamber of Commerce and specialises in Catering for private functions and social events. In addition to subsistence benefits from direct consumption and trading, whale hunting and its associated components fulfilled important ceremonial and social functions for the Makah. Synonymssocial event, party, occasion, social occasion, affair, gathering, reception, soirée, celebration, jamboree, galaNorth American leveeinformal do, bash, shindig, shindy, blowoutBritish informal rave-up, thrash, knees-up, jolly, beanfeast, bunfight, beano, ligverb ˈfʌŋ(k)ʃ(ə)nˈfəŋ(k)ʃ(ə)n[no object]1Work or operate in a proper or particular way. her liver is functioning normally Example sentencesExamples However, it keeps on functioning, regenerates itself, and discovers new limits. It's hard enough to read that theatrical prose when my brain is functioning. Fortunately for me, my poetry bone is not functioning at all just now, so there's no conflict. My other alarm system is still functioning though, so don't think about breaking in burglars. The room would be lit up and a fan ", "also starts functioning once the cradle starts rocking. Her kidneys had stopped functioning and she must have put on 30 pounds of fluid. Our engines have ceased functioning and we will attempt an emergency landing. Going there certainly made me understand better who we all are as people functioning in a society and a culture. We are not truly functioning in the way God intended for us if we are not givers. Her kidneys are working again, but we couldn't say they are functioning normally. But the group has been using two old laptops one of which is not functioning properly. If Iraq was a deeply dysfunctional society, its sport was barely functioning. Team efforts and long hours of work meant that the town was soon functioning normally. Great news for people who have a hunger control switch that is functioning well in the brai", "n. The only outstanding issue is related to the archive links not functioning. Of course, Egg's plans to break even depend on its Web site functioning and fully operational. He said the system had functioned well in the past and did not serve any specific group. But even though her attacks could last up to three days, she could carry on functioning. Secondly, make sure the technology is functioning smoothly so that candidates are not put off. If the Lord wants to keep you alive and functioning then he doesn't need any artificial help from mankind. Synonymswork, go, run, be in working/running order, operate, perform, be in action, be operative1.1function as Fulfil the purpose or task of (a specified thing) the museum intends to function as an educational and study centre Example sentencesExamples In former times local headmen functioned as war chiefs, but paramount chiefs over various local communities were absent. This gadget not only controls the presence of employees but ", "also functions as a security device. The more isolated the tasks are, the more you inhibit their ability to function as a team. What I didn't know then was that this form of prejudice functioned as a way to express the values I had grown up with. There is an excellent listing of the large number of ways in which environmentalism functions as a religion here. She accompanies the bride to her new home and functions as a companion, adviser and confidante. Although hydrogen peroxide functions as a disinfectant, it contains toxins harmful to the health. A permanent body that functions as an external examination institute is still only wishful thinking. It is an installation, which means that the artwork functions as the whole room. All of this is to say that the new digital environment functions as, well, a web. Most recently I functioned as opponent in a PhD thesis at the Institut d'études politiques de Paris This joint thus functions as a tapas bar, but replaces typical tapas dishes with North African panache. The tree was designed for a specific purpose, but it could no longer function as a tree. American Jews found themselves notable in the history of the Jewish diaspora in that they never functioned as their nation's most stigmatized group. His odyssey functions as a satire of the war, the leaders, and the army. This executive branch of government never functions as accurate and honest mirrors of the president. It functions as a summerhouse and office with attached potting shed. The London Underground functioned as a series of bomb shelters during the Blitz of World War II. Boniface was ", "also prominent in Frankish church reform and functioned as representative of the pope to the Franks. Synonymsserve, act, operate, perform, work, behavehave/do the job of, play the role of, act the part of, perform the function of, do duty as, constitute, formDerivativesfunctionlessadjectiveHe chuckled at a perky, muff-like dog tottering along as if to remind the Swedes a British dog is what a dog is - unexpendable, functionless, highly ridiculous. Example sentencesExamples They are functionless things, and Rashid prefers his objects to have form and functio", "n. The gargoyles are functionless and the half-timbered effect of the East wing, which is a later addition and houses a billiard room, is entirely bogus, the timbers being painted on to a surface of scabrous cement. The general consensus is that the majority of the non-coding, non-regulatory DNA is functionless (the so called ‘junk DNA’). Part of this functionless, ‘junk’ DNA is made up of long stretches of repeated sequences of the four nucleotide building blocks from which DNA is constructed. One of the reasons for this seems to be to do with the current obsession of video game developers with creating amazingly detailed but functionless graphics that look good in adverts and shop windows.OriginMid 16th century: from French fonction, from Latin functio(n-), from fungi 'perform'.Rhymescompunction, conjunction, dysfunction, expunction, junction, malfunction, multifunction, unctionDefinition of function in US English: function nounˈfəŋ(k)ʃ(ə)nˈfəNG(k)SH(ə)n1An activity or purpose natural to or intended for a person or thing. bridges perform the function of providing access across water Vitamin A is required for good eye function Example sentencesExamples Four important bodily functions are provided by the muscles of our bodies. Grammar is just a natural function of children's brains, and they apply it to whatever they find. These priorities will be driven by the needs of the organization, which are a function of the business purposes and current problems. It is on a pivotal city centre site and we do not see the two other city centre post offices performing the functio", "n. Today the centre is in full use with sporting activities, meetings, courses, functions and other activities such as the very successful play group. There was a presentation which looked at what a Parish Pastoral Council is, its role, functions and activities. This bill sets out in minute detail the functions and purposes of this new entity in a way that I have never seen before. New Forestry aimed to mimic natural forest functions while providing for conventional timber objectives. Apparently they have very important natural functions in the brain but, like everything else, can go awry sometimes - a bit like cells going wrong and turning into cancer. What the dogs do is a natural function but where they do it is chosen by humans. The law regulates the establishment, scope, functions and the activity of the Commission on Financial Supervisio", "n. When a breast can't perform its natural functions, many women find it difficult to accept it as part of their body. One plus of physical stores, says Sinnreich, is that they perform educational and informational functions in ways a Web site can't duplicate. In nearly all cases, the best that can be hoped for is an alternative to natural functions which is almost as good as the real thing. One of the great things about getting older is that you become less embarrassed about your body and its natural functions. But it does play on social mores and our embarrassment about natural bodily functions, albeit in a crude way. According to Dr. Jose, the opening up of micro-vascular channels enhances the natural physiological functions. But its increased economic insularity is more likely to be a natural function of its financial predicament. In both cases, the ultimate goal is to understand how suites of traits and trade-offs between competing functions respond to natural selectio", "n. This is because, the article argues, they are a similar frequency to the type of electrical activity natural to cellular functions and so may cause interference. Synonymspurpose, task, use, roleresponsibility, duty, concern, province, aim, activity, assignment, obligation, charge1.1 Practical use or purpose in desig", "n. building designs that prioritize style over function Example sentencesExamples Its architecture, furniture, design, function and systems are charmingly retro. Often, the product's physical form becomes smaller, more compact, and more efficient in design functio", "n. The idea of function sounds very practical, very sensible, whereas beauty sounds a bit airy-fairy and a bit off in the clouds. It's a case of function dictating similar design, but more of that later. The bed - area was clearly designed for function rather than comfort. Motorcycle exhausts are designed with style and function in mind. I'll do my best to keep the overall design and function clean and simple but I'm looking forward to getting properly to grips with the new methodology. Its roof can politely be described as a victory for design over functio", "n. This discourse of function is transparent in design, but only occasionally with ", "art. We're not trying to attack anybody here: We're trying to talk about the status and function of design in culture. The only real drawback is an interior where design has triumphed over function, as any kind of storage space is very hard to find. The reasons for docking originated in aesthetic design, function, early medical theory and even tax minimisatio", "n. The one-piece design is no-frills, designed for function rather than beauty. The radio controls are designed more for style than function and are awkward to use. I ", "also found that the mirrors appeared to be a product of design over functio", "n. He stressed the importance of engineering and function in art and design courses. Constantia was designed with function and flexibility in mind. We offer a wide range, good design and function, and ", "also low prices. The models presented here represent the state of the art in function, design and manufacture. Hargrave believed that good function was good design and that every boat should look attractive without a lot of decoration or trim.1.2 A basic task of a computer, especially one that corresponds to a single instruction from the user. Example sentencesExamples Method and apparatus for presenting new computer software functions to a user based upon actual usage Maybe this is not exactly up to the point, but one of the Google search functions is called ‘I am feeling lucky!’ An undo function permits users to undo the most recent configuratio", "n. Medical billing software with quick searching functions enables offices to quickly and effectively manage multiple databases worth of informatio", "n. The Deskbar has the added advantage (for Google) that you end up using Google's search functions more than you even did previously. Each gesture performed on the touch pad corresponds to a control functio", "n. Many pieces lay bare digital networks: various vertical and horizontal scrolling functions on the computer screen reveal the image structure. On the right section of the taskbar are icons for general computer functions like speaker volume, clock and printer status. The package has an invitation function, calling available users to conference and giving them the option of accepting or not. Control and user interface functions, if needed for a particular application can ", "also be functionally partitioned. The capacity to spell and write grammatically correct sentences is abated by the availability of spell- and grammar-checking functions in word processing software. Take as an example a situation where you've created a keyboard hack for your arcade controls but still need to be able to operate your computer for non-gaming functions. An icon is a graphic image that represents an available function on a computer's graphical user interface. While you're able to see what each icon does, there is very little if any instructions about what these functions mea", "n. You can actually add a button with an exit function to the user interface. Selection of functions lets image-processing software branch out.2Mathematics A relationship or expression involving one or more variables. the function (bx + c) Example sentencesExamples Since most functions defined by simple algebraic expressions are differentiable, on a sufficiently fine scale the points will appear to fall on a straight line. A function which expresses the relation between the coefficient of permeability and the effective stress is presented. There is only one way to represent any amount as the sum of pennies which is expressed as the generating functio", "n. However, the coefficients are expressed as functions of water potential thus allowing the model to be applied under all conditions of temperature and water potential. To calculate the selection coefficients, the fitness function must be expressed as a polynomial. His work is almost exclusively on calculus, in particular differential equations and functions of a real variable. Then of course the relevant integrals involve odd functions, and it results that the centroid lies on the y-axis. His work was in number theory, in particular the zeta functio", "n. For example, the exponent b in the rate functions of the expressions in Eq. 5 was assigned a universal value. A chapter follows covering algorithms for computing key elementary functions on integers.2.1 A variable quantity regarded in relation to one or more other variables in terms of which it may be expressed or on which its value depends. Example sentencesExamples Solving the equations of the best response functions gives expressions for equilibrium outputs. He found expressions for the Bessel functions as integrals involving Legendre functions. This work led him to the Dirichlet problem concerning harmonic functions with given boundary conditions. Jacobi presented a paper concerning iterated functions to the Berlin Academy of Sciences in 1825. Spectral analysis decomposes a variable into underlying sine and cosine functions of particular wavelengths or cycles.2.2ChemistryA functional group. Example sentencesExamples This points to the importance of this stretch of amino acids for the function of both proteins. Ozone is especially menacing when it reacts with molecules involved in the functions of living organisms. The primary function of this system is the exchange of oxygen and carbon dioxide; secondary functions are phonation and olfactio", "n. Single-site analysis and one-dimensional window analysis can be used to detect selection when the biological functions of amino acid sites are unknow", "n. For instance, in the case of the two active stereoisomers we showed that only the stereochemistry at the amine and hydroxyl functions on the scaffold were important - the third chiral centre is not.3A thing dependent on another factor or factors. class shame is a function of social power Example sentencesExamples Anger is often a function of power and the need to dominate and control. Where an agency is headed by a strong and credible leader, given a clear mandate to deliver, and the power to influence the functions of other departments and agencies, success can be achieved. Actual economic results, including the goods and the bads, are a function of numerous factors and forces. On another level, the play chillingly shows ‘truth’ to be a function of power. The different results may be a function of cultural, social, and geographical influences. The children's flirtation with radicalism and terrorism is a function of two factors - time and opportunity. The final decision as to whether or not to seek help is a function of all these factors. ANOVA was conducted to examine whether the factors varied as a function of geographical region or section membership in CPA. Interference is a function of peak power, not average. In summary, the type of deformation observed in rocks presently exposed at the Earth's surface is a function of many factors, not the least of which is the level of exposure. Rabbinical courts throughout the rest of the world function without such powers of coercio", "n. The mental mindgames the three plays chillingly reveal truth to be a function of power. In this case, the Soviet nostalgia is not a function of crude economic or social factors, but of the acute sense of geo-political loss. It is such an enormous power, no one is going to resist its interpretation of the law, and the law therefore becomes a function of power, as it has always bee", "n. Because they concretely challenged the function of power rather than engage in symbolic ritual protest of it, right? These factors are a function of sampling effort and sampling strategy. However, given the small sample size and degree of variability, it is possible that this result is a function of low statistical power. Thus the optimal leaf lifespan may be a function of two factors: the rate of nitrogen uptake and of PNUE reductio", "n. Obviously, its quality is partly a function of its power to persuade, but its persuasiveness is in the eye of the beholder. If one part fails, all dependent functions fail too because of the interdependencies among the components. Synonymsconsequence, result, outcome, ramification, corollary, concomitant4A large or formal social event or ceremony. he was obliged to attend party functions Example sentencesExamples If your family has formal festive functions, this one's for you. He finds himself at various functions, meetings, ceremonies and openings, at a plethora of venues such as hospitals, colleges, sports centres and theatres. In addition to subsistence benefits from direct consumption and trading, whale hunting and its associated components fulfilled important ceremonial and social functions for the Makah. He recorded his thanks and appreciation to the many organisations and individuals who invited him to attend their functions or events over the last 12 months. The crops of spring onions, lettuce and Chinese cabbage were given free to guests at a formal function to celebrate the event on Friday. As we walked around to thank our supporters after the final whistle, I recognised many fans that we all knew so well through the many functions and events we attended together. Parties, functions, dinners and gatherings are most avoidable outings in his notebook. It was traditionally worn by kings, queens and other great figures of state during ceremonial events and functions. They drive a Rolls-Royce, live at Vaucluse, attend exclusive social functions and have been lunch guests of Governor-General Mike Jeffery. Some consider that it is connected with ‘high society’ and formal social functions. Ross, as club's co-founder and Chairman, manages the 40-strong warmwater branch, and the two sides come together for social events and other functions. Castlehill Catering has recently joined the Ballina Chamber of Commerce and specialises in Catering for private functions and social events. Besides, the members get together for occasional functions such as birthday parties and weddings. My husband is a university professor, and we get many invitations to dinner parties, formal gatherings, and other social functions. This groundswell of patriotism has been nurtured and strengthened by political functions and religious ceremonies in remembrance of the September attacks. ‘Oh, he's the smart one,’ she'd say with admiration at dinner parties and social functions. And since Mathilde was again pregnant, she will not have been keen to have a full diary of cultural events and social functions. Mulchay notes that the outside area is popular with families during the summer and provides a comfortable environment for functions and social events. Apart from the blacksmith shop he ", "also became the owner of a large assembly hall, which was used for meetings, parties and other community functions of a social nature. They attended on the mayor at civic functions and ceremonial occasions, and sometimes played in the street at night. Synonymssocial event, party, occasion, social occasion, affair, gathering, reception, soirée, celebration, jamboree, galaverbˈfəŋ(k)ʃ(ə)nˈfəNG(k)SH(ə)n[no object]1Work or operate in a proper or particular way. her liver is functioning normally Example sentencesExamples If the Lord wants to keep you alive and functioning then he doesn't need any artificial help from mankind. It's hard enough to read that theatrical prose when my brain is functioning. Of course, Egg's plans to break even depend on its Web site functioning and fully operational. However, it keeps on functioning, regenerates itself, and discovers new limits. Team efforts and long hours of work meant that the town was soon functioning normally. Going there certainly made me understand better who we all are as people functioning in a society and a culture. But even though her attacks could last up to three days, she could carry on functioning. Great news for people who have a hunger control switch that is functioning well in the brai", "n. Our engines have ceased functioning and we will attempt an emergency landing. Fortunately for me, my poetry bone is not functioning at all just now, so there's no conflict. Her kidneys had stopped functioning and she must have put on 30 pounds of fluid. Secondly, make sure the technology is functioning smoothly so that candidates are not put off. We are not truly functioning in the way God intended for us if we are not givers. Her kidneys are working again, but we couldn't say they are functioning normally. The room would be lit up and a fan ", "also starts functioning once the cradle starts rocking. But the group has been using two old laptops one of which is not functioning properly. The only outstanding issue is related to the archive links not functioning. He said the system had functioned well in the past and did not serve any specific group. If Iraq was a deeply dysfunctional society, its sport was barely functioning. My other alarm system is still functioning though, so don't think about breaking in burglars. Synonymswork, go, run, be in running order, be in working order, operate, perform, be in action, be operative1.1function as Fulfill the purpose or task of (a specified thing) the museum intends to function as an educational and study center Example sentencesExamples She accompanies the bride to her new home and functions as a companion, adviser and confidante. Boniface was ", "also prominent in Frankish church reform and functioned as representative of the pope to the Franks. The more isolated the tasks are, the more you inhibit their ability to function as a team. A permanent body that functions as an external examination institute is still only wishful thinking. In former times local headmen functioned as war chiefs, but paramount chiefs over various local communities were absent. It functions as a summerhouse and office with attached potting shed. There is an excellent listing of the large number of ways in which environmentalism functions as a religion here. This joint thus functions as a tapas bar, but replaces typical tapas dishes with North African panache. What I didn't know then was that this form of prejudice functioned as a way to express the values I had grown up with. All of this is to say that the new digital environment functions as, well, a web. Most recently I functioned as opponent in a PhD thesis at the Institut d'études politiques de Paris The tree was designed for a specific purpose, but it could no longer function as a tree. This gadget not only controls the presence of employees but ", "also functions as a security device. His odyssey functions as a satire of the war, the leaders, and the army. It is an installation, which means that the artwork functions as the whole room. The London Underground functioned as a series of bomb shelters during the Blitz of World War II. Although hydrogen peroxide functions as a disinfectant, it contains toxins harmful to the health. American Jews found themselves notable in the history of the Jewish diaspora in that they never functioned as their nation's most stigmatized group. This executive branch of government never functions as accurate and honest mirrors of the president. Synonymsserve, act, operate, perform, work, behaveOriginMid 16th century: from French fonction, from Latin functio(n-), from fungi ‘perform’."]}], "usphone": "", "ukphone": ""}