{"name": "think of as", "trans": [{"dict": "Oxford5000", "values": ["think the world ofSee worldDefinition of world in English: world noun wəːldwərld1usually the worldThe earth, together with all of its countries and peoples. he was doing his bit to save the world it's a wonderful world Example sentencesExamples The students come from all over the world, a wonderful combination of people. Annually millions of Canadians travel to other nations all over the world for a whole variety of reasons. They've sold three million albums, toured all over the world and have been together for almost a decade. Oliver is hoping to climb his way into the history books by planting a flag at the summit of the world's tallest mountai", "n. I thank them for going and sharing some time in that wonderful part of the world. However, only they can choose what to do and they have all chosen to try and save the world they live i", "n. The sea connotes what the land is not, yet together they form the world's surfaces. Not all of these acts proved to be that useful later on, but it gave you the feeling you did your bit to save the world. There are many mountain ranges throughout the world, all of various ages and sizes. Soils, such as podzols, which are zonal in some parts of the world might be intrazonal in other areas. He admits the prospect of seven days cycling over some of the world's most inhospitable terrain is a bit daunting. The couple travelled the world together three years ago and fell in love with Asia. It is truly wonderful to have a whole lot of girl-friends living in various parts of the world. What is astonishing is how little our cartographic concept of the world has changed since the", "n. The Himalayas is the highest and one of the most beautiful mountain ranges of the world. Some may argue that we should look after our own before we go off trying to save the world. Today we see a vast new working class brought together in great conurbations across the world. Using your bike for errands is a great way to do your little part to save the world. Before they rush out to say that they want to save the world - how about themselves? Today, I spent my whole day meeting with the representatives from all over the world. Synonymsearth, globe, planet, sphere1.1the world All of the people and societies on the earth. the whole world hates a Monday Example sentencesExamples Sovereignty still remains a supremely important institution of world politics. They sometimes wonder why the rest of the world hates them so much. Let her go abroad and tell the world how primitive is the structure of our society. He never felt love and because of that, hated the world and the world hated him in retur", "n. The fall in European growth rates has implications for the world economy as a whole. We truly are entering one of the most important times in world history. I want to prove to myself and to the world that my life is whole agai", "n. These children need to know that their stories are important to the world outside. On a more serious note, it would appear that the world as a whole is sinking deeper into poverty. Yet the financial crisis has been so severe that its impact has disturbed the world economy as a whole. The collapse of the world economy was felt hardest amongst the working classes of the North East. To be a man you have to be a businessman who faces the world by himself and who has to fight the whole world by himself. For all their failings, journalists serve the societies they live in and the world at large. Africa cannot jump into a world market economy as quickly as it wants. There are, of course, major differences between the European Union and the world as a whole. He hung a map of the world on the wall in his little cottage, and he read as widely as he could about world affairs. Am I first a woman and then a member of my society, community, world, or vice versa? She stayed there for hours, crying for her brother, and hating the world for taking him away. It's a nice thought that there's someone who loves you, even when you think the whole world hates you. On the contrary, the world economy as a whole is marked by slow growth and outright stagnatio", "n. Synonymseveryone, everybody, each and every one, people, mankind, humankind, humanity, people everywhere, the whole world, the world at large, the public, the general public, the population, the populace, all and sundry, every mother's son, {every Tom, Dick, and Harry}, every man jack1.2as modifier Denoting one of the most important people or things of their class. a world superstar Example sentencesExamples Las Vegas, said Ashley, was the perfect setting for the world powerlifting championships. Afterwards, the world number one was distinctly underwhelmed with the outcome. He's the world knife-throwing champion - and he's about to throw those knives at me. In the world championship final in Paris she was left standing by a 67-second lap. Imagine how exciting it was to watch this British athlete set a world record and beat a world superstar. He will take it on the chin and be back at the Crucible where I think he has at least another three or four chances to win back the world title. The squad fly out on Friday, with less than 24 hours to settle in before meeting the world champions. After the day of British champions comes an evening for world superstars. The fun run set the world record for the largest gathering of Santas in one place. It is the group's strategy to become one of the world leaders in the textile industry, he said. He went to the Olympic Games as the world number one intending only to return with the gold medal, but it was not to be. He became the biggest superstar of world rugby, but he is an understated hero. My gut feeling is that the world champions will have to fight very hard to maintain their winning streak in Edinburgh. I hope I can go as far as reaching the world number one, but I realize it requires hard work. Ireland could be the world leader in online tourism within the next two years. There are tournaments to play that move you up the world rankings and that's more important now. They are the world champions and a class side, but if they are not quite on their game, that is when you can get at them. He had his first race just two days after his sixth birthday at the world championship track near Swindo", "n. And the world number one gave one journalist short shrift when asked what was wrong with his game. All schools that took part will receive a certificate confirming their success in winning the world record.1.3 Another planet like the earth. the possibility of life on other worlds Example sentencesExamples Someday solar sails might be used to send astronauts to new worlds around other stars. His ideas on cosmology are quite remarkable for he not only argued for a moving Earth, but he ", "also argued for an infinite universe containing other stars like the Sun and other worlds like the Earth. The asteroids are tiny worlds that should have clumped together to form another major planet. Astronomers are finding new worlds by the dozen - settling one ancient debate and sparking a multitude of others. A new computer model designed to explore the range of possibilities for planet formation around other stars had no trouble coming up with worlds similar to Earth. For one thing, astronomers discovered the Kuiper belt, a teeming ensemble of miniature worlds within which Pluto orbits. It is quite likely that future interstellar explorers will have a wide range of new worlds to explore. At the beginning of the twenty-first century, people are excited by the prospect of visiting new worlds in outer space. It showed the planets as worlds - some greater, some less, than our earth - but all much vaster than the earth as she had been regarded in ancient times. The research may eventually be applied to remove radiation belts around the Earth and other worlds, reducing the hazards of the space environment. For centuries humanity had dreamed of reaching out to the stars, settling on worlds beyond our solar system. Nevertheless, of all the worlds in our solar system, Mars is most like Earth. Intriguingly, this class of worlds includes the Martian moons, from which fully reversible Mars missions could ultimately be staged. But telepresence has been used primarily to explore other worlds. We might instead settle worlds without life, such as Earth's Moon or the asteroids. Now, what we don't know is how many of those Earth size worlds actually have liquid water that could cook up life or will have cooked up life. By studying alien worlds, such as Venus, Mars or Saturn's moon Titan, we can place our own world in context. But the main purpose of this spacecraft will be to carry astronauts beyond our orbit to other worlds. There has been an explosion in the number of astronomers scanning the skies for the telltale wobble of distant worlds. Astronomers had initially expected that other solar systems would follow the pattern of our own: small rocky worlds close to the star and gas giants further out. Synonymsplanet, satellite, moon, star, heavenly body, orb2A particular region or group of countries. the English-speaking world Example sentencesExamples By the western part of the Arabic world we mean the regions comprising mainly North Africa and Spai", "n. Secondly, not all of the developed western world might be seen as civilised. Rather different number systems were used simultaneously in the Arabic world over a long period of time. Yet those of us lucky enough to live in the developed world do not need to cope with such problems. The issue has echoes of the Arab world's historical struggle to assert its own destiny. Croatia is actually located in Central Europe, but it has bridged the Eastern and Western worlds throughout its history. It's one of the most outrageous breaches of human rights in the history of the western world. In many parts of the Western world the media still describe this as the only safe route to peace and stability. Eastern religions are popular across the entire Western world at this time, especially Buddhism, and especially in America. The richest country in the industrialised world will continue to have some of the worst pockets of poverty. Several countries in the developing world continue to invite him to help train their own surgeons. The range of swear words in the modern English-speaking world is tiny, as you know. But in the developed, Western world, the feasting periods are no longer interspersed with famines. Have you ever seen an Arab world as divided as it is right now?2.1 A particular period of history. the ancient world Example sentencesExamples I sometimes imagine that I see certain parallels between modern Aotearoa and the historical worlds of that other boot-shaped nation, Italy. They are now, rightly, seen as an essential element in a proper understanding of the medieval world-view, important to anyone with an interest in the art, literature, philosophy and social structure of that time. In the ancient and classical worlds, capital tended to be drawn into cities from the surrounding regions, so that they could become wealthier even in the absence of economic growth. As the title suggests, Ferguson believes that the British Empire shaped the modern world. Though we think of the Seven Wonders of the Ancient World as a single list today, there were actually a number of lists compiled by different Greek writers.2.2 A particular group of living things. the animal world Example sentencesExamples There is no boundary between the vegetable, animal and human worlds. There is a close relationship in Scripture between the animal world and the demonic. The tiger's immense power and strength give it an aura unmatched in the animal world. But first, they must learn the rules of both the animal and the human worlds. Then she takes that a step further by pretty much banning any human interference in the animal world. Our folklore and arts and crafts reflect our love and reverence for the animal world. On examination, it reveals a coded significance, uniting the worlds of animals, birds, humans and demigods, proposing itself as an image of the universe. Insects are some of the least understood creatures in the animal world. This phenomenon is widespread, occurring in nearly all the major taxa of the plant, animal, and microbial worlds. For the next three decades Eva will be the communicator-the connection between the animal and human worlds. Lying is one of the most human of traits that really distinguishes us from the rest of the animal world. He expected to find similarities in structure within each branch of the animal world. She is equally trapped between animal and human worlds. He is seated on a tiger skin, a symbol of power, showing his mastery over the animal world. Either way, the switch of identities between the human, sacred and animal worlds is a feature of Mongolian belief as it is in countless other folk religions. The presenter uses amusing approaches to introduce children to the animal world. There ", "also seems to be little evidence of genuine teaching in the animal world. Many of these directly incorporate works of art - the art of the wheelchair bound Horibe, whose paintings meld the plant and animal worlds. She borrows it from the animal world and evokes or invokes it on the subject of procreatio", "n. The mineral, vegetable, and animal worlds do exactly what they're created to do.2.3 All that relates to a particular sphere of activity. they were a legend in the world of British theatre the news shocked the football world Example sentencesExamples He still characterises himself as having a foot in both the stand-up and theatre worlds and is currently working with Murphy on putative comic projects. They're all hot, contemporary artists who are taking the art world by storm. In his biography, he comes across as a person comfortably astride various worlds: theatre, painting, books and film. The paintings of a Mancunian former teacher have taken the art world by storm after years of obscurity. Beaufort inhabited the scientific world dominated by the chronometer invented by John Harriso", "n. It's only a matter of time before he is forced to leave his boyhood club and has the football world at his feet. It happens in the football world but it's one of those things you keep quiet about. He is easily transported back to his playing days and into a football world vastly different from today's. So he pursued his dream, by entering the theatre world and then going on to the big scree", "n. Ken, whose background is in media and publishing in the commercial and academic worlds, now employs three full-time staff and a number of part-time staff. Yet in the unsentimental world of modern football, it could just happe", "n. The award-winning film composer has struck a chord in the worlds of film, theatre, classical and pop. The world of football is small, and once you deal with a manager, club or a player, relations develop. He decided the theatre world was a good place to trawl not only for people with money but ", "also for girls. The insular world of the theatre is more commonly a sanctuary from reality. The theatre world found this extremely amusing, although the actor reputedly did not. Someone from outside will have a different experience of the football world. A new form of art had come about quite naturally, yet its presence took the art world by storm. He said the bid could eventually include people from ‘the worlds of football and motorsport’, but said he was unable to give details. The new company will represent talent from the worlds of theatre, film, television and literature in Scotland. Synonymssphere, society, circle, arena, milieu, province, domain, territory, orbit, preserve, realm, field, discipline, area, department, sector, section, group, division2.4one's world One's life and activities. he felt his whole world had collapsed Example sentencesExamples It came as such a shock, and our worlds literally fell i", "n. My whole world has fallen apart and left me feeling hopeless and depressed. She's the center of his whole world. She drove slowly because the sudden collapse of her whole world was affecting the steadiness of her hands. This is my small world and the reality of living with chronic illness.3the worldHuman and social interactio", "n. he has almost completely withdrawn from the world Example sentencesExamples For without a contrast model the world has no way to know or feel the oddness of its dependence on power for survival. Children use toys to imagine the world and to interact with it, learning skills that will be of value in later life. That is the way the world works and why should any one make an exception in my case? I may have been naïve, but even I knew a little about the way the world worked. It gets you interacting with the world in all sorts of different ways. Every artist looks at the world in a definite social manner, whether he or she knows it or not. He wants us to see his work in precisely the same way we observe the world as we move through it. It is a fundamental dispute about the way the world works and what our role in it should be. That seemed to be the way the world worked, people leaving you the minute you didn't have a thing left to offer them. I become irrational, cannot think straight and interact with the world in an entirely strange way. Autism cuts off its sufferers from the world by impairing social skills and imaginative development. These are serious blows to our sense of who we are, what we expect of the world and of our interactions with others. I sit here and all my interaction with the world goes fuzzy as if I am falling asleep. He is constantly frustrated by his inability to change the way the world works more quickly and radically. We teach our students that they are obliged to study the broader social world. Synonymssociety, high societysecular interests, temporal concerns, earthly concernshuman existence3.1 Secular or material matters as opposed to spiritual ones. parents are not viewed as the primary educators of their own children, either in the world or in the Church Example sentencesExamples The concept of Hell as a literal place has declined in an increasingly secular world. The militantly secular world is ", "also keenly alert to the challenge of the Passio", "n. There is a primary difference between the material world and the spiritual dimensio", "n. It seems to be a connector or a medium between the materialistic world and the spiritual world. People who see the world in terms of evil and sin will tend to devalue the material world.3.2 A stage of human life, either mortal or after death. in this world and the next Example sentencesExamples This is an inspiring talk that will help us to establish our own priorities for this world and the next. Then the oxygen machine arrived, the pain medications increased, and my mother slipped out of this world and into the next. I know who I am, and I know that I can only be myself, because that is the only thing I will carry out of this world, my soul. The two ideas could be linked: after all, cremation is itself a wall of fire that is a boundary between this world and the next.Phrasesbe not long for this worldHave only a short time to live. these people either radiate incredible vitality or else complain that they're not long for this world Example sentencesExamples A child, not long for this world should have a heavenly name. One can only assume that the 95-year old is not long for this world. One way or another, whether we like it or not we are all not long for this world. I'm going to need a new chair for the coming season - my old one, made of metal tubing, has developed an alarming creak over the winter and is not long for this world, I fear. Sadly however, like our four other sisters, Caroline, Sophie, Amelie and Victory, he was not long for this world. In act, Dan was still laying drains well after doctors told him he was not long for this world. Sure enough, I tracked him down only to find out that he's extremely ill and possibly not long for this world. In general, my tastes in television are a reliable guide to what's about to get cancelled - if I like it, it is not long for this world. As I watched and listened to Marie, I was overwhelmed by the love she showed this sick, frail man - not long for this world, with nothing to give her in retur", "n. There are a few who know the reasons behind the murders, but they too are not long for this world.the best of both (or all possible) worldsThe benefits of widely differing situations, enjoyed at the same time. I had the best of both worlds, since I worked as an ordinary member of the crew but fed with the officers Example sentencesExamples Splits were thought to offer investors the best of both worlds and ideal for people saving for school fees or for retirement. Many of us in this prosperous country are fortunate to be able to have the best of both worlds. Enjoy the best of both worlds with our insider advice about three fun destinations The council wanted the best of both worlds - trees to enhance the area, but no liability for them once it had officially protected them. Situated not far from the beach you can enjoy the best of both worlds in this relaxed but upmarket centre. This type of work/life situation can be the best of both worlds - challenging work and plenty of support at home. Instead, they frequently enjoy the best of both worlds. Education officers claim the scheme offers the best of both worlds and has the most flexibility to meet children's needs. And there is absolutely nothing wrong with wanting the best of both worlds where culture is concerned. I don't see it as being hypocritical, but rather as having the best of both worlds.bring someone into the worldGive birth to or assist at the birth of someone. Example sentencesExamples My poor mother had died bringing me into the world. Mother's Day should be the most important festival of the year, because it honours the person who brought us into the world. Anyway, never forget what she went through to bring you into the world. Even at an early age I wondered why children are routinely named after their fathers, especially when the job of bringing them into the world is solely the responsibility of the mother. Young Oliver Twist is left in the care of a workhouse near London when his mother dies bringing him into the world. Surgeons brought him into the world using forceps after two earlier attempts to deliver him by ventouse extraction had failed. She was rushed into hospital, where doctors tried to stop the labour to no avail and baby Adam was brought into the world over three months premature. Abigail, a child of great beauty and undiscovered talent, has a safe and loving home with the midwife who brought her into the world. Cathy's labor didn't last long, and in only an hour and a half, baby Daisy was brought into the world. She managed to be both gentle and authoritative and I trusted her to bring you into the world.come into the worldBe bor", "n. Example sentencesExamples My most heart-melting moments were when each of them came into the world. The baby will come into the world, perhaps kicking and screaming, but babyhood will only be the beginning of a continuing process of growth and change. The chimes of Big Ben had barely struck when little Sam came into the world at just one minute past midnight on New Year's Day. After they come into the world, they are cleaned right in the room and then put on a special bed. The boy would come into the world without a father. Maybe Saskia just wasn't ready to come into the world. Forty minutes after Mia had come into the world, her identical twin sister Mona was bor", "n. Screaming lustily, apparently as healthy as his sister despite the awkward way he came into the world, the second child was bor", "n. Her twins came into the world at 25 weeks and five days - Tom weighing 749g and Bonnie 620g. No one wants to see their child undergo an operation and Louise has already had a tough time coming into the world.come up (or go down) in the worldRise (or drop) in status or wealth. he's come up in the world since he went to work for them a street that had once been well heeled but had gone down in the world Example sentencesExamples This neighborhood is going through a transition, and it is coming up in the world, and that fire station will only add to the quality of life for the community. ‘You've come up in the world Ms. Johnson,’ he said, not hiding his antagonism. I thought for sure we'd seen the last of you all those years ago… My, you've come up in the world! He has had to sell his flat in Mayfair because of his bankruptcy, ‘but he has a new flat in Mayfair for his wife and daughter so he's hardly gone down in the world.’ Everybody knows that perfectly good teaching institutions can come to neglect the undergraduates and grind up the idealism of young academics because the faculty, or deans, or provosts want to come up in the world. Lincoln is a city that's come up in the world since last I gave it close inspection, in my RAF days forty years ago. He's come up in the world considerably since the", "n. His mother said the Pilgrims were coming up in the world. Some personal names have undoubtedly gone down in the world. Now it is coming up in the world and is a charming bohemian quarter.in an ideal (or a perfect) worldUsed to express that something is highly desirable but not likely to become a reality. in an ideal world, everyone would pay off their monthly credit card bills on time Example sentencesExamples In a perfect world, I would like my kids to know the support and love of their mother, me, and my partner. In an ideal world, all dance teachers would advocate healthy work habits. In an ideal world, most new parents would rather stay at home, for the baby's first year at least, but financial considerations force them back to work. In an ideal world, we would not need any additional aids to facilitate the training of our horses other than good tack and a good surface. In a perfect world, all you would have to do is create a document, decide which printer you want to use, and print.in a world of one's ownConcerned with one's own thoughts and not aware of what is happening around one. he is in a world of his own and is frequently carried away by his own flights of fancy Example sentencesExamples He was living in a world of his ow", "n. There is no empathy with the public, for they live in a world of their ow", "n. They were spellbound in a world of their ow", "n. Sir Arthur Conan Doyle was trapped in a world of his own making. Today, my father lives in a world of his ow", "n. He seemed to be in a world of his ow", "n. We were in a world of our ow", "n. The referee appeared to be in a world of his ow", "n. Many visitors felt that he lived in a world of his ow", "n. Like all fantasists, Terence Cooper lived in a world of his ow", "n. Synonymsabsent-minded, preoccupied, absorbed, engrossed, far away, somewhere else, not there, not with us, abstracted, with one's head in the clouds, daydreaming, dreamy, inattentive, distracted, thoughtful, pensive, lost in thought, deep in thought, immersed in thought, wool-gathering, in a brown study, musing, brooding, absent, distrait, heedless, obliviousin the worldUsed to express astonishment or disbelief in questions. why in the world did you not reveal yourself sooner? Example sentencesExamples Why in the world is this happening to me? What in the world was going on in her mind?look for all the world likeLook precisely like (used for emphasis) fossil imprints that look for all the world like motorcycle tracks Example sentencesExamples He looked for all the world like an art critic absent-mindedly contemplating a particularly engrossing landscape. He looked for all the world like a little boy who had just brought a slimy frog to his Mother and couldn't understand why she wasn't excited too. When Nadege and I passed, pushing Leyla in a stroller, looking for all the world like a very mismatched mixed-race couple with child, he smiled instinctively at the pretty baby. We crouched beside the tree, looking for all the world like a Christmas card photo. It arrived quite literally in a blaze of glory, wrapped in tinfoil with flames spurting out of the top, looking for all the world like my mum's finest Christmas pudding. She looks for all the world like a little girl who's come to ask my son to play. This year, we had a few more minutes to chat before the panel as he sat there in his wheelchair, looking for all the world like someone who couldn't recall his name, let alone past events. England and Germany looked for all the world like two teams competing to avoid the title of worst team in their sectio", "n. It looked for all the world like a very healthy clump of stinging nettles until it produced a fine display of large, pink flowers. ‘Hey, I'm in the finals,’ he beamed, looking for all the world like a kid in a sweet shop.man (or woman) of the worldA person who is experienced in the ways of sophisticated society. Example sentencesExamples Collis told Dick how Rosemary has become a woman of the world, much different from the young girl they had know", "n. Now, excuse me, I'm a man of the world, and I, for one, find this a rather worrying development. Leonardo and Michelangelo, rivals in everything, were both men of the world and men of business. What a great example Kelly is to impressionable young women of the world. As a woman of the world, Hillary, do you think I should do it? She seemed to personify what we were trying to achieve with the programme: a woman of the world who takes her destiny into her own hands. Born in Singapore, growing up in East London and now based in Los Angeles, Clarisse is a woman of the world. They went out as wide-eyed and gangly young teens, and came back seasoned men of the world, who had developed exotic tastes for horse meat, brandy, and long elegant cigarettes. It quickly became clear that Lyon is a man of the world. On the contrary, he was a man of the world, an experienced soldier, widely travelled, with close contacts with many of the leading men of affairs, both in his own city and elsewhere.not do something for the worldNot do something whatever the inducement. I wouldn't miss it for the world Example sentencesExamples This will be the fight of our lives, but I wouldn't miss it for the world. \"I wouldn't do it for the world,\" Aurora declared. Restructure or decline… A fossil fuel-based, automobile centered and throwaway economic model will not work for the world.out of this worldinformal Extremely enjoyable or impressive. a herb and lemon dressing that's out of this world Example sentencesExamples The whole proceedings were out of this world and almost impossible to describe. The quality of the play was incredible, there were several chances at both ends, there was immense tension and the atmosphere was out of this world. The job is exhausting but the rewards are out of this world. The regular baguettes have a great crust, a medium crumb and lots of taste, and the sourdough baguettes are out of this world for serving with cheese. Along with that peace comes a joy and happiness that's out of this world! Johnson's guitar solo is out of this world - it actually sounds like lead and rhythm playing together, and a brass sectio", "n. It is really out of this world with a fabulous infrastructure, it's very safe and clea", "n. The foie gras terrine was unbelievably rich, and they had a white asparagus salad which was out of this world. The clothes were out of this world and beautifully displayed. The drive was a little over an hour and the scenery was just out of this world. Synonymsmarvellous, magnificent, superb, glorious, sublime, lovely, delightful, first-class, first-ratewonderful, marvellous, magnificent, superb, glorious, sublime, lovely, delightful, first-class, first-ratesee the worldTravel widely and gain wide experience. Example sentencesExamples And it was after this walking tour that he decided he wanted to travel some more and see the world. We were young, excited about travel and seeing the world. The nanny was a woman in her fifties who decided to go travel and see the world with the rest of her life. Now his mind was firmly made up, it was travel for him, he was going to see the world. Michael had travelling in the blood and wanted to see the world. Katrine and Michel were both teachers who loved to travel and this was how they saw the world. These affluent coastal urbanites enjoy seeing the world and are more likely to travel abroad than the average America", "n.think the world ofHave a very high regard for. I thought the world of my father Example sentencesExamples I think the world of my mum, as she is so kind, caring and loving to all of us. He thought the world of his sisters and brother. After my father died, when I was 23, I discovered through others that he thought the world of me. ‘He must have thought the world of his sister,’ says the woman, ‘to do all these commemorative things for her.’ Steven was a shy, quiet lad but when he came out of his shell and people got to know him, they thought the world of him. Her family were her pride and joy and she was devoted to them and they in turn thought the world of her. He thought the world of us and would have hated for us to be unhappy. The boy thinks the world of Emilio, appreciating the kind and attentive way he treats him and his mom. And you ", "also have three loving children who think the world of you so please don't get upset- or angry- over the confrontation this afternoo", "n. She thought the world of all the children she taught over the years. Synonymsadore, hold dear, love, care very much for, feel great affection for, dote on, be devoted to, revere, esteem, admire, appreciatethe world and his wifeEverybody. now all the world and his wife seems to have heard of them Example sentencesExamples Yet here are thirteen hundred named images of babies, toddlers and pre-schoolers for the world and his wife to peer at. Our little mini apartment at the Beach House hotel is right on the boardwalk where the world and his wife, their babies and assorted pets are jogging. With the help of the media, including the Evening Press, they ensured that the world and his wife knew about the gallery raid. I know the world and his wife loves them, but I'm thoroughly sick of dinosaurs. I want the world and his wife to know what happened to my daughter. He has bad knees, and the world and his wife know it. In the Atrium there is a huge glass window overlooking the Arcade where you can sit and watch the world and his wife stagger by. Word got out we were having a party and the world and his wife turned up. Mrs Smith said: ‘That parrot would tell the world and his wife what his name is.’ It seems that the world and his wife now offer this service, which provides the home user a speed rivalling the internet connection you get in the office.a world away fromCompletely different from. her thoughtful manner is a world away from brash Alex Example sentencesExamples Their grandparents were only a 15-minute drive but a world away from the harsh neighborhood where the children lived. Such style and courtesy, and great drinks, are a world away from the arrogance and snobbery of modern day party bars which invariably close after six months. The job was a world away from his work at the time, as a child psychiatrist. The bubbly decor, playful graphics, and bright colours seemed so very modern, and a world away from archetypal greasy spoon cafes. This is the new politics, a world away from old Westminster.the world, the flesh, and the devilAll forms of temptation to si", "n. Rossetti struggled with these words in her desire to overcome the world, the flesh, and the devil Example sentencesExamples Epicurus' dubious reputation reflected the Christian tendency to regard earthly pleasures as the evil lures of the world, the flesh, and the devil. A rich understanding of the roles of God, the world, the flesh, and the devil in suffering will aid counselors in determining the best responses to their clients' pai", "n. The daily, hourly conflict with the world, the flesh, and the devil, shall at length be at an end: the enemy shall be bound; the warfare shall be over; the wicked shall at last cease from troubling; the weary shall at length be at rest. In other words, the world, the flesh, and the devil are formidable obstacles to responding to the light and grace that God gives.a (or the) world ofA very great deal of. there's a world of difference between being alone and being lonely a bit of country air will do her the world of good Example sentencesExamples A rare flower can make a world of difference to the aroma, flavour and colour of honey. Having the right pair to suit your feet and your activity can make the world of difference. A simple nod, a raise of the hand or a flash of headlights can make the world of difference. It takes very little effort to do this and it can make a world of difference to the people around them. I made good use of the pool and it made the world of difference to me and the baby. There is a world of difference between fact and opinion, and sometimes the two can get easily confused. There will always be a world of difference in taste and texture between any farmed fish and its wild relatio", "n. I have been keeping myself to myself a bit recently, and it has actually done me the world of good. I think there's a world of difference between an arranged marriage and a forced marriage. The association can rightly claim to have made a world of difference to many tragic young lives. Synonymshuge amount, vast amount, enormous amount, good deal, great deal, abundance, wealth, profusion, mountain, immensity(all) the world overEverywhere on the earth. laughter is the same language the world over Example sentencesExamples He shows that global trade has improved people's lives the world over. The water situation can be related, not only to Australia in general, but ", "also to the world over. They have made their fortunes, acquired stock options and are sought after the world over. For one, its gorgeous coloring makes it a favorite of snake and reptile collectors the world over. This is a lovely seasonal opportunity to give and it brings great joy to deprived children the world over.worlds apartVery different or distant. our daughter's school is worlds apart from school as I knew it in the 1960s Example sentencesExamples These cousins are brought up worlds apart and have enormous differences, but ", "also enormous similarities. Diplomatically, the two sides still seem worlds ap", "art. The streets are less than three miles away from each other - but in the eyes of house buyers, they are worlds ap", "art. Of course, a toddler and a pre-teen are worlds ap", "art. But the two men are worlds apart on the issue of race. It's ridiculous - we live in the same city but it feels like we're all worlds ap", "art. The exhibition was staged across two very different urban sites, which although linked by a short bus ride are worlds apart in terms of economic and social infrastructure. It ", "also has brought together communities that are worlds apart to enrich each other culturally, socially and economically. Not just their locations make these two books worlds apart, they are different in style and structure too. Although the three opposition leaders are worlds apart on most issues of policy, they do have two very important things in commo", "n. Synonymsunsuited, mismatched, ill-matched, poles apart, worlds apart, like day and nightOriginOld English w(e)oruld, from a Germanic compound meaning 'age of man'; related to Dutch wereld and German Welt.The ancient root of world meant ‘age or life of man’. The first part is the same as were- in werewolf (see wolf)—it means ‘man’—and the second part is related to old. The Anglo-Saxons first used world to mean ‘human existence, life on earth’ as opposed to future life in heaven or hell. America was first called the New World in 1555, and Europe, Asia, and Africa the Old World at the end of that century. Olde worlde is a ‘fake’ antiquated spelling for old-fashioned things intended to be quaint and attractive, and dates only from the 1920s. The developing countries of Asia, Africa, and Latin America were initially known as the Third World in the 1950s by French writers who used tiers monde, ‘third world’, to distinguish the developing countries from the capitalist and Communist blocs. The first use in English came in 1963. The best of all worlds or of all possible worlds is from Candide (1759) by the French writer Voltaire. It is a translation of a statement by the ever-optimistic Pangloss, ‘Everything is for the best in the best of all possible worlds’. The character of Pangloss, who remained constantly cheerful despite all the disasters that happened to him and his travelling companions, is a satire on the views of the German philosopher Leibniz, who believed this philosophy. See ", "also optimism, oyster, whim, wifenou", "n.1 phr.Definition of world in US English: world nounwərldwərld1usually the worldThe earth, together with all of its countries, peoples, and natural features. he was doing his bit to save the world Example sentencesExamples The students come from all over the world, a wonderful combination of people. Soils, such as podzols, which are zonal in some parts of the world might be intrazonal in other areas. The sea connotes what the land is not, yet together they form the world's surfaces. They've sold three million albums, toured all over the world and have been together for almost a decade. Oliver is hoping to climb his way into the history books by planting a flag at the summit of the world's tallest mountai", "n. He admits the prospect of seven days cycling over some of the world's most inhospitable terrain is a bit daunting. It is truly wonderful to have a whole lot of girl-friends living in various parts of the world. The Himalayas is the highest and one of the most beautiful mountain ranges of the world. Today we see a vast new working class brought together in great conurbations across the world. What is astonishing is how little our cartographic concept of the world has changed since the", "n. Annually millions of Canadians travel to other nations all over the world for a whole variety of reasons. Using your bike for errands is a great way to do your little part to save the world. Today, I spent my whole day meeting with the representatives from all over the world. The couple travelled the world together three years ago and fell in love with Asia. Not all of these acts proved to be that useful later on, but it gave you the feeling you did your bit to save the world. I thank them for going and sharing some time in that wonderful part of the world. There are many mountain ranges throughout the world, all of various ages and sizes. However, only they can choose what to do and they have all chosen to try and save the world they live i", "n. Some may argue that we should look after our own before we go off trying to save the world. Before they rush out to say that they want to save the world - how about themselves? Synonymsearth, globe, planet, sphere1.1the world All of the people, societies, and institutions on the earth.as modifier world affairs Example sentencesExamples Am I first a woman and then a member of my society, community, world, or vice versa? Let her go abroad and tell the world how primitive is the structure of our society. To be a man you have to be a businessman who faces the world by himself and who has to fight the whole world by himself. He hung a map of the world on the wall in his little cottage, and he read as widely as he could about world affairs. It's a nice thought that there's someone who loves you, even when you think the whole world hates you. Yet the financial crisis has been so severe that its impact has disturbed the world economy as a whole. Africa cannot jump into a world market economy as quickly as it wants. These children need to know that their stories are important to the world outside. The collapse of the world economy was felt hardest amongst the working classes of the North East. He never felt love and because of that, hated the world and the world hated him in retur", "n. For all their failings, journalists serve the societies they live in and the world at large. I want to prove to myself and to the world that my life is whole agai", "n. There are, of course, major differences between the European Union and the world as a whole. They sometimes wonder why the rest of the world hates them so much. We truly are entering one of the most important times in world history. She stayed there for hours, crying for her brother, and hating the world for taking him away. The fall in European growth rates has implications for the world economy as a whole. On the contrary, the world economy as a whole is marked by slow growth and outright stagnatio", "n. Sovereignty still remains a supremely important institution of world politics. On a more serious note, it would appear that the world as a whole is sinking deeper into poverty. Synonymseveryone, everybody, each and every one, people, mankind, humankind, humanity, people everywhere, the whole world, the world at large, the public, the general public, the population, the populace, all and sundry, every mother's son, every tom, dick, and harry, every man jack1.2as modifier Denoting one of the most important or influential people or things of its class. they had been brought up to regard France as a world power Example sentencesExamples Ireland could be the world leader in online tourism within the next two years. The fun run set the world record for the largest gathering of Santas in one place. Las Vegas, said Ashley, was the perfect setting for the world powerlifting championships. Imagine how exciting it was to watch this British athlete set a world record and beat a world superstar. In the world championship final in Paris she was left standing by a 67-second lap. The squad fly out on Friday, with less than 24 hours to settle in before meeting the world champions. He became the biggest superstar of world rugby, but he is an understated hero. After the day of British champions comes an evening for world superstars. All schools that took part will receive a certificate confirming their success in winning the world record. It is the group's strategy to become one of the world leaders in the textile industry, he said. He's the world knife-throwing champion - and he's about to throw those knives at me. He will take it on the chin and be back at the Crucible where I think he has at least another three or four chances to win back the world title. There are tournaments to play that move you up the world rankings and that's more important now. He had his first race just two days after his sixth birthday at the world championship track near Swindo", "n. I hope I can go as far as reaching the world number one, but I realize it requires hard work. Afterwards, the world number one was distinctly underwhelmed with the outcome. He went to the Olympic Games as the world number one intending only to return with the gold medal, but it was not to be. And the world number one gave one journalist short shrift when asked what was wrong with his game. They are the world champions and a class side, but if they are not quite on their game, that is when you can get at them. My gut feeling is that the world champions will have to fight very hard to maintain their winning streak in Edinburgh.1.3 Another planet like the earth. the possibility of life on other worlds Example sentencesExamples Now, what we don't know is how many of those Earth size worlds actually have liquid water that could cook up life or will have cooked up life. It is quite likely that future interstellar explorers will have a wide range of new worlds to explore. The asteroids are tiny worlds that should have clumped together to form another major planet. But the main purpose of this spacecraft will be to carry astronauts beyond our orbit to other worlds. Astronomers had initially expected that other solar systems would follow the pattern of our own: small rocky worlds close to the star and gas giants further out. Someday solar sails might be used to send astronauts to new worlds around other stars. Intriguingly, this class of worlds includes the Martian moons, from which fully reversible Mars missions could ultimately be staged. The research may eventually be applied to remove radiation belts around the Earth and other worlds, reducing the hazards of the space environment. A new computer model designed to explore the range of possibilities for planet formation around other stars had no trouble coming up with worlds similar to Earth. Astronomers are finding new worlds by the dozen - settling one ancient debate and sparking a multitude of others. At the beginning of the twenty-first century, people are excited by the prospect of visiting new worlds in outer space. Nevertheless, of all the worlds in our solar system, Mars is most like Earth. But telepresence has been used primarily to explore other worlds. For one thing, astronomers discovered the Kuiper belt, a teeming ensemble of miniature worlds within which Pluto orbits. His ideas on cosmology are quite remarkable for he not only argued for a moving Earth, but he ", "also argued for an infinite universe containing other stars like the Sun and other worlds like the Earth. There has been an explosion in the number of astronomers scanning the skies for the telltale wobble of distant worlds. We might instead settle worlds without life, such as Earth's Moon or the asteroids. It showed the planets as worlds - some greater, some less, than our earth - but all much vaster than the earth as she had been regarded in ancient times. By studying alien worlds, such as Venus, Mars or Saturn's moon Titan, we can place our own world in context. For centuries humanity had dreamed of reaching out to the stars, settling on worlds beyond our solar system. Synonymsplanet, satellite, moon, star, heavenly body, orb1.4 The material universe or all that exists; everything. Example sentencesExamples It makes me wonder about the dynamics of life and how we exist in this world. Everything about the world can be explained by him in terms of the shadows. Being a father is not just about contact: the child needs financial security in this material world. Our protagonist is against this obsession with the material world, but he is haunted by it. The living entity is eternal, and he existed before the creation of this material world.2A region or group of countries. the English-speaking world Example sentencesExamples The richest country in the industrialised world will continue to have some of the worst pockets of poverty. By the western part of the Arabic world we mean the regions comprising mainly North Africa and Spai", "n. Have you ever seen an Arab world as divided as it is right now? Croatia is actually located in Central Europe, but it has bridged the Eastern and Western worlds throughout its history. Yet those of us lucky enough to live in the developed world do not need to cope with such problems. But in the developed, Western world, the feasting periods are no longer interspersed with famines. Several countries in the developing world continue to invite him to help train their own surgeons. Secondly, not all of the developed western world might be seen as civilised. It's one of the most outrageous breaches of human rights in the history of the western world. The issue has echoes of the Arab world's historical struggle to assert its own destiny. Rather different number systems were used simultaneously in the Arabic world over a long period of time. The range of swear words in the modern English-speaking world is tiny, as you know. In many parts of the Western world the media still describe this as the only safe route to peace and stability. Eastern religions are popular across the entire Western world at this time, especially Buddhism, and especially in America.2.1 A period of history. the ancient world Example sentencesExamples Though we think of the Seven Wonders of the Ancient World as a single list today, there were actually a number of lists compiled by different Greek writers. As the title suggests, Ferguson believes that the British Empire shaped the modern world. In the ancient and classical worlds, capital tended to be drawn into cities from the surrounding regions, so that they could become wealthier even in the absence of economic growth. They are now, rightly, seen as an essential element in a proper understanding of the medieval world-view, important to anyone with an interest in the art, literature, philosophy and social structure of that time. I sometimes imagine that I see certain parallels between modern Aotearoa and the historical worlds of that other boot-shaped nation, Italy.2.2 A group of living things. the animal world Example sentencesExamples But first, they must learn the rules of both the animal and the human worlds. Lying is one of the most human of traits that really distinguishes us from the rest of the animal world. The mineral, vegetable, and animal worlds do exactly what they're created to do. Insects are some of the least understood creatures in the animal world. There ", "also seems to be little evidence of genuine teaching in the animal world. The tiger's immense power and strength give it an aura unmatched in the animal world. Then she takes that a step further by pretty much banning any human interference in the animal world. He is seated on a tiger skin, a symbol of power, showing his mastery over the animal world. Our folklore and arts and crafts reflect our love and reverence for the animal world. Either way, the switch of identities between the human, sacred and animal worlds is a feature of Mongolian belief as it is in countless other folk religions. For the next three decades Eva will be the communicator-the connection between the animal and human worlds. The presenter uses amusing approaches to introduce children to the animal world. There is a close relationship in Scripture between the animal world and the demonic. She is equally trapped between animal and human worlds. On examination, it reveals a coded significance, uniting the worlds of animals, birds, humans and demigods, proposing itself as an image of the universe. There is no boundary between the vegetable, animal and human worlds. She borrows it from the animal world and evokes or invokes it on the subject of procreatio", "n. Many of these directly incorporate works of art - the art of the wheelchair bound Horibe, whose paintings meld the plant and animal worlds. This phenomenon is widespread, occurring in nearly all the major taxa of the plant, animal, and microbial worlds. He expected to find similarities in structure within each branch of the animal world.2.3 The people, places, and activities to do with a particular thing. they were a legend in the world of British theater Example sentencesExamples He is easily transported back to his playing days and into a football world vastly different from today's. They're all hot, contemporary artists who are taking the art world by storm. In his biography, he comes across as a person comfortably astride various worlds: theatre, painting, books and film. The new company will represent talent from the worlds of theatre, film, television and literature in Scotland. He still characterises himself as having a foot in both the stand-up and theatre worlds and is currently working with Murphy on putative comic projects. It's only a matter of time before he is forced to leave his boyhood club and has the football world at his feet. Beaufort inhabited the scientific world dominated by the chronometer invented by John Harriso", "n. The award-winning film composer has struck a chord in the worlds of film, theatre, classical and pop. He said the bid could eventually include people from ‘the worlds of football and motorsport’, but said he was unable to give details. The theatre world found this extremely amusing, although the actor reputedly did not. Yet in the unsentimental world of modern football, it could just happe", "n. The paintings of a Mancunian former teacher have taken the art world by storm after years of obscurity. The insular world of the theatre is more commonly a sanctuary from reality. A new form of art had come about quite naturally, yet its presence took the art world by storm. He decided the theatre world was a good place to trawl not only for people with money but ", "also for girls. So he pursued his dream, by entering the theatre world and then going on to the big scree", "n. Ken, whose background is in media and publishing in the commercial and academic worlds, now employs three full-time staff and a number of part-time staff. Someone from outside will have a different experience of the football world. It happens in the football world but it's one of those things you keep quiet about. The world of football is small, and once you deal with a manager, club or a player, relations develop. Synonymssphere, society, circle, arena, milieu, province, domain, territory, orbit, preserve, realm, field, discipline, area, department, sector, section, group, division2.4one's world A person's life and activities. he felt his whole world had collapsed Example sentencesExamples It came as such a shock, and our worlds literally fell i", "n. My whole world has fallen apart and left me feeling hopeless and depressed. She drove slowly because the sudden collapse of her whole world was affecting the steadiness of her hands. This is my small world and the reality of living with chronic illness. She's the center of his whole world.3Human and social interactio", "n. he has almost completely withdrawn from the world how inexperienced she is in the ways of the world Example sentencesExamples Children use toys to imagine the world and to interact with it, learning skills that will be of value in later life. These are serious blows to our sense of who we are, what we expect of the world and of our interactions with others. I become irrational, cannot think straight and interact with the world in an entirely strange way. We teach our students that they are obliged to study the broader social world. He is constantly frustrated by his inability to change the way the world works more quickly and radically. It is a fundamental dispute about the way the world works and what our role in it should be. That is the way the world works and why should any one make an exception in my case? For without a contrast model the world has no way to know or feel the oddness of its dependence on power for survival. I sit here and all my interaction with the world goes fuzzy as if I am falling asleep. Every artist looks at the world in a definite social manner, whether he or she knows it or not. I may have been naïve, but even I knew a little about the way the world worked. He wants us to see his work in precisely the same way we observe the world as we move through it. That seemed to be the way the world worked, people leaving you the minute you didn't have a thing left to offer them. It gets you interacting with the world in all sorts of different ways. Autism cuts off its sufferers from the world by impairing social skills and imaginative development. Synonymssociety, high society3.1 Secular interests and affairs. parents are not viewed as the primary educators of their own children, either in the world or in the Church Example sentencesExamples People who see the world in terms of evil and sin will tend to devalue the material world. The concept of Hell as a literal place has declined in an increasingly secular world. There is a primary difference between the material world and the spiritual dimensio", "n. The militantly secular world is ", "also keenly alert to the challenge of the Passio", "n. It seems to be a connector or a medium between the materialistic world and the spiritual world.3.2in singular A stage of human life, either mortal or after death. in this world and the next Example sentencesExamples Then the oxygen machine arrived, the pain medications increased, and my mother slipped out of this world and into the next. The two ideas could be linked: after all, cremation is itself a wall of fire that is a boundary between this world and the next. This is an inspiring talk that will help us to establish our own priorities for this world and the next. I know who I am, and I know that I can only be myself, because that is the only thing I will carry out of this world, my soul.Phrasesbe not long for this worldHave only a short time to live. Example sentencesExamples A child, not long for this world should have a heavenly name. One can only assume that the 95-year old is not long for this world. In act, Dan was still laying drains well after doctors told him he was not long for this world. I'm going to need a new chair for the coming season - my old one, made of metal tubing, has developed an alarming creak over the winter and is not long for this world, I fear. There are a few who know the reasons behind the murders, but they too are not long for this world. In general, my tastes in television are a reliable guide to what's about to get cancelled - if I like it, it is not long for this world. Sure enough, I tracked him down only to find out that he's extremely ill and possibly not long for this world. One way or another, whether we like it or not we are all not long for this world. As I watched and listened to Marie, I was overwhelmed by the love she showed this sick, frail man - not long for this world, with nothing to give her in retur", "n. Sadly however, like our four other sisters, Caroline, Sophie, Amelie and Victory, he was not long for this world.the best of both (or all possible) worldsThe benefits of widely differing situations, enjoyed at the same time. Example sentencesExamples The council wanted the best of both worlds - trees to enhance the area, but no liability for them once it had officially protected them. This type of work/life situation can be the best of both worlds - challenging work and plenty of support at home. And there is absolutely nothing wrong with wanting the best of both worlds where culture is concerned. I don't see it as being hypocritical, but rather as having the best of both worlds. Enjoy the best of both worlds with our insider advice about three fun destinations Many of us in this prosperous country are fortunate to be able to have the best of both worlds. Education officers claim the scheme offers the best of both worlds and has the most flexibility to meet children's needs. Situated not far from the beach you can enjoy the best of both worlds in this relaxed but upmarket centre. Instead, they frequently enjoy the best of both worlds. Splits were thought to offer investors the best of both worlds and ideal for people saving for school fees or for retirement.bring someone into the worldGive birth to or assist at the birth of someone. Example sentencesExamples Even at an early age I wondered why children are routinely named after their fathers, especially when the job of bringing them into the world is solely the responsibility of the mother. She managed to be both gentle and authoritative and I trusted her to bring you into the world. She was rushed into hospital, where doctors tried to stop the labour to no avail and baby Adam was brought into the world over three months premature. Cathy's labor didn't last long, and in only an hour and a half, baby Daisy was brought into the world. My poor mother had died bringing me into the world. Anyway, never forget what she went through to bring you into the world. Surgeons brought him into the world using forceps after two earlier attempts to deliver him by ventouse extraction had failed. Young Oliver Twist is left in the care of a workhouse near London when his mother dies bringing him into the world. Abigail, a child of great beauty and undiscovered talent, has a safe and loving home with the midwife who brought her into the world. Mother's Day should be the most important festival of the year, because it honours the person who brought us into the world.come into the worldBe bor", "n. Example sentencesExamples The chimes of Big Ben had barely struck when little Sam came into the world at just one minute past midnight on New Year's Day. My most heart-melting moments were when each of them came into the world. Her twins came into the world at 25 weeks and five days - Tom weighing 749g and Bonnie 620g. The baby will come into the world, perhaps kicking and screaming, but babyhood will only be the beginning of a continuing process of growth and change. After they come into the world, they are cleaned right in the room and then put on a special bed. Maybe Saskia just wasn't ready to come into the world. Screaming lustily, apparently as healthy as his sister despite the awkward way he came into the world, the second child was bor", "n. Forty minutes after Mia had come into the world, her identical twin sister Mona was bor", "n. The boy would come into the world without a father. No one wants to see their child undergo an operation and Louise has already had a tough time coming into the world.come up (or go down) in the worldRise (or drop) in status, especially by becoming richer (or poorer). Example sentencesExamples This neighborhood is going through a transition, and it is coming up in the world, and that fire station will only add to the quality of life for the community. He's come up in the world considerably since the", "n. He has had to sell his flat in Mayfair because of his bankruptcy, ‘but he has a new flat in Mayfair for his wife and daughter so he's hardly gone down in the world.’ Everybody knows that perfectly good teaching institutions can come to neglect the undergraduates and grind up the idealism of young academics because the faculty, or deans, or provosts want to come up in the world. Some personal names have undoubtedly gone down in the world. Lincoln is a city that's come up in the world since last I gave it close inspection, in my RAF days forty years ago. ‘You've come up in the world Ms. Johnson,’ he said, not hiding his antagonism. I thought for sure we'd seen the last of you all those years ago… My, you've come up in the world! Now it is coming up in the world and is a charming bohemian quarter. His mother said the Pilgrims were coming up in the world.in the worldUsed for emphasis in questions, especially to express astonishment or disbelief. why in the world did you not reveal yourself sooner? Example sentencesExamples Why in the world is this happening to me? What in the world was going on in her mind?look for all the world likeLook precisely like (used for emphasis) fossil imprints that look for all the world like motorcycle tracks Example sentencesExamples When Nadege and I passed, pushing Leyla in a stroller, looking for all the world like a very mismatched mixed-race couple with child, he smiled instinctively at the pretty baby. He looked for all the world like a little boy who had just brought a slimy frog to his Mother and couldn't understand why she wasn't excited too. England and Germany looked for all the world like two teams competing to avoid the title of worst team in their sectio", "n. He looked for all the world like an art critic absent-mindedly contemplating a particularly engrossing landscape. She looks for all the world like a little girl who's come to ask my son to play. It arrived quite literally in a blaze of glory, wrapped in tinfoil with flames spurting out of the top, looking for all the world like my mum's finest Christmas pudding. We crouched beside the tree, looking for all the world like a Christmas card photo. ‘Hey, I'm in the finals,’ he beamed, looking for all the world like a kid in a sweet shop. It looked for all the world like a very healthy clump of stinging nettles until it produced a fine display of large, pink flowers. This year, we had a few more minutes to chat before the panel as he sat there in his wheelchair, looking for all the world like someone who couldn't recall his name, let alone past events.man (or woman) of the worldA person who is experienced in the ways of sophisticated society. Example sentencesExamples Now, excuse me, I'm a man of the world, and I, for one, find this a rather worrying development. They went out as wide-eyed and gangly young teens, and came back seasoned men of the world, who had developed exotic tastes for horse meat, brandy, and long elegant cigarettes. She seemed to personify what we were trying to achieve with the programme: a woman of the world who takes her destiny into her own hands. It quickly became clear that Lyon is a man of the world. Born in Singapore, growing up in East London and now based in Los Angeles, Clarisse is a woman of the world. Leonardo and Michelangelo, rivals in everything, were both men of the world and men of business. What a great example Kelly is to impressionable young women of the world. Collis told Dick how Rosemary has become a woman of the world, much different from the young girl they had know", "n. As a woman of the world, Hillary, do you think I should do it? On the contrary, he was a man of the world, an experienced soldier, widely travelled, with close contacts with many of the leading men of affairs, both in his own city and elsewhere.not do something for the worldNot do something whatever the inducement. I wouldn't miss it for the world Example sentencesExamples \"I wouldn't do it for the world,\" Aurora declared. This will be the fight of our lives, but I wouldn't miss it for the world. Restructure or decline… A fossil fuel-based, automobile centered and throwaway economic model will not work for the world.out of this worldinformal Extremely enjoyable or impressive. an herb and lemon dressing that's out of this world Example sentencesExamples The drive was a little over an hour and the scenery was just out of this world. The clothes were out of this world and beautifully displayed. The foie gras terrine was unbelievably rich, and they had a white asparagus salad which was out of this world. The job is exhausting but the rewards are out of this world. Johnson's guitar solo is out of this world - it actually sounds like lead and rhythm playing together, and a brass sectio", "n. Along with that peace comes a joy and happiness that's out of this world! The whole proceedings were out of this world and almost impossible to describe. The regular baguettes have a great crust, a medium crumb and lots of taste, and the sourdough baguettes are out of this world for serving with cheese. It is really out of this world with a fabulous infrastructure, it's very safe and clea", "n. The quality of the play was incredible, there were several chances at both ends, there was immense tension and the atmosphere was out of this world. Synonymsmarvellous, magnificent, superb, glorious, sublime, lovely, delightful, first-class, first-ratewonderful, marvellous, magnificent, superb, glorious, sublime, lovely, delightful, first-class, first-ratesee the worldTravel widely and gain wide experience. Example sentencesExamples And it was after this walking tour that he decided he wanted to travel some more and see the world. Katrine and Michel were both teachers who loved to travel and this was how they saw the world. The nanny was a woman in her fifties who decided to go travel and see the world with the rest of her life. We were young, excited about travel and seeing the world. Now his mind was firmly made up, it was travel for him, he was going to see the world. These affluent coastal urbanites enjoy seeing the world and are more likely to travel abroad than the average America", "n. Michael had travelling in the blood and wanted to see the world.think the world ofHave a very high regard for (someone) I thought the world of my father Example sentencesExamples ‘He must have thought the world of his sister,’ says the woman, ‘to do all these commemorative things for her.’ He thought the world of his sisters and brother. Her family were her pride and joy and she was devoted to them and they in turn thought the world of her. Steven was a shy, quiet lad but when he came out of his shell and people got to know him, they thought the world of him. I think the world of my mum, as she is so kind, caring and loving to all of us. He thought the world of us and would have hated for us to be unhappy. After my father died, when I was 23, I discovered through others that he thought the world of me. The boy thinks the world of Emilio, appreciating the kind and attentive way he treats him and his mom. She thought the world of all the children she taught over the years. And you ", "also have three loving children who think the world of you so please don't get upset- or angry- over the confrontation this afternoo", "n. Synonymsadore, hold dear, love, care very much for, feel great affection for, dote on, be devoted to, revere, esteem, admire, appreciatethe world, the flesh, and the devilAll forms of temptation to si", "n. Example sentencesExamples In other words, the world, the flesh, and the devil are formidable obstacles to responding to the light and grace that God gives. The daily, hourly conflict with the world, the flesh, and the devil, shall at length be at an end: the enemy shall be bound; the warfare shall be over; the wicked shall at last cease from troubling; the weary shall at length be at rest. A rich understanding of the roles of God, the world, the flesh, and the devil in suffering will aid counselors in determining the best responses to their clients' pai", "n. Epicurus' dubious reputation reflected the Christian tendency to regard earthly pleasures as the evil lures of the world, the flesh, and the devil.a (or the) world ofA very great deal of. there's a world of difference between being alone and being lonely Example sentencesExamples Having the right pair to suit your feet and your activity can make the world of difference. A simple nod, a raise of the hand or a flash of headlights can make the world of difference. There is a world of difference between fact and opinion, and sometimes the two can get easily confused. I think there's a world of difference between an arranged marriage and a forced marriage. There will always be a world of difference in taste and texture between any farmed fish and its wild relatio", "n. I have been keeping myself to myself a bit recently, and it has actually done me the world of good. It takes very little effort to do this and it can make a world of difference to the people around them. I made good use of the pool and it made the world of difference to me and the baby. A rare flower can make a world of difference to the aroma, flavour and colour of honey. The association can rightly claim to have made a world of difference to many tragic young lives. Synonymshuge amount, vast amount, enormous amount, good deal, great deal, abundance, wealth, profusion, mountain, immensity(all) the world overEverywhere on the earth. Example sentencesExamples They have made their fortunes, acquired stock options and are sought after the world over. For one, its gorgeous coloring makes it a favorite of snake and reptile collectors the world over. He shows that global trade has improved people's lives the world over. The water situation can be related, not only to Australia in general, but ", "also to the world over. This is a lovely seasonal opportunity to give and it brings great joy to deprived children the world over.worlds apartVery different or distant. Example sentencesExamples Diplomatically, the two sides still seem worlds ap", "art. These cousins are brought up worlds apart and have enormous differences, but ", "also enormous similarities. It's ridiculous - we live in the same city but it feels like we're all worlds ap", "art. Not just their locations make these two books worlds apart, they are different in style and structure too. It ", "also has brought together communities that are worlds apart to enrich each other culturally, socially and economically. Of course, a toddler and a pre-teen are worlds ap", "art. Although the three opposition leaders are worlds apart on most issues of policy, they do have two very important things in commo", "n. The exhibition was staged across two very different urban sites, which although linked by a short bus ride are worlds apart in terms of economic and social infrastructure. The streets are less than three miles away from each other - but in the eyes of house buyers, they are worlds ap", "art. But the two men are worlds apart on the issue of race. Synonymsunsuited, mismatched, ill-matched, poles apart, worlds apart, like day and nightOriginOld English w(e)oruld, from a Germanic compound meaning ‘age of man’; related to Dutch wereld and German Welt.nou", "n.1 phr."]}, {"dict": "Oxford5000", "values": ["think the world ofSee worldDefinition of world in English: world noun wəːldwərld1usually the worldThe earth, together with all of its countries and peoples. he was doing his bit to save the world it's a wonderful world Example sentencesExamples The students come from all over the world, a wonderful combination of people. Annually millions of Canadians travel to other nations all over the world for a whole variety of reasons. They've sold three million albums, toured all over the world and have been together for almost a decade. Oliver is hoping to climb his way into the history books by planting a flag at the summit of the world's tallest mountai", "n. I thank them for going and sharing some time in that wonderful part of the world. However, only they can choose what to do and they have all chosen to try and save the world they live i", "n. The sea connotes what the land is not, yet together they form the world's surfaces. Not all of these acts proved to be that useful later on, but it gave you the feeling you did your bit to save the world. There are many mountain ranges throughout the world, all of various ages and sizes. Soils, such as podzols, which are zonal in some parts of the world might be intrazonal in other areas. He admits the prospect of seven days cycling over some of the world's most inhospitable terrain is a bit daunting. The couple travelled the world together three years ago and fell in love with Asia. It is truly wonderful to have a whole lot of girl-friends living in various parts of the world. What is astonishing is how little our cartographic concept of the world has changed since the", "n. The Himalayas is the highest and one of the most beautiful mountain ranges of the world. Some may argue that we should look after our own before we go off trying to save the world. Today we see a vast new working class brought together in great conurbations across the world. Using your bike for errands is a great way to do your little part to save the world. Before they rush out to say that they want to save the world - how about themselves? Today, I spent my whole day meeting with the representatives from all over the world. Synonymsearth, globe, planet, sphere1.1the world All of the people and societies on the earth. the whole world hates a Monday Example sentencesExamples Sovereignty still remains a supremely important institution of world politics. They sometimes wonder why the rest of the world hates them so much. Let her go abroad and tell the world how primitive is the structure of our society. He never felt love and because of that, hated the world and the world hated him in retur", "n. The fall in European growth rates has implications for the world economy as a whole. We truly are entering one of the most important times in world history. I want to prove to myself and to the world that my life is whole agai", "n. These children need to know that their stories are important to the world outside. On a more serious note, it would appear that the world as a whole is sinking deeper into poverty. Yet the financial crisis has been so severe that its impact has disturbed the world economy as a whole. The collapse of the world economy was felt hardest amongst the working classes of the North East. To be a man you have to be a businessman who faces the world by himself and who has to fight the whole world by himself. For all their failings, journalists serve the societies they live in and the world at large. Africa cannot jump into a world market economy as quickly as it wants. There are, of course, major differences between the European Union and the world as a whole. He hung a map of the world on the wall in his little cottage, and he read as widely as he could about world affairs. Am I first a woman and then a member of my society, community, world, or vice versa? She stayed there for hours, crying for her brother, and hating the world for taking him away. It's a nice thought that there's someone who loves you, even when you think the whole world hates you. On the contrary, the world economy as a whole is marked by slow growth and outright stagnatio", "n. Synonymseveryone, everybody, each and every one, people, mankind, humankind, humanity, people everywhere, the whole world, the world at large, the public, the general public, the population, the populace, all and sundry, every mother's son, {every Tom, Dick, and Harry}, every man jack1.2as modifier Denoting one of the most important people or things of their class. a world superstar Example sentencesExamples Las Vegas, said Ashley, was the perfect setting for the world powerlifting championships. Afterwards, the world number one was distinctly underwhelmed with the outcome. He's the world knife-throwing champion - and he's about to throw those knives at me. In the world championship final in Paris she was left standing by a 67-second lap. Imagine how exciting it was to watch this British athlete set a world record and beat a world superstar. He will take it on the chin and be back at the Crucible where I think he has at least another three or four chances to win back the world title. The squad fly out on Friday, with less than 24 hours to settle in before meeting the world champions. After the day of British champions comes an evening for world superstars. The fun run set the world record for the largest gathering of Santas in one place. It is the group's strategy to become one of the world leaders in the textile industry, he said. He went to the Olympic Games as the world number one intending only to return with the gold medal, but it was not to be. He became the biggest superstar of world rugby, but he is an understated hero. My gut feeling is that the world champions will have to fight very hard to maintain their winning streak in Edinburgh. I hope I can go as far as reaching the world number one, but I realize it requires hard work. Ireland could be the world leader in online tourism within the next two years. There are tournaments to play that move you up the world rankings and that's more important now. They are the world champions and a class side, but if they are not quite on their game, that is when you can get at them. He had his first race just two days after his sixth birthday at the world championship track near Swindo", "n. And the world number one gave one journalist short shrift when asked what was wrong with his game. All schools that took part will receive a certificate confirming their success in winning the world record.1.3 Another planet like the earth. the possibility of life on other worlds Example sentencesExamples Someday solar sails might be used to send astronauts to new worlds around other stars. His ideas on cosmology are quite remarkable for he not only argued for a moving Earth, but he ", "also argued for an infinite universe containing other stars like the Sun and other worlds like the Earth. The asteroids are tiny worlds that should have clumped together to form another major planet. Astronomers are finding new worlds by the dozen - settling one ancient debate and sparking a multitude of others. A new computer model designed to explore the range of possibilities for planet formation around other stars had no trouble coming up with worlds similar to Earth. For one thing, astronomers discovered the Kuiper belt, a teeming ensemble of miniature worlds within which Pluto orbits. It is quite likely that future interstellar explorers will have a wide range of new worlds to explore. At the beginning of the twenty-first century, people are excited by the prospect of visiting new worlds in outer space. It showed the planets as worlds - some greater, some less, than our earth - but all much vaster than the earth as she had been regarded in ancient times. The research may eventually be applied to remove radiation belts around the Earth and other worlds, reducing the hazards of the space environment. For centuries humanity had dreamed of reaching out to the stars, settling on worlds beyond our solar system. Nevertheless, of all the worlds in our solar system, Mars is most like Earth. Intriguingly, this class of worlds includes the Martian moons, from which fully reversible Mars missions could ultimately be staged. But telepresence has been used primarily to explore other worlds. We might instead settle worlds without life, such as Earth's Moon or the asteroids. Now, what we don't know is how many of those Earth size worlds actually have liquid water that could cook up life or will have cooked up life. By studying alien worlds, such as Venus, Mars or Saturn's moon Titan, we can place our own world in context. But the main purpose of this spacecraft will be to carry astronauts beyond our orbit to other worlds. There has been an explosion in the number of astronomers scanning the skies for the telltale wobble of distant worlds. Astronomers had initially expected that other solar systems would follow the pattern of our own: small rocky worlds close to the star and gas giants further out. Synonymsplanet, satellite, moon, star, heavenly body, orb2A particular region or group of countries. the English-speaking world Example sentencesExamples By the western part of the Arabic world we mean the regions comprising mainly North Africa and Spai", "n. Secondly, not all of the developed western world might be seen as civilised. Rather different number systems were used simultaneously in the Arabic world over a long period of time. Yet those of us lucky enough to live in the developed world do not need to cope with such problems. The issue has echoes of the Arab world's historical struggle to assert its own destiny. Croatia is actually located in Central Europe, but it has bridged the Eastern and Western worlds throughout its history. It's one of the most outrageous breaches of human rights in the history of the western world. In many parts of the Western world the media still describe this as the only safe route to peace and stability. Eastern religions are popular across the entire Western world at this time, especially Buddhism, and especially in America. The richest country in the industrialised world will continue to have some of the worst pockets of poverty. Several countries in the developing world continue to invite him to help train their own surgeons. The range of swear words in the modern English-speaking world is tiny, as you know. But in the developed, Western world, the feasting periods are no longer interspersed with famines. Have you ever seen an Arab world as divided as it is right now?2.1 A particular period of history. the ancient world Example sentencesExamples I sometimes imagine that I see certain parallels between modern Aotearoa and the historical worlds of that other boot-shaped nation, Italy. They are now, rightly, seen as an essential element in a proper understanding of the medieval world-view, important to anyone with an interest in the art, literature, philosophy and social structure of that time. In the ancient and classical worlds, capital tended to be drawn into cities from the surrounding regions, so that they could become wealthier even in the absence of economic growth. As the title suggests, Ferguson believes that the British Empire shaped the modern world. Though we think of the Seven Wonders of the Ancient World as a single list today, there were actually a number of lists compiled by different Greek writers.2.2 A particular group of living things. the animal world Example sentencesExamples There is no boundary between the vegetable, animal and human worlds. There is a close relationship in Scripture between the animal world and the demonic. The tiger's immense power and strength give it an aura unmatched in the animal world. But first, they must learn the rules of both the animal and the human worlds. Then she takes that a step further by pretty much banning any human interference in the animal world. Our folklore and arts and crafts reflect our love and reverence for the animal world. On examination, it reveals a coded significance, uniting the worlds of animals, birds, humans and demigods, proposing itself as an image of the universe. Insects are some of the least understood creatures in the animal world. This phenomenon is widespread, occurring in nearly all the major taxa of the plant, animal, and microbial worlds. For the next three decades Eva will be the communicator-the connection between the animal and human worlds. Lying is one of the most human of traits that really distinguishes us from the rest of the animal world. He expected to find similarities in structure within each branch of the animal world. She is equally trapped between animal and human worlds. He is seated on a tiger skin, a symbol of power, showing his mastery over the animal world. Either way, the switch of identities between the human, sacred and animal worlds is a feature of Mongolian belief as it is in countless other folk religions. The presenter uses amusing approaches to introduce children to the animal world. There ", "also seems to be little evidence of genuine teaching in the animal world. Many of these directly incorporate works of art - the art of the wheelchair bound Horibe, whose paintings meld the plant and animal worlds. She borrows it from the animal world and evokes or invokes it on the subject of procreatio", "n. The mineral, vegetable, and animal worlds do exactly what they're created to do.2.3 All that relates to a particular sphere of activity. they were a legend in the world of British theatre the news shocked the football world Example sentencesExamples He still characterises himself as having a foot in both the stand-up and theatre worlds and is currently working with Murphy on putative comic projects. They're all hot, contemporary artists who are taking the art world by storm. In his biography, he comes across as a person comfortably astride various worlds: theatre, painting, books and film. The paintings of a Mancunian former teacher have taken the art world by storm after years of obscurity. Beaufort inhabited the scientific world dominated by the chronometer invented by John Harriso", "n. It's only a matter of time before he is forced to leave his boyhood club and has the football world at his feet. It happens in the football world but it's one of those things you keep quiet about. He is easily transported back to his playing days and into a football world vastly different from today's. So he pursued his dream, by entering the theatre world and then going on to the big scree", "n. Ken, whose background is in media and publishing in the commercial and academic worlds, now employs three full-time staff and a number of part-time staff. Yet in the unsentimental world of modern football, it could just happe", "n. The award-winning film composer has struck a chord in the worlds of film, theatre, classical and pop. The world of football is small, and once you deal with a manager, club or a player, relations develop. He decided the theatre world was a good place to trawl not only for people with money but ", "also for girls. The insular world of the theatre is more commonly a sanctuary from reality. The theatre world found this extremely amusing, although the actor reputedly did not. Someone from outside will have a different experience of the football world. A new form of art had come about quite naturally, yet its presence took the art world by storm. He said the bid could eventually include people from ‘the worlds of football and motorsport’, but said he was unable to give details. The new company will represent talent from the worlds of theatre, film, television and literature in Scotland. Synonymssphere, society, circle, arena, milieu, province, domain, territory, orbit, preserve, realm, field, discipline, area, department, sector, section, group, division2.4one's world One's life and activities. he felt his whole world had collapsed Example sentencesExamples It came as such a shock, and our worlds literally fell i", "n. My whole world has fallen apart and left me feeling hopeless and depressed. She's the center of his whole world. She drove slowly because the sudden collapse of her whole world was affecting the steadiness of her hands. This is my small world and the reality of living with chronic illness.3the worldHuman and social interactio", "n. he has almost completely withdrawn from the world Example sentencesExamples For without a contrast model the world has no way to know or feel the oddness of its dependence on power for survival. Children use toys to imagine the world and to interact with it, learning skills that will be of value in later life. That is the way the world works and why should any one make an exception in my case? I may have been naïve, but even I knew a little about the way the world worked. It gets you interacting with the world in all sorts of different ways. Every artist looks at the world in a definite social manner, whether he or she knows it or not. He wants us to see his work in precisely the same way we observe the world as we move through it. It is a fundamental dispute about the way the world works and what our role in it should be. That seemed to be the way the world worked, people leaving you the minute you didn't have a thing left to offer them. I become irrational, cannot think straight and interact with the world in an entirely strange way. Autism cuts off its sufferers from the world by impairing social skills and imaginative development. These are serious blows to our sense of who we are, what we expect of the world and of our interactions with others. I sit here and all my interaction with the world goes fuzzy as if I am falling asleep. He is constantly frustrated by his inability to change the way the world works more quickly and radically. We teach our students that they are obliged to study the broader social world. Synonymssociety, high societysecular interests, temporal concerns, earthly concernshuman existence3.1 Secular or material matters as opposed to spiritual ones. parents are not viewed as the primary educators of their own children, either in the world or in the Church Example sentencesExamples The concept of Hell as a literal place has declined in an increasingly secular world. The militantly secular world is ", "also keenly alert to the challenge of the Passio", "n. There is a primary difference between the material world and the spiritual dimensio", "n. It seems to be a connector or a medium between the materialistic world and the spiritual world. People who see the world in terms of evil and sin will tend to devalue the material world.3.2 A stage of human life, either mortal or after death. in this world and the next Example sentencesExamples This is an inspiring talk that will help us to establish our own priorities for this world and the next. Then the oxygen machine arrived, the pain medications increased, and my mother slipped out of this world and into the next. I know who I am, and I know that I can only be myself, because that is the only thing I will carry out of this world, my soul. The two ideas could be linked: after all, cremation is itself a wall of fire that is a boundary between this world and the next.Phrasesbe not long for this worldHave only a short time to live. these people either radiate incredible vitality or else complain that they're not long for this world Example sentencesExamples A child, not long for this world should have a heavenly name. One can only assume that the 95-year old is not long for this world. One way or another, whether we like it or not we are all not long for this world. I'm going to need a new chair for the coming season - my old one, made of metal tubing, has developed an alarming creak over the winter and is not long for this world, I fear. Sadly however, like our four other sisters, Caroline, Sophie, Amelie and Victory, he was not long for this world. In act, Dan was still laying drains well after doctors told him he was not long for this world. Sure enough, I tracked him down only to find out that he's extremely ill and possibly not long for this world. In general, my tastes in television are a reliable guide to what's about to get cancelled - if I like it, it is not long for this world. As I watched and listened to Marie, I was overwhelmed by the love she showed this sick, frail man - not long for this world, with nothing to give her in retur", "n. There are a few who know the reasons behind the murders, but they too are not long for this world.the best of both (or all possible) worldsThe benefits of widely differing situations, enjoyed at the same time. I had the best of both worlds, since I worked as an ordinary member of the crew but fed with the officers Example sentencesExamples Splits were thought to offer investors the best of both worlds and ideal for people saving for school fees or for retirement. Many of us in this prosperous country are fortunate to be able to have the best of both worlds. Enjoy the best of both worlds with our insider advice about three fun destinations The council wanted the best of both worlds - trees to enhance the area, but no liability for them once it had officially protected them. Situated not far from the beach you can enjoy the best of both worlds in this relaxed but upmarket centre. This type of work/life situation can be the best of both worlds - challenging work and plenty of support at home. Instead, they frequently enjoy the best of both worlds. Education officers claim the scheme offers the best of both worlds and has the most flexibility to meet children's needs. And there is absolutely nothing wrong with wanting the best of both worlds where culture is concerned. I don't see it as being hypocritical, but rather as having the best of both worlds.bring someone into the worldGive birth to or assist at the birth of someone. Example sentencesExamples My poor mother had died bringing me into the world. Mother's Day should be the most important festival of the year, because it honours the person who brought us into the world. Anyway, never forget what she went through to bring you into the world. Even at an early age I wondered why children are routinely named after their fathers, especially when the job of bringing them into the world is solely the responsibility of the mother. Young Oliver Twist is left in the care of a workhouse near London when his mother dies bringing him into the world. Surgeons brought him into the world using forceps after two earlier attempts to deliver him by ventouse extraction had failed. She was rushed into hospital, where doctors tried to stop the labour to no avail and baby Adam was brought into the world over three months premature. Abigail, a child of great beauty and undiscovered talent, has a safe and loving home with the midwife who brought her into the world. Cathy's labor didn't last long, and in only an hour and a half, baby Daisy was brought into the world. She managed to be both gentle and authoritative and I trusted her to bring you into the world.come into the worldBe bor", "n. Example sentencesExamples My most heart-melting moments were when each of them came into the world. The baby will come into the world, perhaps kicking and screaming, but babyhood will only be the beginning of a continuing process of growth and change. The chimes of Big Ben had barely struck when little Sam came into the world at just one minute past midnight on New Year's Day. After they come into the world, they are cleaned right in the room and then put on a special bed. The boy would come into the world without a father. Maybe Saskia just wasn't ready to come into the world. Forty minutes after Mia had come into the world, her identical twin sister Mona was bor", "n. Screaming lustily, apparently as healthy as his sister despite the awkward way he came into the world, the second child was bor", "n. Her twins came into the world at 25 weeks and five days - Tom weighing 749g and Bonnie 620g. No one wants to see their child undergo an operation and Louise has already had a tough time coming into the world.come up (or go down) in the worldRise (or drop) in status or wealth. he's come up in the world since he went to work for them a street that had once been well heeled but had gone down in the world Example sentencesExamples This neighborhood is going through a transition, and it is coming up in the world, and that fire station will only add to the quality of life for the community. ‘You've come up in the world Ms. Johnson,’ he said, not hiding his antagonism. I thought for sure we'd seen the last of you all those years ago… My, you've come up in the world! He has had to sell his flat in Mayfair because of his bankruptcy, ‘but he has a new flat in Mayfair for his wife and daughter so he's hardly gone down in the world.’ Everybody knows that perfectly good teaching institutions can come to neglect the undergraduates and grind up the idealism of young academics because the faculty, or deans, or provosts want to come up in the world. Lincoln is a city that's come up in the world since last I gave it close inspection, in my RAF days forty years ago. He's come up in the world considerably since the", "n. His mother said the Pilgrims were coming up in the world. Some personal names have undoubtedly gone down in the world. Now it is coming up in the world and is a charming bohemian quarter.in an ideal (or a perfect) worldUsed to express that something is highly desirable but not likely to become a reality. in an ideal world, everyone would pay off their monthly credit card bills on time Example sentencesExamples In a perfect world, I would like my kids to know the support and love of their mother, me, and my partner. In an ideal world, all dance teachers would advocate healthy work habits. In an ideal world, most new parents would rather stay at home, for the baby's first year at least, but financial considerations force them back to work. In an ideal world, we would not need any additional aids to facilitate the training of our horses other than good tack and a good surface. In a perfect world, all you would have to do is create a document, decide which printer you want to use, and print.in a world of one's ownConcerned with one's own thoughts and not aware of what is happening around one. he is in a world of his own and is frequently carried away by his own flights of fancy Example sentencesExamples He was living in a world of his ow", "n. There is no empathy with the public, for they live in a world of their ow", "n. They were spellbound in a world of their ow", "n. Sir Arthur Conan Doyle was trapped in a world of his own making. Today, my father lives in a world of his ow", "n. He seemed to be in a world of his ow", "n. We were in a world of our ow", "n. The referee appeared to be in a world of his ow", "n. Many visitors felt that he lived in a world of his ow", "n. Like all fantasists, Terence Cooper lived in a world of his ow", "n. Synonymsabsent-minded, preoccupied, absorbed, engrossed, far away, somewhere else, not there, not with us, abstracted, with one's head in the clouds, daydreaming, dreamy, inattentive, distracted, thoughtful, pensive, lost in thought, deep in thought, immersed in thought, wool-gathering, in a brown study, musing, brooding, absent, distrait, heedless, obliviousin the worldUsed to express astonishment or disbelief in questions. why in the world did you not reveal yourself sooner? Example sentencesExamples Why in the world is this happening to me? What in the world was going on in her mind?look for all the world likeLook precisely like (used for emphasis) fossil imprints that look for all the world like motorcycle tracks Example sentencesExamples He looked for all the world like an art critic absent-mindedly contemplating a particularly engrossing landscape. He looked for all the world like a little boy who had just brought a slimy frog to his Mother and couldn't understand why she wasn't excited too. When Nadege and I passed, pushing Leyla in a stroller, looking for all the world like a very mismatched mixed-race couple with child, he smiled instinctively at the pretty baby. We crouched beside the tree, looking for all the world like a Christmas card photo. It arrived quite literally in a blaze of glory, wrapped in tinfoil with flames spurting out of the top, looking for all the world like my mum's finest Christmas pudding. She looks for all the world like a little girl who's come to ask my son to play. This year, we had a few more minutes to chat before the panel as he sat there in his wheelchair, looking for all the world like someone who couldn't recall his name, let alone past events. England and Germany looked for all the world like two teams competing to avoid the title of worst team in their sectio", "n. It looked for all the world like a very healthy clump of stinging nettles until it produced a fine display of large, pink flowers. ‘Hey, I'm in the finals,’ he beamed, looking for all the world like a kid in a sweet shop.man (or woman) of the worldA person who is experienced in the ways of sophisticated society. Example sentencesExamples Collis told Dick how Rosemary has become a woman of the world, much different from the young girl they had know", "n. Now, excuse me, I'm a man of the world, and I, for one, find this a rather worrying development. Leonardo and Michelangelo, rivals in everything, were both men of the world and men of business. What a great example Kelly is to impressionable young women of the world. As a woman of the world, Hillary, do you think I should do it? She seemed to personify what we were trying to achieve with the programme: a woman of the world who takes her destiny into her own hands. Born in Singapore, growing up in East London and now based in Los Angeles, Clarisse is a woman of the world. They went out as wide-eyed and gangly young teens, and came back seasoned men of the world, who had developed exotic tastes for horse meat, brandy, and long elegant cigarettes. It quickly became clear that Lyon is a man of the world. On the contrary, he was a man of the world, an experienced soldier, widely travelled, with close contacts with many of the leading men of affairs, both in his own city and elsewhere.not do something for the worldNot do something whatever the inducement. I wouldn't miss it for the world Example sentencesExamples This will be the fight of our lives, but I wouldn't miss it for the world. \"I wouldn't do it for the world,\" Aurora declared. Restructure or decline… A fossil fuel-based, automobile centered and throwaway economic model will not work for the world.out of this worldinformal Extremely enjoyable or impressive. a herb and lemon dressing that's out of this world Example sentencesExamples The whole proceedings were out of this world and almost impossible to describe. The quality of the play was incredible, there were several chances at both ends, there was immense tension and the atmosphere was out of this world. The job is exhausting but the rewards are out of this world. The regular baguettes have a great crust, a medium crumb and lots of taste, and the sourdough baguettes are out of this world for serving with cheese. Along with that peace comes a joy and happiness that's out of this world! Johnson's guitar solo is out of this world - it actually sounds like lead and rhythm playing together, and a brass sectio", "n. It is really out of this world with a fabulous infrastructure, it's very safe and clea", "n. The foie gras terrine was unbelievably rich, and they had a white asparagus salad which was out of this world. The clothes were out of this world and beautifully displayed. The drive was a little over an hour and the scenery was just out of this world. Synonymsmarvellous, magnificent, superb, glorious, sublime, lovely, delightful, first-class, first-ratewonderful, marvellous, magnificent, superb, glorious, sublime, lovely, delightful, first-class, first-ratesee the worldTravel widely and gain wide experience. Example sentencesExamples And it was after this walking tour that he decided he wanted to travel some more and see the world. We were young, excited about travel and seeing the world. The nanny was a woman in her fifties who decided to go travel and see the world with the rest of her life. Now his mind was firmly made up, it was travel for him, he was going to see the world. Michael had travelling in the blood and wanted to see the world. Katrine and Michel were both teachers who loved to travel and this was how they saw the world. These affluent coastal urbanites enjoy seeing the world and are more likely to travel abroad than the average America", "n.think the world ofHave a very high regard for. I thought the world of my father Example sentencesExamples I think the world of my mum, as she is so kind, caring and loving to all of us. He thought the world of his sisters and brother. After my father died, when I was 23, I discovered through others that he thought the world of me. ‘He must have thought the world of his sister,’ says the woman, ‘to do all these commemorative things for her.’ Steven was a shy, quiet lad but when he came out of his shell and people got to know him, they thought the world of him. Her family were her pride and joy and she was devoted to them and they in turn thought the world of her. He thought the world of us and would have hated for us to be unhappy. The boy thinks the world of Emilio, appreciating the kind and attentive way he treats him and his mom. And you ", "also have three loving children who think the world of you so please don't get upset- or angry- over the confrontation this afternoo", "n. She thought the world of all the children she taught over the years. Synonymsadore, hold dear, love, care very much for, feel great affection for, dote on, be devoted to, revere, esteem, admire, appreciatethe world and his wifeEverybody. now all the world and his wife seems to have heard of them Example sentencesExamples Yet here are thirteen hundred named images of babies, toddlers and pre-schoolers for the world and his wife to peer at. Our little mini apartment at the Beach House hotel is right on the boardwalk where the world and his wife, their babies and assorted pets are jogging. With the help of the media, including the Evening Press, they ensured that the world and his wife knew about the gallery raid. I know the world and his wife loves them, but I'm thoroughly sick of dinosaurs. I want the world and his wife to know what happened to my daughter. He has bad knees, and the world and his wife know it. In the Atrium there is a huge glass window overlooking the Arcade where you can sit and watch the world and his wife stagger by. Word got out we were having a party and the world and his wife turned up. Mrs Smith said: ‘That parrot would tell the world and his wife what his name is.’ It seems that the world and his wife now offer this service, which provides the home user a speed rivalling the internet connection you get in the office.a world away fromCompletely different from. her thoughtful manner is a world away from brash Alex Example sentencesExamples Their grandparents were only a 15-minute drive but a world away from the harsh neighborhood where the children lived. Such style and courtesy, and great drinks, are a world away from the arrogance and snobbery of modern day party bars which invariably close after six months. The job was a world away from his work at the time, as a child psychiatrist. The bubbly decor, playful graphics, and bright colours seemed so very modern, and a world away from archetypal greasy spoon cafes. This is the new politics, a world away from old Westminster.the world, the flesh, and the devilAll forms of temptation to si", "n. Rossetti struggled with these words in her desire to overcome the world, the flesh, and the devil Example sentencesExamples Epicurus' dubious reputation reflected the Christian tendency to regard earthly pleasures as the evil lures of the world, the flesh, and the devil. A rich understanding of the roles of God, the world, the flesh, and the devil in suffering will aid counselors in determining the best responses to their clients' pai", "n. The daily, hourly conflict with the world, the flesh, and the devil, shall at length be at an end: the enemy shall be bound; the warfare shall be over; the wicked shall at last cease from troubling; the weary shall at length be at rest. In other words, the world, the flesh, and the devil are formidable obstacles to responding to the light and grace that God gives.a (or the) world ofA very great deal of. there's a world of difference between being alone and being lonely a bit of country air will do her the world of good Example sentencesExamples A rare flower can make a world of difference to the aroma, flavour and colour of honey. Having the right pair to suit your feet and your activity can make the world of difference. A simple nod, a raise of the hand or a flash of headlights can make the world of difference. It takes very little effort to do this and it can make a world of difference to the people around them. I made good use of the pool and it made the world of difference to me and the baby. There is a world of difference between fact and opinion, and sometimes the two can get easily confused. There will always be a world of difference in taste and texture between any farmed fish and its wild relatio", "n. I have been keeping myself to myself a bit recently, and it has actually done me the world of good. I think there's a world of difference between an arranged marriage and a forced marriage. The association can rightly claim to have made a world of difference to many tragic young lives. Synonymshuge amount, vast amount, enormous amount, good deal, great deal, abundance, wealth, profusion, mountain, immensity(all) the world overEverywhere on the earth. laughter is the same language the world over Example sentencesExamples He shows that global trade has improved people's lives the world over. The water situation can be related, not only to Australia in general, but ", "also to the world over. They have made their fortunes, acquired stock options and are sought after the world over. For one, its gorgeous coloring makes it a favorite of snake and reptile collectors the world over. This is a lovely seasonal opportunity to give and it brings great joy to deprived children the world over.worlds apartVery different or distant. our daughter's school is worlds apart from school as I knew it in the 1960s Example sentencesExamples These cousins are brought up worlds apart and have enormous differences, but ", "also enormous similarities. Diplomatically, the two sides still seem worlds ap", "art. The streets are less than three miles away from each other - but in the eyes of house buyers, they are worlds ap", "art. Of course, a toddler and a pre-teen are worlds ap", "art. But the two men are worlds apart on the issue of race. It's ridiculous - we live in the same city but it feels like we're all worlds ap", "art. The exhibition was staged across two very different urban sites, which although linked by a short bus ride are worlds apart in terms of economic and social infrastructure. It ", "also has brought together communities that are worlds apart to enrich each other culturally, socially and economically. Not just their locations make these two books worlds apart, they are different in style and structure too. Although the three opposition leaders are worlds apart on most issues of policy, they do have two very important things in commo", "n. Synonymsunsuited, mismatched, ill-matched, poles apart, worlds apart, like day and nightOriginOld English w(e)oruld, from a Germanic compound meaning 'age of man'; related to Dutch wereld and German Welt.The ancient root of world meant ‘age or life of man’. The first part is the same as were- in werewolf (see wolf)—it means ‘man’—and the second part is related to old. The Anglo-Saxons first used world to mean ‘human existence, life on earth’ as opposed to future life in heaven or hell. America was first called the New World in 1555, and Europe, Asia, and Africa the Old World at the end of that century. Olde worlde is a ‘fake’ antiquated spelling for old-fashioned things intended to be quaint and attractive, and dates only from the 1920s. The developing countries of Asia, Africa, and Latin America were initially known as the Third World in the 1950s by French writers who used tiers monde, ‘third world’, to distinguish the developing countries from the capitalist and Communist blocs. The first use in English came in 1963. The best of all worlds or of all possible worlds is from Candide (1759) by the French writer Voltaire. It is a translation of a statement by the ever-optimistic Pangloss, ‘Everything is for the best in the best of all possible worlds’. The character of Pangloss, who remained constantly cheerful despite all the disasters that happened to him and his travelling companions, is a satire on the views of the German philosopher Leibniz, who believed this philosophy. See ", "also optimism, oyster, whim, wifenou", "n.1 phr.Definition of world in US English: world nounwərldwərld1usually the worldThe earth, together with all of its countries, peoples, and natural features. he was doing his bit to save the world Example sentencesExamples The students come from all over the world, a wonderful combination of people. Soils, such as podzols, which are zonal in some parts of the world might be intrazonal in other areas. The sea connotes what the land is not, yet together they form the world's surfaces. They've sold three million albums, toured all over the world and have been together for almost a decade. Oliver is hoping to climb his way into the history books by planting a flag at the summit of the world's tallest mountai", "n. He admits the prospect of seven days cycling over some of the world's most inhospitable terrain is a bit daunting. It is truly wonderful to have a whole lot of girl-friends living in various parts of the world. The Himalayas is the highest and one of the most beautiful mountain ranges of the world. Today we see a vast new working class brought together in great conurbations across the world. What is astonishing is how little our cartographic concept of the world has changed since the", "n. Annually millions of Canadians travel to other nations all over the world for a whole variety of reasons. Using your bike for errands is a great way to do your little part to save the world. Today, I spent my whole day meeting with the representatives from all over the world. The couple travelled the world together three years ago and fell in love with Asia. Not all of these acts proved to be that useful later on, but it gave you the feeling you did your bit to save the world. I thank them for going and sharing some time in that wonderful part of the world. There are many mountain ranges throughout the world, all of various ages and sizes. However, only they can choose what to do and they have all chosen to try and save the world they live i", "n. Some may argue that we should look after our own before we go off trying to save the world. Before they rush out to say that they want to save the world - how about themselves? Synonymsearth, globe, planet, sphere1.1the world All of the people, societies, and institutions on the earth.as modifier world affairs Example sentencesExamples Am I first a woman and then a member of my society, community, world, or vice versa? Let her go abroad and tell the world how primitive is the structure of our society. To be a man you have to be a businessman who faces the world by himself and who has to fight the whole world by himself. He hung a map of the world on the wall in his little cottage, and he read as widely as he could about world affairs. It's a nice thought that there's someone who loves you, even when you think the whole world hates you. Yet the financial crisis has been so severe that its impact has disturbed the world economy as a whole. Africa cannot jump into a world market economy as quickly as it wants. These children need to know that their stories are important to the world outside. The collapse of the world economy was felt hardest amongst the working classes of the North East. He never felt love and because of that, hated the world and the world hated him in retur", "n. For all their failings, journalists serve the societies they live in and the world at large. I want to prove to myself and to the world that my life is whole agai", "n. There are, of course, major differences between the European Union and the world as a whole. They sometimes wonder why the rest of the world hates them so much. We truly are entering one of the most important times in world history. She stayed there for hours, crying for her brother, and hating the world for taking him away. The fall in European growth rates has implications for the world economy as a whole. On the contrary, the world economy as a whole is marked by slow growth and outright stagnatio", "n. Sovereignty still remains a supremely important institution of world politics. On a more serious note, it would appear that the world as a whole is sinking deeper into poverty. Synonymseveryone, everybody, each and every one, people, mankind, humankind, humanity, people everywhere, the whole world, the world at large, the public, the general public, the population, the populace, all and sundry, every mother's son, every tom, dick, and harry, every man jack1.2as modifier Denoting one of the most important or influential people or things of its class. they had been brought up to regard France as a world power Example sentencesExamples Ireland could be the world leader in online tourism within the next two years. The fun run set the world record for the largest gathering of Santas in one place. Las Vegas, said Ashley, was the perfect setting for the world powerlifting championships. Imagine how exciting it was to watch this British athlete set a world record and beat a world superstar. In the world championship final in Paris she was left standing by a 67-second lap. The squad fly out on Friday, with less than 24 hours to settle in before meeting the world champions. He became the biggest superstar of world rugby, but he is an understated hero. After the day of British champions comes an evening for world superstars. All schools that took part will receive a certificate confirming their success in winning the world record. It is the group's strategy to become one of the world leaders in the textile industry, he said. He's the world knife-throwing champion - and he's about to throw those knives at me. He will take it on the chin and be back at the Crucible where I think he has at least another three or four chances to win back the world title. There are tournaments to play that move you up the world rankings and that's more important now. He had his first race just two days after his sixth birthday at the world championship track near Swindo", "n. I hope I can go as far as reaching the world number one, but I realize it requires hard work. Afterwards, the world number one was distinctly underwhelmed with the outcome. He went to the Olympic Games as the world number one intending only to return with the gold medal, but it was not to be. And the world number one gave one journalist short shrift when asked what was wrong with his game. They are the world champions and a class side, but if they are not quite on their game, that is when you can get at them. My gut feeling is that the world champions will have to fight very hard to maintain their winning streak in Edinburgh.1.3 Another planet like the earth. the possibility of life on other worlds Example sentencesExamples Now, what we don't know is how many of those Earth size worlds actually have liquid water that could cook up life or will have cooked up life. It is quite likely that future interstellar explorers will have a wide range of new worlds to explore. The asteroids are tiny worlds that should have clumped together to form another major planet. But the main purpose of this spacecraft will be to carry astronauts beyond our orbit to other worlds. Astronomers had initially expected that other solar systems would follow the pattern of our own: small rocky worlds close to the star and gas giants further out. Someday solar sails might be used to send astronauts to new worlds around other stars. Intriguingly, this class of worlds includes the Martian moons, from which fully reversible Mars missions could ultimately be staged. The research may eventually be applied to remove radiation belts around the Earth and other worlds, reducing the hazards of the space environment. A new computer model designed to explore the range of possibilities for planet formation around other stars had no trouble coming up with worlds similar to Earth. Astronomers are finding new worlds by the dozen - settling one ancient debate and sparking a multitude of others. At the beginning of the twenty-first century, people are excited by the prospect of visiting new worlds in outer space. Nevertheless, of all the worlds in our solar system, Mars is most like Earth. But telepresence has been used primarily to explore other worlds. For one thing, astronomers discovered the Kuiper belt, a teeming ensemble of miniature worlds within which Pluto orbits. His ideas on cosmology are quite remarkable for he not only argued for a moving Earth, but he ", "also argued for an infinite universe containing other stars like the Sun and other worlds like the Earth. There has been an explosion in the number of astronomers scanning the skies for the telltale wobble of distant worlds. We might instead settle worlds without life, such as Earth's Moon or the asteroids. It showed the planets as worlds - some greater, some less, than our earth - but all much vaster than the earth as she had been regarded in ancient times. By studying alien worlds, such as Venus, Mars or Saturn's moon Titan, we can place our own world in context. For centuries humanity had dreamed of reaching out to the stars, settling on worlds beyond our solar system. Synonymsplanet, satellite, moon, star, heavenly body, orb1.4 The material universe or all that exists; everything. Example sentencesExamples It makes me wonder about the dynamics of life and how we exist in this world. Everything about the world can be explained by him in terms of the shadows. Being a father is not just about contact: the child needs financial security in this material world. Our protagonist is against this obsession with the material world, but he is haunted by it. The living entity is eternal, and he existed before the creation of this material world.2A region or group of countries. the English-speaking world Example sentencesExamples The richest country in the industrialised world will continue to have some of the worst pockets of poverty. By the western part of the Arabic world we mean the regions comprising mainly North Africa and Spai", "n. Have you ever seen an Arab world as divided as it is right now? Croatia is actually located in Central Europe, but it has bridged the Eastern and Western worlds throughout its history. Yet those of us lucky enough to live in the developed world do not need to cope with such problems. But in the developed, Western world, the feasting periods are no longer interspersed with famines. Several countries in the developing world continue to invite him to help train their own surgeons. Secondly, not all of the developed western world might be seen as civilised. It's one of the most outrageous breaches of human rights in the history of the western world. The issue has echoes of the Arab world's historical struggle to assert its own destiny. Rather different number systems were used simultaneously in the Arabic world over a long period of time. The range of swear words in the modern English-speaking world is tiny, as you know. In many parts of the Western world the media still describe this as the only safe route to peace and stability. Eastern religions are popular across the entire Western world at this time, especially Buddhism, and especially in America.2.1 A period of history. the ancient world Example sentencesExamples Though we think of the Seven Wonders of the Ancient World as a single list today, there were actually a number of lists compiled by different Greek writers. As the title suggests, Ferguson believes that the British Empire shaped the modern world. In the ancient and classical worlds, capital tended to be drawn into cities from the surrounding regions, so that they could become wealthier even in the absence of economic growth. They are now, rightly, seen as an essential element in a proper understanding of the medieval world-view, important to anyone with an interest in the art, literature, philosophy and social structure of that time. I sometimes imagine that I see certain parallels between modern Aotearoa and the historical worlds of that other boot-shaped nation, Italy.2.2 A group of living things. the animal world Example sentencesExamples But first, they must learn the rules of both the animal and the human worlds. Lying is one of the most human of traits that really distinguishes us from the rest of the animal world. The mineral, vegetable, and animal worlds do exactly what they're created to do. Insects are some of the least understood creatures in the animal world. There ", "also seems to be little evidence of genuine teaching in the animal world. The tiger's immense power and strength give it an aura unmatched in the animal world. Then she takes that a step further by pretty much banning any human interference in the animal world. He is seated on a tiger skin, a symbol of power, showing his mastery over the animal world. Our folklore and arts and crafts reflect our love and reverence for the animal world. Either way, the switch of identities between the human, sacred and animal worlds is a feature of Mongolian belief as it is in countless other folk religions. For the next three decades Eva will be the communicator-the connection between the animal and human worlds. The presenter uses amusing approaches to introduce children to the animal world. There is a close relationship in Scripture between the animal world and the demonic. She is equally trapped between animal and human worlds. On examination, it reveals a coded significance, uniting the worlds of animals, birds, humans and demigods, proposing itself as an image of the universe. There is no boundary between the vegetable, animal and human worlds. She borrows it from the animal world and evokes or invokes it on the subject of procreatio", "n. Many of these directly incorporate works of art - the art of the wheelchair bound Horibe, whose paintings meld the plant and animal worlds. This phenomenon is widespread, occurring in nearly all the major taxa of the plant, animal, and microbial worlds. He expected to find similarities in structure within each branch of the animal world.2.3 The people, places, and activities to do with a particular thing. they were a legend in the world of British theater Example sentencesExamples He is easily transported back to his playing days and into a football world vastly different from today's. They're all hot, contemporary artists who are taking the art world by storm. In his biography, he comes across as a person comfortably astride various worlds: theatre, painting, books and film. The new company will represent talent from the worlds of theatre, film, television and literature in Scotland. He still characterises himself as having a foot in both the stand-up and theatre worlds and is currently working with Murphy on putative comic projects. It's only a matter of time before he is forced to leave his boyhood club and has the football world at his feet. Beaufort inhabited the scientific world dominated by the chronometer invented by John Harriso", "n. The award-winning film composer has struck a chord in the worlds of film, theatre, classical and pop. He said the bid could eventually include people from ‘the worlds of football and motorsport’, but said he was unable to give details. The theatre world found this extremely amusing, although the actor reputedly did not. Yet in the unsentimental world of modern football, it could just happe", "n. The paintings of a Mancunian former teacher have taken the art world by storm after years of obscurity. The insular world of the theatre is more commonly a sanctuary from reality. A new form of art had come about quite naturally, yet its presence took the art world by storm. He decided the theatre world was a good place to trawl not only for people with money but ", "also for girls. So he pursued his dream, by entering the theatre world and then going on to the big scree", "n. Ken, whose background is in media and publishing in the commercial and academic worlds, now employs three full-time staff and a number of part-time staff. Someone from outside will have a different experience of the football world. It happens in the football world but it's one of those things you keep quiet about. The world of football is small, and once you deal with a manager, club or a player, relations develop. Synonymssphere, society, circle, arena, milieu, province, domain, territory, orbit, preserve, realm, field, discipline, area, department, sector, section, group, division2.4one's world A person's life and activities. he felt his whole world had collapsed Example sentencesExamples It came as such a shock, and our worlds literally fell i", "n. My whole world has fallen apart and left me feeling hopeless and depressed. She drove slowly because the sudden collapse of her whole world was affecting the steadiness of her hands. This is my small world and the reality of living with chronic illness. She's the center of his whole world.3Human and social interactio", "n. he has almost completely withdrawn from the world how inexperienced she is in the ways of the world Example sentencesExamples Children use toys to imagine the world and to interact with it, learning skills that will be of value in later life. These are serious blows to our sense of who we are, what we expect of the world and of our interactions with others. I become irrational, cannot think straight and interact with the world in an entirely strange way. We teach our students that they are obliged to study the broader social world. He is constantly frustrated by his inability to change the way the world works more quickly and radically. It is a fundamental dispute about the way the world works and what our role in it should be. That is the way the world works and why should any one make an exception in my case? For without a contrast model the world has no way to know or feel the oddness of its dependence on power for survival. I sit here and all my interaction with the world goes fuzzy as if I am falling asleep. Every artist looks at the world in a definite social manner, whether he or she knows it or not. I may have been naïve, but even I knew a little about the way the world worked. He wants us to see his work in precisely the same way we observe the world as we move through it. That seemed to be the way the world worked, people leaving you the minute you didn't have a thing left to offer them. It gets you interacting with the world in all sorts of different ways. Autism cuts off its sufferers from the world by impairing social skills and imaginative development. Synonymssociety, high society3.1 Secular interests and affairs. parents are not viewed as the primary educators of their own children, either in the world or in the Church Example sentencesExamples People who see the world in terms of evil and sin will tend to devalue the material world. The concept of Hell as a literal place has declined in an increasingly secular world. There is a primary difference between the material world and the spiritual dimensio", "n. The militantly secular world is ", "also keenly alert to the challenge of the Passio", "n. It seems to be a connector or a medium between the materialistic world and the spiritual world.3.2in singular A stage of human life, either mortal or after death. in this world and the next Example sentencesExamples Then the oxygen machine arrived, the pain medications increased, and my mother slipped out of this world and into the next. The two ideas could be linked: after all, cremation is itself a wall of fire that is a boundary between this world and the next. This is an inspiring talk that will help us to establish our own priorities for this world and the next. I know who I am, and I know that I can only be myself, because that is the only thing I will carry out of this world, my soul.Phrasesbe not long for this worldHave only a short time to live. Example sentencesExamples A child, not long for this world should have a heavenly name. One can only assume that the 95-year old is not long for this world. In act, Dan was still laying drains well after doctors told him he was not long for this world. I'm going to need a new chair for the coming season - my old one, made of metal tubing, has developed an alarming creak over the winter and is not long for this world, I fear. There are a few who know the reasons behind the murders, but they too are not long for this world. In general, my tastes in television are a reliable guide to what's about to get cancelled - if I like it, it is not long for this world. Sure enough, I tracked him down only to find out that he's extremely ill and possibly not long for this world. One way or another, whether we like it or not we are all not long for this world. As I watched and listened to Marie, I was overwhelmed by the love she showed this sick, frail man - not long for this world, with nothing to give her in retur", "n. Sadly however, like our four other sisters, Caroline, Sophie, Amelie and Victory, he was not long for this world.the best of both (or all possible) worldsThe benefits of widely differing situations, enjoyed at the same time. Example sentencesExamples The council wanted the best of both worlds - trees to enhance the area, but no liability for them once it had officially protected them. This type of work/life situation can be the best of both worlds - challenging work and plenty of support at home. And there is absolutely nothing wrong with wanting the best of both worlds where culture is concerned. I don't see it as being hypocritical, but rather as having the best of both worlds. Enjoy the best of both worlds with our insider advice about three fun destinations Many of us in this prosperous country are fortunate to be able to have the best of both worlds. Education officers claim the scheme offers the best of both worlds and has the most flexibility to meet children's needs. Situated not far from the beach you can enjoy the best of both worlds in this relaxed but upmarket centre. Instead, they frequently enjoy the best of both worlds. Splits were thought to offer investors the best of both worlds and ideal for people saving for school fees or for retirement.bring someone into the worldGive birth to or assist at the birth of someone. Example sentencesExamples Even at an early age I wondered why children are routinely named after their fathers, especially when the job of bringing them into the world is solely the responsibility of the mother. She managed to be both gentle and authoritative and I trusted her to bring you into the world. She was rushed into hospital, where doctors tried to stop the labour to no avail and baby Adam was brought into the world over three months premature. Cathy's labor didn't last long, and in only an hour and a half, baby Daisy was brought into the world. My poor mother had died bringing me into the world. Anyway, never forget what she went through to bring you into the world. Surgeons brought him into the world using forceps after two earlier attempts to deliver him by ventouse extraction had failed. Young Oliver Twist is left in the care of a workhouse near London when his mother dies bringing him into the world. Abigail, a child of great beauty and undiscovered talent, has a safe and loving home with the midwife who brought her into the world. Mother's Day should be the most important festival of the year, because it honours the person who brought us into the world.come into the worldBe bor", "n. Example sentencesExamples The chimes of Big Ben had barely struck when little Sam came into the world at just one minute past midnight on New Year's Day. My most heart-melting moments were when each of them came into the world. Her twins came into the world at 25 weeks and five days - Tom weighing 749g and Bonnie 620g. The baby will come into the world, perhaps kicking and screaming, but babyhood will only be the beginning of a continuing process of growth and change. After they come into the world, they are cleaned right in the room and then put on a special bed. Maybe Saskia just wasn't ready to come into the world. Screaming lustily, apparently as healthy as his sister despite the awkward way he came into the world, the second child was bor", "n. Forty minutes after Mia had come into the world, her identical twin sister Mona was bor", "n. The boy would come into the world without a father. No one wants to see their child undergo an operation and Louise has already had a tough time coming into the world.come up (or go down) in the worldRise (or drop) in status, especially by becoming richer (or poorer). Example sentencesExamples This neighborhood is going through a transition, and it is coming up in the world, and that fire station will only add to the quality of life for the community. He's come up in the world considerably since the", "n. He has had to sell his flat in Mayfair because of his bankruptcy, ‘but he has a new flat in Mayfair for his wife and daughter so he's hardly gone down in the world.’ Everybody knows that perfectly good teaching institutions can come to neglect the undergraduates and grind up the idealism of young academics because the faculty, or deans, or provosts want to come up in the world. Some personal names have undoubtedly gone down in the world. Lincoln is a city that's come up in the world since last I gave it close inspection, in my RAF days forty years ago. ‘You've come up in the world Ms. Johnson,’ he said, not hiding his antagonism. I thought for sure we'd seen the last of you all those years ago… My, you've come up in the world! Now it is coming up in the world and is a charming bohemian quarter. His mother said the Pilgrims were coming up in the world.in the worldUsed for emphasis in questions, especially to express astonishment or disbelief. why in the world did you not reveal yourself sooner? Example sentencesExamples Why in the world is this happening to me? What in the world was going on in her mind?look for all the world likeLook precisely like (used for emphasis) fossil imprints that look for all the world like motorcycle tracks Example sentencesExamples When Nadege and I passed, pushing Leyla in a stroller, looking for all the world like a very mismatched mixed-race couple with child, he smiled instinctively at the pretty baby. He looked for all the world like a little boy who had just brought a slimy frog to his Mother and couldn't understand why she wasn't excited too. England and Germany looked for all the world like two teams competing to avoid the title of worst team in their sectio", "n. He looked for all the world like an art critic absent-mindedly contemplating a particularly engrossing landscape. She looks for all the world like a little girl who's come to ask my son to play. It arrived quite literally in a blaze of glory, wrapped in tinfoil with flames spurting out of the top, looking for all the world like my mum's finest Christmas pudding. We crouched beside the tree, looking for all the world like a Christmas card photo. ‘Hey, I'm in the finals,’ he beamed, looking for all the world like a kid in a sweet shop. It looked for all the world like a very healthy clump of stinging nettles until it produced a fine display of large, pink flowers. This year, we had a few more minutes to chat before the panel as he sat there in his wheelchair, looking for all the world like someone who couldn't recall his name, let alone past events.man (or woman) of the worldA person who is experienced in the ways of sophisticated society. Example sentencesExamples Now, excuse me, I'm a man of the world, and I, for one, find this a rather worrying development. They went out as wide-eyed and gangly young teens, and came back seasoned men of the world, who had developed exotic tastes for horse meat, brandy, and long elegant cigarettes. She seemed to personify what we were trying to achieve with the programme: a woman of the world who takes her destiny into her own hands. It quickly became clear that Lyon is a man of the world. Born in Singapore, growing up in East London and now based in Los Angeles, Clarisse is a woman of the world. Leonardo and Michelangelo, rivals in everything, were both men of the world and men of business. What a great example Kelly is to impressionable young women of the world. Collis told Dick how Rosemary has become a woman of the world, much different from the young girl they had know", "n. As a woman of the world, Hillary, do you think I should do it? On the contrary, he was a man of the world, an experienced soldier, widely travelled, with close contacts with many of the leading men of affairs, both in his own city and elsewhere.not do something for the worldNot do something whatever the inducement. I wouldn't miss it for the world Example sentencesExamples \"I wouldn't do it for the world,\" Aurora declared. This will be the fight of our lives, but I wouldn't miss it for the world. Restructure or decline… A fossil fuel-based, automobile centered and throwaway economic model will not work for the world.out of this worldinformal Extremely enjoyable or impressive. an herb and lemon dressing that's out of this world Example sentencesExamples The drive was a little over an hour and the scenery was just out of this world. The clothes were out of this world and beautifully displayed. The foie gras terrine was unbelievably rich, and they had a white asparagus salad which was out of this world. The job is exhausting but the rewards are out of this world. Johnson's guitar solo is out of this world - it actually sounds like lead and rhythm playing together, and a brass sectio", "n. Along with that peace comes a joy and happiness that's out of this world! The whole proceedings were out of this world and almost impossible to describe. The regular baguettes have a great crust, a medium crumb and lots of taste, and the sourdough baguettes are out of this world for serving with cheese. It is really out of this world with a fabulous infrastructure, it's very safe and clea", "n. The quality of the play was incredible, there were several chances at both ends, there was immense tension and the atmosphere was out of this world. Synonymsmarvellous, magnificent, superb, glorious, sublime, lovely, delightful, first-class, first-ratewonderful, marvellous, magnificent, superb, glorious, sublime, lovely, delightful, first-class, first-ratesee the worldTravel widely and gain wide experience. Example sentencesExamples And it was after this walking tour that he decided he wanted to travel some more and see the world. Katrine and Michel were both teachers who loved to travel and this was how they saw the world. The nanny was a woman in her fifties who decided to go travel and see the world with the rest of her life. We were young, excited about travel and seeing the world. Now his mind was firmly made up, it was travel for him, he was going to see the world. These affluent coastal urbanites enjoy seeing the world and are more likely to travel abroad than the average America", "n. Michael had travelling in the blood and wanted to see the world.think the world ofHave a very high regard for (someone) I thought the world of my father Example sentencesExamples ‘He must have thought the world of his sister,’ says the woman, ‘to do all these commemorative things for her.’ He thought the world of his sisters and brother. Her family were her pride and joy and she was devoted to them and they in turn thought the world of her. Steven was a shy, quiet lad but when he came out of his shell and people got to know him, they thought the world of him. I think the world of my mum, as she is so kind, caring and loving to all of us. He thought the world of us and would have hated for us to be unhappy. After my father died, when I was 23, I discovered through others that he thought the world of me. The boy thinks the world of Emilio, appreciating the kind and attentive way he treats him and his mom. She thought the world of all the children she taught over the years. And you ", "also have three loving children who think the world of you so please don't get upset- or angry- over the confrontation this afternoo", "n. Synonymsadore, hold dear, love, care very much for, feel great affection for, dote on, be devoted to, revere, esteem, admire, appreciatethe world, the flesh, and the devilAll forms of temptation to si", "n. Example sentencesExamples In other words, the world, the flesh, and the devil are formidable obstacles to responding to the light and grace that God gives. The daily, hourly conflict with the world, the flesh, and the devil, shall at length be at an end: the enemy shall be bound; the warfare shall be over; the wicked shall at last cease from troubling; the weary shall at length be at rest. A rich understanding of the roles of God, the world, the flesh, and the devil in suffering will aid counselors in determining the best responses to their clients' pai", "n. Epicurus' dubious reputation reflected the Christian tendency to regard earthly pleasures as the evil lures of the world, the flesh, and the devil.a (or the) world ofA very great deal of. there's a world of difference between being alone and being lonely Example sentencesExamples Having the right pair to suit your feet and your activity can make the world of difference. A simple nod, a raise of the hand or a flash of headlights can make the world of difference. There is a world of difference between fact and opinion, and sometimes the two can get easily confused. I think there's a world of difference between an arranged marriage and a forced marriage. There will always be a world of difference in taste and texture between any farmed fish and its wild relatio", "n. I have been keeping myself to myself a bit recently, and it has actually done me the world of good. It takes very little effort to do this and it can make a world of difference to the people around them. I made good use of the pool and it made the world of difference to me and the baby. A rare flower can make a world of difference to the aroma, flavour and colour of honey. The association can rightly claim to have made a world of difference to many tragic young lives. Synonymshuge amount, vast amount, enormous amount, good deal, great deal, abundance, wealth, profusion, mountain, immensity(all) the world overEverywhere on the earth. Example sentencesExamples They have made their fortunes, acquired stock options and are sought after the world over. For one, its gorgeous coloring makes it a favorite of snake and reptile collectors the world over. He shows that global trade has improved people's lives the world over. The water situation can be related, not only to Australia in general, but ", "also to the world over. This is a lovely seasonal opportunity to give and it brings great joy to deprived children the world over.worlds apartVery different or distant. Example sentencesExamples Diplomatically, the two sides still seem worlds ap", "art. These cousins are brought up worlds apart and have enormous differences, but ", "also enormous similarities. It's ridiculous - we live in the same city but it feels like we're all worlds ap", "art. Not just their locations make these two books worlds apart, they are different in style and structure too. It ", "also has brought together communities that are worlds apart to enrich each other culturally, socially and economically. Of course, a toddler and a pre-teen are worlds ap", "art. Although the three opposition leaders are worlds apart on most issues of policy, they do have two very important things in commo", "n. The exhibition was staged across two very different urban sites, which although linked by a short bus ride are worlds apart in terms of economic and social infrastructure. The streets are less than three miles away from each other - but in the eyes of house buyers, they are worlds ap", "art. But the two men are worlds apart on the issue of race. Synonymsunsuited, mismatched, ill-matched, poles apart, worlds apart, like day and nightOriginOld English w(e)oruld, from a Germanic compound meaning ‘age of man’; related to Dutch wereld and German Welt.nou", "n.1 phr."]}], "usphone": "", "ukphone": ""}